MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_tim.c
  * @brief   TIM HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Timer (TIM) peripheral:
  *           + TIM initialization/de-initialization
  *           + TIM state and error functions
  *           + TIM time base functions
  *           + TIM output channel functions
  *           + TIM input channel functions
  *           + TIM one-pulse functions
  *           + TIM encoder functions
  *           + TIM external trigger configuration
  *           + TIM master/slave functions
  *           + TIM OCRef clear functions
  *           + TIM DMA burst functions
  *           + TIM break functions
  *           + TIM dead-time functions
  *           + TIM protection
  *           + TIM commutation feature control
  *           + TIM software event generation
  *           + TIM IRQ handler and callback functions
  *           + TIM setter and getter for user data
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  *  @{
  */
#if defined (TIM1)  \
 || defined (TIM2)  \
 || defined (TIM3)  \
 || defined (TIM4)  \
 || defined (TIM5)  \
 || defined (TIM6)  \
 || defined (TIM7)  \
 || defined (TIM8)  \
 || defined (TIM12) \
 || defined (TIM15) \
 || defined (TIM16) \
 || defined (TIM17)
#if defined (USE_HAL_TIM_MODULE) && (USE_HAL_TIM_MODULE == 1)

/** @addtogroup TIM
  *  @{
  */
/** @defgroup TIM_Introduction TIM Introduction
  * @{

  - The TIM hardware abstraction layer (HAL) provides a set of APIs to interface with STM32 timers.

  - STM32 timers (TIM) are used for precise time base generation, pulse width modulation (PWM), and event
    measurement, such as input capture and output compare. They enable motor control, signal timing, and encoder
    decoding in embedded systems.

  - The TIM HAL driver simplifies the configuration, initialization, and management of timer operations by supporting
    various modes such as polling, interrupt, and DMA, enabling flexible and efficient timer control.

  - Additionally, it supports multiple timer types (advanced-control, general-purpose, lite, and basic timers)
    depending on the STM32 device, ensuring portability and consistency across different STM32 series.
  */
/**
  * @}
  */

/** @defgroup TIM_How_To_Use TIM How To Use
  * @{

  # TIMER Generic features
  Depending on the timer's type (Basic, Lite, General-purpose, Advanced), the timer features include:
  - 16-bit or 32-bit up, down, up/down auto-reload counter.
  - 16-bit programmable prescaler allowing division (also on the fly) of the
  counter clock frequency by any factor between 1 and 65536.
  - Up to 7 independent channels for:
    - Input Capture
    - Output Compare
    - PWM generation (Edge and Center-aligned Mode)
    - One-pulse mode output
  - Complementary outputs with programmable dead-time
  - Synchronization circuit to control the timer with external signals and to interconnect
  several timers together.
  - Repetition counter to update the timer registers only after a given number of cycles
  of the counter.
  - Encoder interface mode
  - Preload feature:\n
    The preload feature is available for:
    - The auto-reload timer register (TIMx_ARR)
    - The timer prescaler register (TIMx_PSC) (cannot be turned off)
    - The timer channel registers (TIMx_CCRy)
    - ...

  # Callback registration

  The compilation flag USE_HAL_TIM_REGISTER_CALLBACKS, when set to 1,
  allows the user to configure the driver callbacks dynamically.

  Use the function HAL_TIM_Register<Callback_name>() to register a callback.

  It takes the HAL peripheral handle and a pointer to the user callback function.

  These functions allow registration of the following callbacks:
  @if defined(USE_HAL_TIM_REGISTER_CALLBACKS)
    - @ref HAL_TIM_RegisterErrorCallback                : TIM Error Callback.
    - @ref HAL_TIM_RegisterUpdateCallback               : TIM Period Elapsed Callback.
    - @ref HAL_TIM_RegisterUpdateHalfCpltCallback       : TIM Period Elapsed half complete Callback.
    - @ref HAL_TIM_RegisterTriggerCallback              : TIM Trigger Callback.
    - @ref HAL_TIM_RegisterTriggerHalfCpltCallback      : TIM Trigger half complete Callback.
    - @ref HAL_TIM_RegisterInputCaptureCallback         : TIM Input Capture Callback.
    - @ref HAL_TIM_RegisterInputCaptureHalfCpltCallback : TIM Input Capture half complete Callback.
    - @ref HAL_TIM_RegisterCompareMatchCallback         : TIM Compare Match Callback.
    - @ref HAL_TIM_RegisterCompareMatchHalfCpltCallback : TIM Compare Match half complete Callback.
    - @ref HAL_TIM_RegisterCommutationCallback          : TIM Commutation Callback.
    - @ref HAL_TIM_RegisterCommutationHalfCpltCallback  : TIM Commutation half complete Callback.
    - @ref HAL_TIM_RegisterBreakCallback                : TIM Break Callback.
    - @ref HAL_TIM_RegisterBreak2Callback               : TIM Break2 Callback.
    - @ref HAL_TIM_RegisterSystemBreakCallback          : TIM System Break Callback.
    - @ref HAL_TIM_RegisterSoftwareBreakCallback        : TIM Software Break Callback.
    - @ref HAL_TIM_RegisterEncoderIndexCallback         : TIM Encoder Index Callback.
    - @ref HAL_TIM_RegisterDirectionChangeCallback      : TIM Direction Change Callback.
    - @ref HAL_TIM_RegisterIndexErrorCallback           : TIM Index Error Callback.
    - @ref HAL_TIM_RegisterTransitionErrorCallback      : TIM Transition Error Callback.
  @endif


  By default, after initialization and when the state is HAL_TIM_STATE_INIT,
  all interrupt callbacks are set to the corresponding weak functions HAL_TIM_<Callback_name>().

  Callbacks can be registered only in the @ref HAL_TIM_STATE_IDLE state.

  When the compilation flag USE_HAL_TIM_REGISTER_CALLBACKS is set to 0 or
  not defined, the callback registration feature is not available, and all callbacks
  are set to the corresponding weak functions.

  # How to use this driver

  Use the TIM driver for purposes including:
    - Time base generation
    - Measuring the pulse lengths and duty cycle of input signals (input capture)
    - Generating output waveforms (output compare, PWM, complementary PWM with dead-time insertion)
    - Pulse generation
    - Determining rotor speed/position feedback provided by a quadrature encoder or a hall sensor

  Use the following programming sequence:
    - Initialize the TIM handle (registration of a particular instance).
    - Configure the different resources of the timer depending on the usage.
    - Start channels, if needed, and then start the timer counter.
  */
/**
  * @}
  */

/** @defgroup TIM_Configuration_Table TIM Configuration Table
  * @{
  # Configuration inside the TIM driver

  Config defines                 | Where            | Default value     | Note
  ------------------------------ | ---------------- | ----------------- | -------------------------------------------
  USE_HAL_TIM_MODULE             | hal_conf.h       | 1                 | HAL TIM module is enabled
  USE_HAL_TIM_DMA                | hal_conf.h       | 1                 | Enable the DMA code inside TIM
  USE_HAL_TIM_REGISTER_CALLBACKS | hal_conf.h       | 0                 | Enable register callback feature
  USE_HAL_TIM_CLK_ENABLE_MODEL   | hal_conf.h       | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
  USE_HAL_CHECK_PARAM            | hal_conf.h       | 0                 | Enable run-time parameter check
  USE_HAL_CHECK_PROCESS_STATE    | hal_conf.h       | 0                 | Enable atomic access to process state check
  USE_ASSERT_DBG_PARAM           | PreProcessor env | NA                | Enable the parameter assert
  USE_ASSERT_DBG_STATE           | PreProcessor env | NA                | Enable the state assert
  USE_HAL_TIM_GET_LAST_ERRORS    | hal_conf.h       | 0                 | Enable retrieving the error codes
  USE_HAL_TIM_USER_DATA          | hal_conf.h       | 0                 | Add an user data inside HAL TIM handle
  */
/**
  * @}
  */

