MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/* Private types -------------------------------------------------------------*/
/** @defgroup TIM_Private_Types TIM Private Types
  *  @{
  */

/** Alias for the CMSIS instance type definition */
typedef TIM_TypeDef tim_t;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief TIM channels DMA request structure definition.
  */
typedef struct
{
  /** DMA request for the channel */
  uint32_t dma_req;

  /** DMA handle index for the channel */
  hal_tim_dma_index_t dma_idx;

} tim_cc_dma_config_t;

/**
  * @brief DMA handle configuration structure definition.
  */
typedef struct
{
  /** DMA request for the channel */
  uint32_t dma_req;

  /** DMA data half transfer complete callback */
  hal_dma_cb_t halfcplt_cb;

  /** DMA data transfer complete callback */
  hal_dma_cb_t cplt_cb;

  /** DMA handle index for the channel */
  hal_tim_dma_index_t dma_idx;

} tim_dma_config_t;
#endif /* USE_HAL_TIM_DMA */
/**
  *  @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup TIM_Private_Constants  TIM Private Constants
  *  @{
  */

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Number of TIM channels supporting DMA requests.
  */
#define NB_TIM_CC_DMA_CONFIG  (4U)

/**
  * @brief LUT to associate a DMA request and ID for a TIM channel.
  */
static const tim_cc_dma_config_t dma_channel_info[NB_TIM_CC_DMA_CONFIG] =
{
  {LL_TIM_DIER_CC1DE, HAL_TIM_DMA_ID_CC1},
  {LL_TIM_DIER_CC2DE, HAL_TIM_DMA_ID_CC2},
  {LL_TIM_DIER_CC3DE, HAL_TIM_DMA_ID_CC3},
  {LL_TIM_DIER_CC4DE, HAL_TIM_DMA_ID_CC4}
};
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief LL TIM Channels lookup table.
  * @note  Indices are given by @ref hal_tim_channel_t or @ref hal_tim_oc_compare_unit_t.
  */
static const uint32_t ll_tim_channels[HAL_TIM_CHANNELS] =
{
  LL_TIM_CHANNEL_CH1,
  LL_TIM_CHANNEL_CH2,
  LL_TIM_CHANNEL_CH3,
  LL_TIM_CHANNEL_CH4,
  LL_TIM_CHANNEL_CH5,
  LL_TIM_CHANNEL_CH6,
  LL_TIM_CHANNEL_CH7,
  LL_TIM_CHANNEL_CH1N,
  LL_TIM_CHANNEL_CH2N,
  LL_TIM_CHANNEL_CH3N,
  LL_TIM_CHANNEL_CH4N,
};

/**
  * @brief Mask for all LL channels.
  */
#define TIM_ALL_LL_CHANNELS (LL_TIM_CHANNEL_CH1 | LL_TIM_CHANNEL_CH1N | \
                             LL_TIM_CHANNEL_CH2 | LL_TIM_CHANNEL_CH2N | \
                             LL_TIM_CHANNEL_CH3 | LL_TIM_CHANNEL_CH3N | \
                             LL_TIM_CHANNEL_CH4 | LL_TIM_CHANNEL_CH4N | \
                             LL_TIM_CHANNEL_CH5 | LL_TIM_CHANNEL_CH6  | \
                             LL_TIM_CHANNEL_CH7)

/**
  * @brief Define channel state idle, whether it is an OC or an IC channel.
  */
#define TIM_CHANNEL_STATE_IDLE (HAL_TIM_OC_CHANNEL_STATE_IDLE | \
                                HAL_TIM_IC_CHANNEL_STATE_IDLE)

/**
  * @brief Timeout for break input rearm.
  */
#define TIM_BREAK_INPUT_REARM_TIMEOUT_MS  (5U)

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Indexes for tim_dma_config_t table in TIM_Start_DMA_Opt().
  */
/** Update index */
#define UPDATE_DMA_REQ_IDX       (0U)
/** Commutation index */
#define COMMUTATION_DMA_REQ_IDX  (1U)
/** Trigger index */
#define TRIGGER_DMA_REQ_IDX      (2U)

/**
  * @brief Shift to switch from dma burst source to dma index.
  */
#define TIM_DMABURST_DMAINDEX_SHIFT  (TIM_DCR_DBSS_Pos)

/**
  * @brief mask for all dma requests.
  */
#define TIM_DMAREQ_REQUESTS_MASK     (LL_TIM_DIER_UDE | LL_TIM_DIER_CC1DE | LL_TIM_DIER_CC2DE \
                                      | LL_TIM_DIER_CC3DE | LL_TIM_DIER_CC4DE | LL_TIM_DIER_COMDE \
                                      | LL_TIM_DIER_TDE)
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Shift to switch from HAL filter to LL specific filter and vice versa.
  */
/** HAL filter to LL IC filter and vice versa */
#define TIM_IC_FILTER_SHIFT  (24U - LL_TIM_IC_CONFIG_POS)  /* Bit position (HAL_TIM_FDIV1_N2 - LL_TIM_IC_CONFIG_POS) */
/** HAL filter to LL ETR filter and vice versa */
#define TIM_ETR_FILTER_SHIFT  (20U)  /* Bit position (HAL_TIM_FDIV1_N2 - LL_TIM_ETR_FILTER_FDIV1_N2) */
/** HAL break filter to LL break filter */
#define TIM_BREAK_FILTER_SHIFT  (12U)  /* Bit position (HAL_TIM_FDIV1_N2 - LL_TIM_BREAK_FILTER_FDIV1_N2) */
/** HAL break2 filter to LL break2 filter and vice versa */
#define TIM_BREAK2_FILTER_SHIFT  (8U)   /* Bit position (HAL_TIM_FDIV1_N2 - LL_TIM_BREAK2_FILTER_FDIV1_N2) */

/**
  * @brief Shift to switch from HAL break polarity to LL break2 polarity and vice versa.
  */
#define TIM_BREAK2_POLARITY_SHIFT  (12U)  /* Bit position (LL_TIM_BREAK2_POLARITY_HIGH - LL_TIM_BREAK_POLARITY_HIGH) */

/**
  * @brief Mask for the breaks af mode.
  */
#define TIM_BRK_BRK2_MODE_MASK  (0x30000000U)  /* Bit position (TIMx_BDTR.BKBID & TIMx_BDTR.BK2BID) */

/**
  * @brief Mask for the dithered bits in ARR and CCR registers.
  */
#define TIM_DITHERING_MASK  (0xFU)  /* Bit position (TIMx_ARR[3:0] & TIMx_CCRy[3:0]) */

/**
  * @brief All optional interrupts mask.
  */
#define TIM_OPTIONAL_INTERRUPTS_MASK \
  (HAL_TIM_OPT_IT_UPDATE | HAL_TIM_OPT_IT_COMMUTATION | HAL_TIM_OPT_IT_TRIGGER_INPUT \
   | HAL_TIM_OPT_IT_BREAK | HAL_TIM_OPT_IT_ENCODER_INDEX | HAL_TIM_OPT_IT_ENCODER_DIRECTION \
   | HAL_TIM_OPT_IT_ENCODER_INDEX_ERROR | HAL_TIM_OPT_IT_ENCODER_TRANSITION_ERROR)

/**
  * @brief Encoder optional interrupts mask.
  */
#define TIM_ENCODER_OPTIONAL_INTERRUPTS_MASK \
  (HAL_TIM_OPT_IT_ENCODER_DIRECTION | HAL_TIM_OPT_IT_ENCODER_TRANSITION_ERROR)

/**
  * @brief Encoder index optional interrupts mask.
  */
#define TIM_ENCODER_IDX_OPTIONAL_INTERRUPTS_MASK \
  (HAL_TIM_OPT_IT_ENCODER_INDEX | HAL_TIM_OPT_IT_ENCODER_INDEX_ERROR)

/**
  * @brief Mask for all combined 3-phase pwm modes.
  */
#define TIM_GROUP_MASK \
  (HAL_TIM_GROUP_AND_OC1REFC | HAL_TIM_GROUP_AND_OC2REFC | HAL_TIM_GROUP_AND_OC3REFC \
   | HAL_TIM_GROUP_AND_OC4REFC | HAL_TIM_GROUP_OR_OC1REFC  | HAL_TIM_GROUP_OR_OC2REFC \
   | HAL_TIM_GROUP_OR_OC3REFC  | HAL_TIM_GROUP_OR_OC4REFC)

/**
  * @brief Mask for the breaks input sources polarizable.
  */
#define TIM_BRK_BRK2_POLARITY_MASK  (0x1FU)  /* Bit position (max TIMx_AF1.BKCMP4E or TIMx_AF2.BK2CMP4E) */

/**
  * @brief Mask for specific TIM1 break input sources.
  */
#if defined(TIM16)
#define TIM1_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM1_GPIO | HAL_TIM_BRK_TIM1_COMP1_OUT \
   | HAL_TIM_BRK_TIM1_TIM8_BKIN | HAL_TIM_BRK_TIM1_TIM15_BKIN \
   | HAL_TIM_BRK_TIM1_TIM16_BKIN | HAL_TIM_BRK_TIM1_TIM17_BKIN)
#elif defined(COMP2)
#define TIM1_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM1_GPIO | HAL_TIM_BRK_TIM1_COMP1_OUT \
   | HAL_TIM_BRK_TIM1_COMP2_OUT | HAL_TIM_BRK_TIM1_TIM8_BKIN \
   | HAL_TIM_BRK_TIM1_TIM15_BKIN)
#endif /* TIM20 && PLAY1 */

/**
  * @brief Mask for specific TIM8 break input sources.
  */
#if defined(TIM16)
#define TIM8_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM8_GPIO | HAL_TIM_BRK_TIM8_COMP1_OUT \
   | HAL_TIM_BRK_TIM8_TIM1_BKIN | HAL_TIM_BRK_TIM8_TIM15_BKIN \
   | HAL_TIM_BRK_TIM8_TIM16_BKIN | HAL_TIM_BRK_TIM8_TIM17_BKIN)
#elif defined(COMP2)
#define TIM8_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM8_GPIO | HAL_TIM_BRK_TIM8_COMP1_OUT \
   | HAL_TIM_BRK_TIM8_COMP2_OUT | HAL_TIM_BRK_TIM8_TIM1_BKIN \
   | HAL_TIM_BRK_TIM8_TIM15_BKIN)
#endif /* TIM20 && PLAY1 */

/**
  * @brief Mask for specific TIM15 break input sources.
  */
#if defined(TIM16)
#define TIM15_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM15_GPIO | HAL_TIM_BRK_TIM15_COMP1_OUT \
   | HAL_TIM_BRK_TIM15_TIM1_BKIN | HAL_TIM_BRK_TIM15_TIM8_BKIN \
   | HAL_TIM_BRK_TIM15_TIM16_BKIN | HAL_TIM_BRK_TIM15_TIM17_BKIN)
#elif defined(COMP2)
#define TIM15_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM15_GPIO | HAL_TIM_BRK_TIM15_COMP1_OUT \
   | HAL_TIM_BRK_TIM15_COMP2_OUT | HAL_TIM_BRK_TIM15_TIM1_BKIN \
   | HAL_TIM_BRK_TIM15_TIM8_BKIN)
#endif /* TIM20 && PLAY1 */

#if defined(TIM16)
/**
  * @brief Mask for specific TIM16 break input sources.
  */
#define TIM16_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM16_GPIO | HAL_TIM_BRK_TIM16_COMP1_OUT \
   | HAL_TIM_BRK_TIM16_TIM1_BKIN | HAL_TIM_BRK_TIM16_TIM8_BKIN \
   | HAL_TIM_BRK_TIM16_TIM15_BKIN | HAL_TIM_BRK_TIM16_TIM17_BKIN)
#endif /* TIM16 */

#if defined(TIM17)
/**
  * @brief Mask for specific TIM17 break input sources.
  */
#define TIM17_BRK_SOURCE_MASK \
  (HAL_TIM_BRK_TIM17_GPIO | HAL_TIM_BRK_TIM17_COMP1_OUT \
   | HAL_TIM_BRK_TIM17_TIM1_BKIN | HAL_TIM_BRK_TIM17_TIM8_BKIN \
   | HAL_TIM_BRK_TIM17_TIM15_BKIN | HAL_TIM_BRK_TIM17_TIM16_BKIN)
#endif /* TIM17 */


/**
  * @brief Mask for specific TIM1 break2 input sources.
  */
#if defined(COMP2)
#define TIM1_BRK2_SOURCE_MASK \
  (HAL_TIM_BRK2_TIM1_GPIO | HAL_TIM_BRK2_TIM1_COMP1_OUT \
   | HAL_TIM_BRK2_TIM1_COMP2_OUT | HAL_TIM_BRK2_TIM1_TIM8_BKIN2)
#else
#define TIM1_BRK2_SOURCE_MASK \
  (HAL_TIM_BRK2_TIM1_GPIO | HAL_TIM_BRK2_TIM1_COMP1_OUT \
   | HAL_TIM_BRK2_TIM1_TIM8_BKIN2)
#endif /* TIM20 && PLAY1 */

/**
  * @brief Mask for specific TIM8 break2 input sources.
  */
#if defined(COMP2)
#define TIM8_BRK2_SOURCE_MASK \
  (HAL_TIM_BRK2_TIM8_GPIO | HAL_TIM_BRK2_TIM8_COMP1_OUT \
   | HAL_TIM_BRK2_TIM8_COMP2_OUT | HAL_TIM_BRK2_TIM8_TIM1_BKIN2)
#else
#define TIM8_BRK2_SOURCE_MASK \
  (HAL_TIM_BRK2_TIM8_GPIO | HAL_TIM_BRK2_TIM8_COMP1_OUT \
   | HAL_TIM_BRK2_TIM8_TIM1_BKIN2)
#endif /* TIM20 && PLAY1 */


/**
  *  @}
  */

