MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/* Private macros ------------------------------------------------------------*/
/** @defgroup  TIM_Private_Macros TIM Private Macros
  *  @{
  */

/**
  * @brief  Macro for the control of TIM optional interrupts validity (subset of @ref TIM_Optional_Interruptions).
  * @param  instance    TIM instance.
  * @param  interrupts  TIM optional interrupts.
  * @retval SET (optional interrupts are valid) or RESET (optional interrupts are invalid)
  */
#define IS_TIM_OPTIONAL_INTERRUPTS(instance, interrupts) \
  (((interrupts) != 0U) \
   && !((interrupts) & ~TIM_OPTIONAL_INTERRUPTS_MASK) \
   && !(((interrupts) & HAL_TIM_OPT_IT_COMMUTATION) && !IS_TIM_COMMUTATION_EVENT_INSTANCE((instance))) \
   && !(((interrupts) & HAL_TIM_OPT_IT_TRIGGER_INPUT) && !IS_TIM_SLAVE_INSTANCE((instance))) \
   && !(((interrupts) & HAL_TIM_OPT_IT_BREAK) && !IS_TIM_BREAK_INSTANCE((instance))) \
   && !(((interrupts) & TIM_ENCODER_OPTIONAL_INTERRUPTS_MASK) && !IS_TIM_ENCODER_INTERFACE_INSTANCE((instance))) \
   && !(((interrupts) & TIM_ENCODER_IDX_OPTIONAL_INTERRUPTS_MASK) && !IS_TIM_ENCODER_INTERFACE_INSTANCE((instance))) \
   && !(((interrupts) & TIM_ENCODER_IDX_OPTIONAL_INTERRUPTS_MASK) && !IS_TIM_ETR_INSTANCE((instance))))

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Macro that returns the global state depending on the DMA silent mode.
  * @param  interrupts  DMA interrupts.
  * @retval HAL_TIM_STATE_ACTIVE_SILENT (DMA silent mode is active) or
  *         HAL_TIM_STATE_ACTIVE (DMA silent mode is not active).
  */
#define TIM_STATE_ACTIVE(interrupts) \
  ((STM32_IS_BIT_SET((interrupts), (uint32_t)HAL_DMA_OPT_IT_SILENT)) ? \
   HAL_TIM_STATE_ACTIVE_SILENT : HAL_TIM_STATE_ACTIVE)

/**
  * @brief  Macro that returns the output channel state depending on the DMA silent mode.
  * @param  interrupts  DMA interrupts.
  * @retval HAL_TIM_OC_CHANNEL_STATE_ACTIVE_SILENT (DMA silent mode is active) or
  *         HAL_TIM_OC_CHANNEL_STATE_ACTIVE (DMA silent mode is not active).
  */
#define TIM_OC_CHANNEL_STATE_ACTIVE(interrupts) \
  ((STM32_IS_BIT_SET((interrupts), (uint32_t)HAL_DMA_OPT_IT_SILENT)) ? \
   HAL_TIM_OC_CHANNEL_STATE_ACTIVE_SILENT : HAL_TIM_OC_CHANNEL_STATE_ACTIVE)

/**
  * @brief  Macro that returns the input channel state depending on the DMA silent mode.
  * @param  interrupts  DMA interrupts.
  * @retval HAL_TIM_IC_CHANNEL_STATE_ACTIVE_SILENT (DMA silent mode is active) or
  *         HAL_TIM_IC_CHANNEL_STATE_ACTIVE (DMA silent mode is not active).
  */
#define TIM_IC_CHANNEL_STATE_ACTIVE(interrupts) \
  ((STM32_IS_BIT_SET((interrupts), (uint32_t)HAL_DMA_OPT_IT_SILENT)) ? \
   HAL_TIM_IC_CHANNEL_STATE_ACTIVE_SILENT : HAL_TIM_IC_CHANNEL_STATE_ACTIVE)

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief  Macro for the control of DMA silent mode validity.
  * @param  handle     TIM handle.
  * @param  channel    DMA channel.
  * @param  interrupts DMA interrupts.
  * @retval SET (DMA silent mode is valid) or RESET (DMA silent mode is invalid).
  */
#define IS_TIM_DMA_VALID_SILENT_MODE(handle, channel, interrupts) \
  (((interrupts) == HAL_TIM_OPT_DMA_IT_SILENT)  \
   && (handle->hdma[channel]->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)
#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief  Tell whether the DMA silent mode is active.
  * @param  state  The state to check.
  * @retval SET (DMA silent mode is active) or RESET (otherwise).
  */
#define IS_TIM_ACTIVE_SILENT(state) \
  ((uint32_t)(state) & (uint32_t)HAL_TIM_ACTIVE_SILENT)

#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Check if the break input rearm timeout period is expired.
  * @param  delta_ticks  Delta ticks to compare with the timeout period
  * @retval SET (timeout period is expired) or RESET (otherwise).
  */
#define TIM_BREAK_INPUT_REARM_TIMEOUT_PERIOD_EXPIRED(delta_ticks) \
  ((delta_ticks) > (uint32_t)TIM_BREAK_INPUT_REARM_TIMEOUT_MS)

/**
  * @brief  Get the mask for changing the channel source of a given channel
  *         in the register TISEL.
  * @param  channel  The channel to get the mask for.
  * @note   Input channel 1 -> input channel index 0 -> mask 0xF. \n
  *         Input channel 2 -> input channel index 1 -> mask 0xF00. \n
  *         Input channel 3 -> input channel index 2 -> mask 0xF0000. \n
  *         Input channel 4 -> input channel index 3 -> mask 0xF000000.
  * @retval The mask for changing the channel source of the given channel.
  */
#define MASK_TISEL(channel) ((0xFUL) << ((channel) << 3))

/**
  * @brief  Get the shift to switch from LL to HAL Break/Break2 polarity and vice versa, depending the Break input.
  * @param  brkin  The Break input.
  * @retval The shift to switch from LL to HAL and vice versa.
  */
#define TIM_BRK_BRK2_POLARITY_SHIFT(brkin) \
  (((brkin) << 2) + ((brkin) << 3))

/**
  * @brief  Get the shift to switch from LL to HAL Break/Break2 filter and vice versa, depending the Break input.
  * @param  brkin  The Break input.
  * @retval The shift to switch from LL to HAL and vice versa.
  */
#define TIM_BRK_BRK2_FILTER_SHIFT(brkin) \
  ((brkin) << 2)

/**
  * @brief  Get the timer handle registered in the dma handle.
  * @param  hdma  DMA handle.
  * @retval TIM handle.
  */
#define TIM_GET_HDMA_PARENT(hdma) \
  ((hal_tim_handle_t *)((hdma)->p_parent))

/**
  * @brief Check if the channel is configured as input channel.
  * @param  instance  TIM instance.
  * @param  channel   Channel of interest.
  *                   It can be any of the following values: \n
  *                   @arg @ref HAL_TIM_CHANNEL_1
  *                   @arg @ref HAL_TIM_CHANNEL_2
  *                   @arg @ref HAL_TIM_CHANNEL_3
  *                   @arg @ref HAL_TIM_CHANNEL_4
  * @retval SET (input channel) or RESET (output channel).
  */
#define TIM_IS_INPUT_CHANNEL(instance, channel) \
  (LL_TIM_IC_GetActiveInput((instance), ll_tim_channels[(channel)]) != 0U)

/**
  * @brief Check if all channels are disabled.
  * @param  instance  TIM instance.
  * @retval SET (all channels are disabled) or RESET (otherwise).
  */
#define TIM_ARE_ALL_CHANNELS_DISABLED(instance) \
  ((LL_TIM_READ_REG((instance), CCER) & TIM_ALL_LL_CHANNELS) == 0x0U)

/**
  * @brief  Transform the HAL filter into a LL IC filter.
  * @param  filter  The HAL filter.
  * @retval The LL IC filter.
  */
#define TIM_IC_HAL2LL_FILTER(filter) \
  (((uint32_t)(filter)) >> TIM_IC_FILTER_SHIFT)

/**
  * @brief  Transform the LL IC filter into a HAL filter.
  * @param  filter  The LL IC filter.
  * @retval The HAL filter.
  */
#define TIM_IC_LL2HAL_FILTER(filter) \
  ((hal_tim_filter_t)((uint32_t)((filter) << TIM_IC_FILTER_SHIFT)))

/**
  * @brief  Transform the HAL filter into a LL ETR filter.
  * @param  filter  The HAL filter.
  * @retval The LL ETR filter.
  */
#define TIM_ETR_HAL2LL_FILTER(filter) \
  (((uint32_t)(filter)) >> TIM_ETR_FILTER_SHIFT)

/**
  * @brief  Transform the LL ETR filter into a HAL filter.
  * @param  filter  The LL ETR filter.
  * @retval The HAL filter.
  */
#define TIM_ETR_LL2HAL_FILTER(filter) \
  ((hal_tim_filter_t)((uint32_t)((filter) << TIM_ETR_FILTER_SHIFT)))

/**
  * @brief  Transform the HAL filter into a LL Break filter.
  * @param  filter  The HAL filter.
  * @retval The LL Break filter.
  */
#define TIM_BREAK_HAL2LL_FILTER(filter) \
  (((uint32_t)(filter)) >> TIM_BREAK_FILTER_SHIFT)

/**
  * @brief  Transform the LL Break filter into a HAL filter.
  * @param  filter  The LL Break filter.
  * @retval The HAL filter.
  */
#define TIM_BREAK_LL2HAL_FILTER(filter) \
  ((hal_tim_filter_t)((uint32_t)((filter) << TIM_BREAK_FILTER_SHIFT)))

/**
  * @brief  Transform the HAL filter into a LL Break2 filter.
  * @param  filter  The HAL filter.
  * @retval The LL Break2 filter.
  */
#define TIM_BREAK2_HAL2LL_FILTER(filter) \
  (((uint32_t)(filter)) >> TIM_BREAK2_FILTER_SHIFT)

/**
  * @brief  Transform the LL Break2 filter into a HAL filter.
  * @param  filter  The LL Break2 filter.
  * @retval The HAL filter.
  */
#define TIM_BREAK2_LL2HAL_FILTER(filter) \
  ((hal_tim_filter_t)((uint32_t)((filter) << TIM_BREAK2_FILTER_SHIFT)))

/**
  * @brief  Transform the HAL filter into LL Break/Break2 filter depending on the Break Input.
  * @param  brkin   The Break input.
  * @param  filter  The HAL filter.
  * @retval The LL Break/Break2 filter.
  */
#define TIM_BRK_BRK2_HAL2LL_FILTER(brkin, filter) \
  ((((uint32_t)(filter)) >> TIM_BREAK_FILTER_SHIFT) \
   << TIM_BRK_BRK2_FILTER_SHIFT((brkin)))

/**
  * @brief  Transform the LL Break/Break2 filter into a HAL filter depending on the Break Input.
  * @param  brkin   The Break input.
  * @param  filter  The LL Break/Break2 filter.
  * @retval The HAL filter.
  */
#define TIM_BRK_BRK2_LL2HAL_FILTER(brkin, filter) \
  ((hal_tim_filter_t)((uint32_t)((filter) >> TIM_BRK_BRK2_FILTER_SHIFT((brkin)) \
                                 << TIM_BREAK_FILTER_SHIFT)))

/**
  * @brief  Transform the HAL Break Polarity into LL Break polarity for the Break input.
  * @param  polarity  The HAL Break polarity.
  * @retval The LL Break polarity.
  */
#define TIM_BREAK_HAL2LL_POLARITY(polarity) \
  ((uint32_t)(polarity))

/**
  * @brief Transform the HAL Break Polarity into LL Break polarity for the Break input 2.
  * @param  polarity  The HAL Break polarity.
  * @retval The LL Break polarity.
  */
#define TIM_BREAK2_HAL2LL_POLARITY(polarity) \
  (((uint32_t)(polarity)) << TIM_BREAK2_POLARITY_SHIFT)

/**
  * @brief  Transform the LL Break Polarity into HAL Break polarity for a Break input.
  * @param  polarity  The LL Break polarity.
  * @retval The HAL Break polarity.
  */
#define TIM_BREAK_LL2HAL_POLARITY(polarity) \
  ((hal_tim_break_input_polarity_t)(polarity))

/**
  * @brief  Transform the LL Break2 Polarity into HAL Break polarity for a Break input 2.
  * @param  polarity  The LL Break2 polarity.
  * @retval The HAL Break polarity.
  */
#define TIM_BREAK2_LL2HAL_POLARITY(polarity) \
  ((hal_tim_break_input_polarity_t)((uint32_t)((polarity)  >> TIM_BREAK2_POLARITY_SHIFT)))

/**
  * @brief  Transform the HAL Break/Break2 Polarity into LL Break/Break2 polarity depending on the Break input.
  * @param  brkin     The Break input.
  * @param  polarity  The HAL Break(2) polarity.
  * @retval The LL Break(2) polarity.
  */
#define TIM_BRK_BRK2_HAL2LL_POLARITY(brkin, polarity) \
  (((uint32_t)(polarity))  << TIM_BRK_BRK2_POLARITY_SHIFT(brkin))

/**
  * @brief Transform the LL Break/Break2 Polarity into HAL Break polarity depending on the Break input.
  * @param brkin     The Break input.
  * @param polarity  The LL Break(2) polarity.
  * @retval The HAL Break polarity.
  */
#define TIM_BRK_BRK2_LL2HAL_POLARITY(brkin, polarity) \
  ((hal_tim_break_input_polarity_t)((uint32_t)((polarity) >> TIM_BRK_BRK2_POLARITY_SHIFT(brkin))))

/**
  * @brief  Transform the HAL Break mode into a LL Break mode for the Break input.
  * @param  mode  The HAL Break mode.
  * @retval The LL Break mode.
  */
#define TIM_BREAK_HAL2LL_MODE(mode) \
  (((uint32_t)(mode)) & LL_TIM_BREAK_AFMODE_BIDIRECTIONAL)

/**
  * @brief  Transform the HAL Break mode into a LL Break2 mode for the Break input 2.
  * @param  mode  The HAL Break mode.
  * @retval The LL Break2 mode.
  */
#define TIM_BREAK2_HAL2LL_MODE(mode) \
  (((uint32_t)(mode)) & (LL_TIM_BREAK_AFMODE_BIDIRECTIONAL << 1))

/**
  * @brief  Transform the HAL Break mode into a LL Break/Break2 mode depending on the Break input.
  * @param  brkin  The Break input.
  * @param  mode   The HAL Break mode.
  * @retval The LL Break/Break2 mode.
  */
#define TIM_BRK_BRK2_HAL2LL_MODE(brkin, mode) \
  (((uint32_t)(mode)) & (LL_TIM_BREAK_AFMODE_BIDIRECTIONAL << (brkin)))

/**
  * @brief  Transform the LL Break/Break2 mode into a HAL Break mode for the Break input.
  * @param  brkin  The Break input.
  * @param  mode   The LL Break mode.
  * @retval The HAL Break mode.
  */
#define TIM_BRK_BRK2_LL2HAL_MODE(brkin, mode) \
  ((hal_tim_break_input_mode_t)((uint32_t)(((mode) | ((mode) >> 1) | ((mode) << 1)) & \
                                           TIM_BRK_BRK2_MODE_MASK)))

/**
  * @brief  Get the LL active input from HAL capture unit source.
  * @param  capture_unit_src  The HAL capture unit source (@ref hal_tim_ic_capture_unit_src_t).
  * @note   The upper bytes store the LL active input, and the lower bytes store the LL source polarity.
  * @retval The LL active input.
  */
#define TIM_LL_ACTIVE_INPUT(capture_unit_src) ((capture_unit_src) & 0xFFFF0000U)

/**
  * @brief  Get the LL source polarity from HAL capture unit source.
  * @param  capture_unit_src  The HAL capture unit source (@ref hal_tim_ic_capture_unit_src_t).
  * @note   The upper bytes store the LL active input, and the lower bytes store the LL source polarity.
  * @retval The LL source polarity.
  */
#define TIM_LL_IC_POLARITY(capture_unit_src) ((capture_unit_src) & 0x0000FFFFU)

/**
  * @brief  Check if the timer is in a slave mode.
  * @param  instance  TIM instance.
  * @retval SET (slave mode enabled) or RESET (slave mode disabled).
  */
#define IS_TIM_SLAVE_MODE_ENABLED(instance) \
  (LL_TIM_GetSlaveMode(instance) != (uint32_t)HAL_TIM_SLAVE_DISABLED)

/**
  * @brief  Check if the timer is in a slave mode that enables the counter.
  * @param  sms  The slave mode.
  * @retval SET (slave mode enabling the counter) or RESET (otherwise).
  */
#define IS_TIM_SLAVE_MODE_ENABLING_COUNTER(sms) \
  (((sms) == (uint32_t)HAL_TIM_SLAVE_TRIGGER) \
   || ((sms) == (uint32_t)HAL_TIM_SLAVE_COMBINED_RESET_TRIGGER))

/**
  * @brief  Check if the timer instance supports the slave mode selection preload.
  * @param  instance  TIM instance.
  * @retval SET (slave mode preload supported) or RESET (otherwise).
  */
#define IS_TIM_SMS_PRELOAD_INSTANCE(instance) \
  IS_TIM_ENCODER_INTERFACE_INSTANCE((instance))

/**
  * @brief  Check if the timer instance supports the ADC synchronization.
  * @param  instance  TIM instance.
  * @retval SET (ADC synchronization supported) or RESET (otherwise).
  */
#define IS_TIM_ADC_SYNCHRO_INSTANCE(instance) \
  IS_TIM_MASTER_INSTANCE((instance))

/**
  * @brief  Check if the timer instance supports the 'pulse on compare' feature.
  * @param  instance  TIM instance.
  * @retval SET (pulse on compare supported) or RESET (otherwise).
  */
#define IS_TIM_PULSE_ON_COMPARE_INSTANCE(instance)  \
  IS_TIM_CC3_INSTANCE((instance))

/**
  * @brief  Check if the timer instance supports the 'group' feature (combined 3-phase PWM mode).
  * @param  instance  TIM instance.
  * @retval SET (group feature supported) or RESET (otherwise).
  */
#define IS_TIM_GROUP_INSTANCE(instance)  \
  IS_TIM_CC5_INSTANCE((instance))

/**
  * @brief  Check if the 'group' combination for OC5REF signal is valid.
  * @param  group  The group combination.
  * @retval SET (group combination valid) or RESET (otherwise).
  */
#define IS_TIM_GROUP(group) (((group & ~(TIM_GROUP_MASK)) == 0U) ? 1U : 0U)

/**
  * @brief  Check if the timer instance supports the 'break' feature.
  * @param  instance  TIM instance.
  * @param  brkin     The Break input.
  * @retval SET (break feature supported) or RESET (otherwise).
  */
#define IS_TIM_BRKIN_INSTANCE(instance, brkin) \
  (((brkin) == HAL_TIM_BREAK_INPUT_1)? IS_TIM_BREAK_INSTANCE((instance)) : \
   IS_TIM_BKIN2_INSTANCE((instance)))

/**
  * @brief  Get the TIM instance from the handle.
  * @param  htim  TIM handle.
  * @retval TIM instance.
  */
#define TIM_INSTANCE(htim) ((tim_t *)((uint32_t)((htim)->instance)))

/**
  * @brief  Check the value to store in the counter register (CNT).
  * @param  instance  TIM instance.
  * @param  counter   Counter value.
  * @retval SET (counter value valid) or RESET (counter value invalid).
  */
#define IS_TIM_COUNTER(instance, counter) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   ((counter) <= 0x0000FFFFU) : (1U))

/**
  * @brief  Check the value to store in the auto-reload register (ARR).
  * @param  instance  TIM instance.
  * @param  period    Period value.
  * @note   For a 32-bit counter, the constraint is only to have a positive value (with
  *         the meaning of the value depending on dithering mode). \n
  *         For a 16-bit counter, only bits 0 to 15 are meaningful (0 to 19 in dithering mode).
  * @retval SET (period value valid) or RESET (period value invalid).
  */
#define IS_TIM_PERIOD(instance, period) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   (((period) > 0U) && ((period) <= 0x000FFFEFU)) : ((period) > 0U))

/**
  * @brief  Check the integer part of the period value when dithering enabled.
  * @param  instance  TIM instance.
  * @param  period    Period value.
  * @retval SET (integer period value valid) or RESET (integer period value invalid).
  */
#define IS_TIM_PERIOD_WITH_DITHERING(instance, period) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   (((period) > 0U) && ((period) <= 0x0000FFFEU)) : \
   (((period) > 0U) && ((period) <= 0x0FFFFFFEU)))

/**
  * @brief  Check the period value when dithering is disabled.
  * @param  instance  TIM instance.
  * @param  period    Period value.
  * @retval SET (period value valid) or RESET (period value invalid).
  */
#define IS_TIM_PERIOD_WITHOUT_DITHERING(instance, period) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   (((period) > 0U) && ((period) <= 0x0000FFFFU)) : ((period) > 0U))

/**
  * @brief  Check the value to store in the repetition counter register (RCR).
  * @param  instance            TIM instance.
  * @param  repetition_counter  Repetition counter value.
  * @retval SET (repetition counter value valid) or RESET (repetition counter value invalid).
  */
#define IS_TIM_REPETITION_COUNTER(instance, repetition_counter) \
  ((IS_TIM_16B_REPETITION_COUNTER_INSTANCE((instance)) == 0U) ? \
   ((repetition_counter) <= 0x000000FFU) :                      \
   ((repetition_counter) <= 0x0000FFFFU))

/**
  * @brief  Check the value to store in the prescaler register (PSC).
  * @param  prescaler  Prescaler value.
  * @retval SET (prescaler value valid) or RESET (prescaler value invalid).
  */
#define IS_TIM_PRESCALER(prescaler) ((prescaler) <= 0x0000FFFFU)

/**
  * @brief  Check the validity of the channel.
  * @param  channel  The channel to check (@ref hal_tim_channel_t).
  * @retval SET (channel is valid) or RESET (channel is invalid).
  */
#define IS_TIM_CHANNEL(channel) (((channel) == HAL_TIM_CHANNEL_1)  \
                                 ||((channel) == HAL_TIM_CHANNEL_2)  \
                                 ||((channel) == HAL_TIM_CHANNEL_3)  \
                                 ||((channel) == HAL_TIM_CHANNEL_4)  \
                                 ||((channel) == HAL_TIM_CHANNEL_5)  \
                                 ||((channel) == HAL_TIM_CHANNEL_6)  \
                                 ||((channel) == HAL_TIM_CHANNEL_7)  \
                                 ||((channel) == HAL_TIM_CHANNEL_1N) \
                                 ||((channel) == HAL_TIM_CHANNEL_2N) \
                                 ||((channel) == HAL_TIM_CHANNEL_3N) \
                                 ||((channel) == HAL_TIM_CHANNEL_4N))

/**
  * @brief  Check the validity of the counter mode.
  * @param  mode  The counter mode to check (@ref hal_tim_counter_mode_t).
  * @retval SET (counter mode is valid) or RESET (counter mode is invalid).
  */
#define IS_TIM_COUNTER_MODE(mode) (((mode) == HAL_TIM_COUNTER_UP)            \
                                   ||((mode) == HAL_TIM_COUNTER_DOWN)        \
                                   ||((mode) == HAL_TIM_COUNTER_CENTER_DOWN) \
                                   ||((mode) == HAL_TIM_COUNTER_CENTER_UP)   \
                                   ||((mode) == HAL_TIM_COUNTER_CENTER_UP_DOWN))

/**
  * @brief  Check the validity of the DTS clock prescaler.
  * @param  psc  The prescaler to check (@ref hal_tim_dts_prescaler_t).
  * @retval SET (DTS prescaler is valid) or RESET (DTS prescaler is invalid).
  */
#define IS_TIM_DTS_PRESCALER(psc) (((psc) == HAL_TIM_DTS_DIV1) \
                                   ||((psc) == HAL_TIM_DTS_DIV2) \
                                   ||((psc) == HAL_TIM_DTS_DIV4) \
                                   ||((psc) == HAL_TIM_DTS_DIV8))

/**
  * @brief  Check the validity of the DTS2 clock prescaler.
  * @param  psc  The prescaler to check (@ref hal_tim_dts2_prescaler_t).
  * @retval SET (DTS2 prescaler is valid) or RESET (DTS2 prescaler is invalid).
  */
#define IS_TIM_DTS2_PRESCALER(psc) (((psc) == HAL_TIM_DTS2_DIV1)     \
                                    ||((psc) == HAL_TIM_DTS2_DIV4)     \
                                    ||((psc) == HAL_TIM_DTS2_DIV16)    \
                                    ||((psc) == HAL_TIM_DTS2_DIV64)    \
                                    ||((psc) == HAL_TIM_DTS2_DIV256)   \
                                    ||((psc) == HAL_TIM_DTS2_DIV1024)  \
                                    ||((psc) == HAL_TIM_DTS2_DIV4096)  \
                                    ||((psc) == HAL_TIM_DTS2_DIV16384) \
                                    ||((psc) == HAL_TIM_DTS2_DIV65536) \
                                    ||((psc) == HAL_TIM_DTS2_DIV262144))

/**
  * @brief  Check if the clock source is an encoder mode.
  * @param  src  The clock source (@ref hal_tim_clk_src_t).
  * @retval SET (encoder mode clock source) or RESET (otherwise).
  */
#define TIM_IS_CLK_ENCODER(src) (((src) == HAL_TIM_CLK_ENCODER_X1_TI1)            \
                                 ||((src) == HAL_TIM_CLK_ENCODER_X1_TI2)            \
                                 ||((src) == HAL_TIM_CLK_ENCODER_X2_TI1)            \
                                 ||((src) == HAL_TIM_CLK_ENCODER_X2_TI2)            \
                                 ||((src) == HAL_TIM_CLK_ENCODER_X4_TI12)           \
                                 ||((src) == HAL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1)  \
                                 ||((src) == HAL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12) \
                                 ||((src) == HAL_TIM_CLK_ENCODER_CLK_PLUS_X2)       \
                                 ||((src) == HAL_TIM_CLK_ENCODER_CLK_PLUS_X1)       \
                                 ||((src) == HAL_TIM_CLK_ENCODER_DIR_CLK_X2)        \
                                 ||((src) == HAL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12))

/**
  * @brief  Check the validity of the clock source.
  * @param  src  The clock source to check (@ref hal_tim_clk_src_t).
  * @retval SET (clock source is valid) or RESET (clock source is invalid).
  */
#define IS_TIM_CLK_SRC(src) (((src) == HAL_TIM_CLK_INTERNAL)      \
                             ||((src) == HAL_TIM_CLK_EXTERNAL_MODE1)\
                             ||((src) == HAL_TIM_CLK_EXTERNAL_MODE2)\
                             ||TIM_IS_CLK_ENCODER(src))

/**
  * @brief  Check the validity of the update source.
  * @param  src  The update source to check (@ref hal_tim_update_src_t).
  * @retval SET (update source is valid) or RESET (update source is invalid).
  */
#define IS_TIM_UPDATE_SRC(src) (((src) == HAL_TIM_UPDATE_REGULAR) \
                                ||((src) == HAL_TIM_UPDATE_COUNTER))

