MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/**
  * @brief  Check the validity of the filter.
  * @param  fdiv  The filter division to check (@ref hal_tim_filter_t).
  * @retval SET (filter division is valid) or RESET (filter division is invalid).
  */
#define IS_TIM_FILTER(fdiv) (((fdiv) == HAL_TIM_FDIV1)     \
                             ||((fdiv) == HAL_TIM_FDIV1_N2)  \
                             ||((fdiv) == HAL_TIM_FDIV1_N4)  \
                             ||((fdiv) == HAL_TIM_FDIV1_N8)  \
                             ||((fdiv) == HAL_TIM_FDIV2_N6)  \
                             ||((fdiv) == HAL_TIM_FDIV2_N8)  \
                             ||((fdiv) == HAL_TIM_FDIV4_N6)  \
                             ||((fdiv) == HAL_TIM_FDIV4_N8)  \
                             ||((fdiv) == HAL_TIM_FDIV8_N6)  \
                             ||((fdiv) == HAL_TIM_FDIV8_N8)  \
                             ||((fdiv) == HAL_TIM_FDIV16_N5) \
                             ||((fdiv) == HAL_TIM_FDIV16_N6) \
                             ||((fdiv) == HAL_TIM_FDIV16_N8) \
                             ||((fdiv) == HAL_TIM_FDIV32_N5) \
                             ||((fdiv) == HAL_TIM_FDIV32_N6) \
                             ||((fdiv) == HAL_TIM_FDIV32_N8))

/**
  * @brief  Check the validity of the trigger selection.
  * @param  instance  TIM instance.
  * @param  trigger   The trigger selection to check (@ref hal_tim_trig_sel_t).
  * @retval SET (trigger selection is valid) or RESET (trigger selection is invalid).
  */
#if defined(TIM4)
#define IS_TIM_TRIG_SEL(instance, trigger) \
  (((((trigger) == HAL_TIM_TRIG_ITR0) \
     || ((trigger) == HAL_TIM_TRIG_ITR1)) \
    && (((instance) == TIM2) || ((instance) == TIM3) \
        || ((instance) == TIM4) || ((instance) == TIM5) \
        || ((instance) == TIM8) || ((instance) == TIM12) \
        || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR2) \
       && (((instance) == TIM1) || ((instance) == TIM3) \
           || ((instance) == TIM4) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR3) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM4) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR4) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR5) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM4) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR6) \
        || ((trigger) == HAL_TIM_TRIG_ITR7)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM4) \
           || ((instance) == TIM5) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR8) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM4) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR9) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM4) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR10) \
        || ((trigger) == HAL_TIM_TRIG_ITR11)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM4) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_TI1F_ED) \
        || ((trigger) == HAL_TIM_TRIG_TI1FP1) \
        || ((trigger) == HAL_TIM_TRIG_TI2FP2)) \
       && (IS_TIM_SLAVE_INSTANCE((instance)))) \
   || (((trigger) == HAL_TIM_TRIG_ETRF) \
       && (IS_TIM_ETR_INSTANCE((instance)))))
#elif defined(TIM3)
#define IS_TIM_TRIG_SEL(instance, trigger) \
  (((((trigger) == HAL_TIM_TRIG_ITR0) \
     || ((trigger) == HAL_TIM_TRIG_ITR1)) \
    && (((instance) == TIM2) || ((instance) == TIM3) \
        || ((instance) == TIM5) || ((instance) == TIM8) \
        || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR2) \
       && (((instance) == TIM1) || ((instance) == TIM3) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR3) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR5) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR6) \
        || ((trigger) == HAL_TIM_TRIG_ITR7)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM5) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR8) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR9) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR10) \
        || ((trigger) == HAL_TIM_TRIG_ITR11)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM3) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_TI1F_ED) \
        || ((trigger) == HAL_TIM_TRIG_TI1FP1) \
        || ((trigger) == HAL_TIM_TRIG_TI2FP2)) \
       && (IS_TIM_SLAVE_INSTANCE((instance)))) \
   || (((trigger) == HAL_TIM_TRIG_ETRF) \
       && (IS_TIM_ETR_INSTANCE((instance)))))
#elif defined(TIM5)
#define IS_TIM_TRIG_SEL(instance, trigger) \
  (((((trigger) == HAL_TIM_TRIG_ITR0) \
     || ((trigger) == HAL_TIM_TRIG_ITR1)) \
    && (((instance) == TIM2) || ((instance) == TIM5) \
        || ((instance) == TIM8) || ((instance) == TIM12) \
        || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR2) \
       && (((instance) == TIM1) || ((instance) == TIM5) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR5) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM8) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR6) \
        || ((trigger) == HAL_TIM_TRIG_ITR7)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM5) || ((instance) == TIM12) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR8) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR9) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR10) \
        || ((trigger) == HAL_TIM_TRIG_ITR11)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM5) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_TI1F_ED) \
        || ((trigger) == HAL_TIM_TRIG_TI1FP1) \
        || ((trigger) == HAL_TIM_TRIG_TI2FP2)) \
       && (IS_TIM_SLAVE_INSTANCE((instance)))) \
   || (((trigger) == HAL_TIM_TRIG_ETRF) \
       && (IS_TIM_ETR_INSTANCE((instance)))))
#else
#define IS_TIM_TRIG_SEL(instance, trigger) \
  (((((trigger) == HAL_TIM_TRIG_ITR0) \
     || ((trigger) == HAL_TIM_TRIG_ITR1)) \
    && (((instance) == TIM2) || ((instance) == TIM8) \
        || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR2) \
       && (((instance) == TIM1) || ((instance) == TIM8) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || ((((trigger) == HAL_TIM_TRIG_ITR6) \
        || ((trigger) == HAL_TIM_TRIG_ITR7)) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM12) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR8) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM8) || ((instance) == TIM15))) \
   || (((trigger) == HAL_TIM_TRIG_ITR9) \
       && (((instance) == TIM1) || ((instance) == TIM2) \
           || ((instance) == TIM8) || ((instance) == TIM12))) \
   || ((((trigger) == HAL_TIM_TRIG_TI1F_ED) \
        || ((trigger) == HAL_TIM_TRIG_TI1FP1) \
        || ((trigger) == HAL_TIM_TRIG_TI2FP2)) \
       && (IS_TIM_SLAVE_INSTANCE((instance)))) \
   || (((trigger) == HAL_TIM_TRIG_ETRF) \
       && (IS_TIM_ETR_INSTANCE((instance)))))
#endif /* TIM20 */

/**
  * @brief  Check if the timer instance supports external clock mode 1.
  * @param  instance  TIM instance.
  * @retval SET (external clock mode 1 supported) or RESET (external clock mode 1 not supported).
  */
#define IS_TIM_EXTERNAL_CLOCK_MODE1_INSTANCE(instance) \
  IS_TIM_SLAVE_INSTANCE((instance))

/**
  * @brief  Check if the timer instance supports external clock mode 2.
  * @param  instance  TIM instance.
  * @retval SET (external clock mode 2 supported) or RESET (external clock mode 2 not supported).
  */
#define IS_TIM_EXTERNAL_CLOCK_MODE2_INSTANCE(instance) \
  IS_TIM_ETR_INSTANCE((instance))

/**
  * @brief  Check the compatibility of a trigger for a slave mode.
  * @param  mode     The slave mode (@ref hal_tim_slave_mode_t).
  * @param  trigger  The trigger selection (@ref hal_tim_trig_sel_t).
  * @note   For gated mode or combined gated + reset mode, the trigger
  *         must not be a pulse.
  * @retval SET (trigger is valid) or RESET (trigger is invalid).
  */
#define IS_TIM_SLAVE_MODE_TRIGGER_VALID(mode, trigger) \
  (((((mode) == HAL_TIM_SLAVE_GATED) || ((mode) == HAL_TIM_SLAVE_COMBINED_GATED_RESET))  \
    && ((trigger) == HAL_TIM_TRIG_TI1F_ED)) ? 0 : 1)

/**
  * @brief  Check the validity of an internal output channel parameter.
  * @param  channel  The channel to check (@ref hal_tim_channel_t).
  * @retval SET (internal channel) or RESET (otherwise).
  */
#define IS_TIM_OC_INTERNAL_CHANNEL(channel) (((channel) == HAL_TIM_CHANNEL_5) \
                                             ||((channel) == HAL_TIM_CHANNEL_6) \
                                             ||((channel) == HAL_TIM_CHANNEL_7))

/**
  * @brief  Check the validity of an output channel parameter.
  * @param  instance  TIM instance.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @retval SET (output channel is valid) or RESET (output channel is invalid).
  */
#define IS_TIM_OC_CHANNEL(instance, channel) \
  ((((channel) == HAL_TIM_CHANNEL_1) && IS_TIM_CC1_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_2) && IS_TIM_CC2_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_3) && IS_TIM_CC3_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_4) && IS_TIM_CC4_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_5) && IS_TIM_CC5_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_6) && IS_TIM_CC6_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_7) && IS_TIM_CC7_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_1N) && IS_TIM_CC1N_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_2N) && IS_TIM_CC2N_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_3N) && IS_TIM_CC3N_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_4N) && IS_TIM_CC4N_INSTANCE((instance))))

/**
  * @brief  Check the validity of an output compare unit parameter.
  * @param  instance      TIM instance.
  * @param  compare_unit  The compare unit to check (@ref hal_tim_oc_compare_unit_t).
  * @retval SET (compare unit is valid) or RESET (compare unit is invalid).
  */
#define IS_TIM_OC_COMPARE_UNIT(instance, compare_unit) \
  ((((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_1) && IS_TIM_CC1_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_2) && IS_TIM_CC2_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_3) && IS_TIM_CC3_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_4) && IS_TIM_CC4_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_5) && IS_TIM_CC5_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_6) && IS_TIM_CC6_INSTANCE((instance))) \
   || (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_7) && IS_TIM_CC7_INSTANCE((instance))))

/**
  * @brief  Check the value to store in the Capture/Compare Register (CCRx).
  * @param  instance  TIM instance.
  * @param  pulse     Pulse value.
  * @note   For a 32-bit counter, the constraint is only to have a positive value. \n
  *         Otherwise, the maximum value is 0xFFFEF when dithering is enabled, and
  *         0xFFFF when dithering is not enabled.
  * @retval SET (pulse value is valid) or RESET (pulse value is invalid).
  */
#define IS_TIM_OC_PULSE(instance, pulse) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   ((pulse) <= 0x000FFFEFU) : 1U)

/**
  * @brief  Check the value to store in the Capture/Compare Register (CCRx) when dithering is enabled.
  * @param  instance  TIM instance.
  * @param  pulse     Pulse value.
  * @retval SET (pulse value is valid) or RESET (pulse value is invalid).
  */
#define IS_TIM_OC_PULSE_WITH_DITHERING(instance, pulse) \
  ((IS_TIM_32B_COUNTER_INSTANCE((instance)) == 0U) ?  \
   ((pulse) <= 0x0000FFFEU) : ((pulse) <= 0x0FFFFFFEU))

/**
  * @brief  Check the validity of the output channel unit mode.
  * @param  compare_unit  The channel unit to check.
  * @param  mode          The output channel mode to check (@ref hal_tim_oc_mode_t).
  * @note   HAL_TIM_OC_PULSE_ON_COMPARE and HAL_TIM_OC_DIRECTION_OUTPUT are
  *         available only for channel units 3 and 4.
  * @retval SET (output channel mode is valid) or RESET (output channel mode is invalid).
  */
#define IS_TIM_OC_MODE(compare_unit, mode) \
  (((mode) == HAL_TIM_OC_FROZEN)                            \
   ||((mode) == HAL_TIM_OC_ACTIVE_ON_MATCH)                 \
   ||((mode) == HAL_TIM_OC_INACTIVE_ON_MATCH)               \
   ||((mode) == HAL_TIM_OC_TOGGLE)                          \
   ||((mode) == HAL_TIM_OC_PWM1)                            \
   ||((mode) == HAL_TIM_OC_PWM2)                            \
   ||((mode) == HAL_TIM_OC_FORCED_ACTIVE)                   \
   ||((mode) == HAL_TIM_OC_FORCED_INACTIVE)                 \
   ||((mode) == HAL_TIM_OC_RETRIGERRABLE_OPM1)              \
   ||((mode) == HAL_TIM_OC_RETRIGERRABLE_OPM2)              \
   ||((mode) == HAL_TIM_OC_COMBINED_PWM1)                   \
   ||((mode) == HAL_TIM_OC_COMBINED_PWM2)                   \
   ||((mode) == HAL_TIM_OC_COMBINED_PWM3)                   \
   ||((mode) == HAL_TIM_OC_COMBINED_PWM4)                   \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM1)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM2)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM3)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM4)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM5)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM6)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM7)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM8)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM9)                 \
   ||((mode) == HAL_TIM_OC_ASYMMETRIC_PWM10)                \
   ||(((mode) == HAL_TIM_OC_PULSE_ON_COMPARE)               \
      && (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_3)     \
          ||((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_4))) \
   ||(((mode) == HAL_TIM_OC_DIRECTION_OUTPUT)               \
      && (((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_3)     \
          ||((compare_unit) == HAL_TIM_OC_COMPARE_UNIT_4))))

/**
  * @brief  Check the validity of the output channel polarity.
  * @param  polarity  The output channel polarity to check (@ref hal_tim_oc_polarity_t).
  * @retval SET (output channel polarity is valid) or RESET (output channel polarity is invalid).
  */
#define IS_TIM_OC_POLARITY(polarity) (((polarity) == HAL_TIM_OC_HIGH) \
                                      ||((polarity) == HAL_TIM_OC_LOW))

/**
  * @brief  Check the validity of the output channel idle state.
  * @param  state  The output channel idle state to check (@ref hal_tim_oc_idle_state_t).
  * @retval SET (output channel idle state is valid) or RESET (output channel idle state is invalid).
  */
#define IS_TIM_OC_IDLE_STATE(state) (((state) == HAL_TIM_OC_IDLE_STATE_RESET) \
                                     ||((state) == HAL_TIM_OC_IDLE_STATE_SET))

/**
  * @brief  Check the validity of the output channel override state.
  * @param  state  The output channel override state to check (@ref hal_tim_oc_override_state_t).
  * @retval SET (output channel override state is valid) or RESET (output channel override state is invalid).
  */
#define IS_TIM_OC_OVERRIDE_STATE(state) (((state) == HAL_TIM_OC_OVERRIDE_RESET) \
                                         ||((state) == HAL_TIM_OC_OVERRIDE_SET))

/**
  * @brief  Check the validity of the output channel break mode.
  * @param  break_mode  The output channel break mode to check (@ref hal_tim_oc_break_mode_t).
  * @retval SET (output channel break mode is valid) or RESET (output channel break mode is invalid).
  */
#define IS_TIM_OC_BREAK_MODE(break_mode) (((break_mode) == HAL_TIM_OC_BREAKMODE_IMMEDIATE) \
                                          ||((break_mode) == HAL_TIM_OC_BREAKMODE_DELAY1)    \
                                          ||((break_mode) == HAL_TIM_OC_BREAKMODE_DELAY2))

/**
  * @brief  Check the validity of the pulse prescaler for the pulse on compare.
  * @param  prescaler  The pulse prescaler to check (@ref hal_tim_pulse_prescaler_t).
  * @retval SET (pulse prescaler is valid) or RESET (pulse prescaler is invalid).
  */
#define IS_TIM_PULSE_PRESCALER(prescaler) (((prescaler) == HAL_TIM_PULSE_DIV1)  \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV2)  \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV4)  \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV8)  \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV16) \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV32) \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV64) \
                                           ||((prescaler) == HAL_TIM_PULSE_DIV128))

/**
  * @brief  Check the validity of the pulse width for the pulse on compare.
  * @param  pulse_width  The pulse width to check.
  * @retval SET (pulse width is valid) or RESET (pulse width is invalid).
  */
#define IS_TIM_OC_PULSE_WIDTH(pulse_width) \
  (((pulse_width) > 0U) && ((pulse_width) <= 0xFFU))

/**
  * @brief  Check the validity of the dithering pattern.
  * @param  pattern  The dithering pattern to check (@ref hal_tim_dithering_pattern_t).
  * @retval SET (dithering pattern is valid) or RESET (dithering pattern is invalid).
  */
#define IS_TIM_DITHERING_PATTERN(pattern) \
  (((pattern) == HAL_TIM_DITHERING_0_16)  \
   ||((pattern) == HAL_TIM_DITHERING_1_16)  \
   ||((pattern) == HAL_TIM_DITHERING_2_16)  \
   ||((pattern) == HAL_TIM_DITHERING_3_16)  \
   ||((pattern) == HAL_TIM_DITHERING_4_16)  \
   ||((pattern) == HAL_TIM_DITHERING_5_16)  \
   ||((pattern) == HAL_TIM_DITHERING_6_16)  \
   ||((pattern) == HAL_TIM_DITHERING_7_16)  \
   ||((pattern) == HAL_TIM_DITHERING_8_16)  \
   ||((pattern) == HAL_TIM_DITHERING_9_16)  \
   ||((pattern) == HAL_TIM_DITHERING_10_16) \
   ||((pattern) == HAL_TIM_DITHERING_11_16) \
   ||((pattern) == HAL_TIM_DITHERING_12_16) \
   ||((pattern) == HAL_TIM_DITHERING_13_16) \
   ||((pattern) == HAL_TIM_DITHERING_14_16) \
   ||((pattern) == HAL_TIM_DITHERING_15_16))

/**
  * @brief  Check the validity of an input channel parameter.
  * @param  instance  TIM instance.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @retval SET (input channel is valid) or RESET (input channel is invalid).
  */
#define IS_TIM_IC_CHANNEL(instance, channel) \
  ((((channel) == HAL_TIM_CHANNEL_1) && IS_TIM_CC1_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_2) && IS_TIM_CC2_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_3) && IS_TIM_CC3_INSTANCE((instance))) \
   || (((channel) == HAL_TIM_CHANNEL_4) && IS_TIM_CC4_INSTANCE((instance))))

/**
  * @brief  Check the validity of an input capture unit parameter.
  * @param  instance      TIM instance.
  * @param  capture_unit  The capture unit to check (@ref hal_tim_ic_capture_unit_t).
  * @retval SET (input capture unit is valid) or RESET (input capture unit is invalid).
  */
#define IS_TIM_IC_CAPTURE_UNIT(instance, capture_unit) \
  ((((capture_unit) == HAL_TIM_IC_CAPTURE_UNIT_1) && IS_TIM_CC1_INSTANCE((instance))) \
   || (((capture_unit) == HAL_TIM_IC_CAPTURE_UNIT_2) && IS_TIM_CC2_INSTANCE((instance))) \
   || (((capture_unit) == HAL_TIM_IC_CAPTURE_UNIT_3) && IS_TIM_CC3_INSTANCE((instance))) \
   || (((capture_unit) == HAL_TIM_IC_CAPTURE_UNIT_4) && IS_TIM_CC4_INSTANCE((instance))))

/**
  * @brief  Check the validity of the input channel polarity.
  * @param  polarity  The input channel polarity to check (@ref hal_tim_ic_polarity_t).
  * @retval SET (input channel polarity is valid) or RESET (input channel polarity is invalid).
  */
#define IS_TIM_IC_POLARITY(polarity)  \
  (((polarity) == HAL_TIM_IC_RISING)  \
   ||((polarity) == HAL_TIM_IC_FALLING) \
   ||((polarity) == HAL_TIM_IC_RISING_FALLING))

/**
  * @brief  Check the validity of the input capture unit source.
  * @param  src  The input capture unit source to check (@ref hal_tim_ic_capture_unit_src_t).
  * @retval SET (input capture unit source is valid) or RESET (input capture unit source is invalid).
  */
#define IS_TIM_IC_CAPTURE_UNIT_SRC(src) \
  (((src) == HAL_TIM_IC_DIRECT)                  \
   ||((src) == HAL_TIM_IC_INDIRECT_RISING)         \
   ||((src) == HAL_TIM_IC_INDIRECT_FALLING)        \
   ||((src) == HAL_TIM_IC_INDIRECT_RISING_FALLING) \
   ||((src) == HAL_TIM_IC_TRC))

/**
  * @brief  Check the validity of the input capture unit prescaler.
  * @param  prescaler  The input capture unit prescaler to check (@ref hal_tim_ic_capture_unit_prescaler_t).
  * @retval SET (input capture unit prescaler is valid) or RESET (input capture unit prescaler is invalid
  */
#define IS_TIM_IC_CAPTURE_UNIT_PRESCALER(prescaler) \
  (((prescaler) == HAL_TIM_IC_DIV1) \
   ||((prescaler) == HAL_TIM_IC_DIV2) \
   ||((prescaler) == HAL_TIM_IC_DIV4) \
   ||((prescaler) == HAL_TIM_IC_DIV8))

