MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/**
  * @brief  Check the validity of the XOR gate position.
  * @param  pos  The XOR gate position to check (@ref hal_tim_ic_xor_gate_position_t).
  * @retval SET (XOR gate position is valid) or RESET (XOR gate position is invalid).
  */
#define IS_TIM_XOR_GATE_POSITION(pos) (((pos) == HAL_TIM_IC_XOR_GATE_POS_DIRECT) \
                                       ||((pos) == HAL_TIM_IC_XOR_GATE_POS_FILTERED))

/**
  * @brief  Check the validity of the XOR gate channel.
  * @param  instance  TIM instance.
  * @param  channel   The XOR gate channel to check (@ref hal_tim_channel_t).
  * @note   Channels 1, 2, and 3 can be used as XOR gate channels, but not channel 4.
  * @retval SET (XOR gate channel is valid) or RESET (XOR gate channel is invalid).
  */
#define IS_TIM_XOR_GATE_CHANNEL(instance, channel) ((IS_TIM_IC_CHANNEL(instance, channel)) \
                                                    && (channel != HAL_TIM_CHANNEL_4))

/**
  * @brief  Check the validity of the encoder index direction.
  * @param  dir  The encoder index direction to check (@ref hal_tim_encoder_index_dir_t).
  * @retval SET (encoder index direction is valid) or RESET (encoder index direction is invalid).
  */
#define IS_TIM_ENCODER_INDEX_DIR(dir) (((dir) == HAL_TIM_ENCODER_INDEX_UP_DOWN) \
                                       ||((dir) == HAL_TIM_ENCODER_INDEX_UP)      \
                                       ||((dir) == HAL_TIM_ENCODER_INDEX_DOWN))

/**
  * @brief  Check the validity of the encoder index blanking mode.
  * @param  blanking  The encoder index blanking mode to check (@ref hal_tim_encoder_index_blank_mode_t).
  * @retval SET (encoder index blanking mode is valid) or RESET (encoder index blanking mode is invalid).
  */
#define IS_TIM_ENCODER_INDEX_BLANK_MODE(blanking) \
  (((blanking) == HAL_TIM_ENCODER_INDEX_BLANK_ALWAYS) \
   ||((blanking) == HAL_TIM_ENCODER_INDEX_BLANK_TI3)  \
   ||((blanking) == HAL_TIM_ENCODER_INDEX_BLANK_TI4))

/**
  * @brief  Check the validity of the encoder index position selection.
  * @param  pos  The encoder index position selection to check (@ref hal_tim_encoder_index_pos_sel_t).
  * @retval SET (encoder index position selection is valid) or RESET (encoder index position selection is invalid).
  */
#define IS_TIM_ENCODER_INDEX_POS_SEL(pos) \
  (((pos) == HAL_TIM_ENCODER_INDEX_POS_DOWN_DOWN) \
   ||((pos) == HAL_TIM_ENCODER_INDEX_POS_DOWN_UP) \
   ||((pos) == HAL_TIM_ENCODER_INDEX_POS_UP_DOWN) \
   ||((pos) == HAL_TIM_ENCODER_INDEX_POS_UP_UP)   \
   ||((pos) == HAL_TIM_ENCODER_INDEX_POS_DOWN)    \
   ||((pos) == HAL_TIM_ENCODER_INDEX_POS_UP))

/**
  * @brief  Check the validity of the encoder index selection.
  * @param  sel  The encoder index selection to check (@ref hal_tim_encoder_index_sel_t).
  * @retval SET (encoder index selection is valid) or RESET (encoder index selection is invalid).
  */
#define IS_TIM_ENCODER_INDEX_SEL(sel) \
  (((sel) == HAL_TIM_ENCODER_INDEX_ALL)  \
   ||((sel) == HAL_TIM_ENCODER_INDEX_FIRST_ONLY))

/**
  * @brief  Check the validity of the external trigger polarity.
  * @param  polarity  The external trigger polarity to check (@ref hal_tim_ext_trig_polarity_t).
  * @retval SET (external trigger polarity is valid) or RESET (external trigger polarity is invalid).
  */
#define IS_TIM_EXT_TRIG_POLARITY(polarity) \
  (((polarity) == HAL_TIM_EXT_TRIG_NONINVERTED) \
   ||((polarity) == HAL_TIM_EXT_TRIG_INVERTED))

/**
  * @brief  Check the validity of the external trigger prescaler.
  * @param  prescaler  The external trigger prescaler to check (@ref hal_tim_ext_trig_prescaler_t).
  * @retval SET (external trigger prescaler is valid) or RESET (external trigger prescaler is invalid).
  */
#define IS_TIM_EXT_TRIG_PRESCALER(prescaler) \
  (((prescaler) == HAL_TIM_EXT_TRIG_DIV1)  \
   ||((prescaler) == HAL_TIM_EXT_TRIG_DIV2)  \
   ||((prescaler) == HAL_TIM_EXT_TRIG_DIV4)  \
   ||((prescaler) == HAL_TIM_EXT_TRIG_DIV8))

/**
  * @brief  Check the validity of the external trigger synchronous prescaler.
  * @param  sync_prescaler  The external trigger synchronous prescaler to check
  *                         (@ref hal_tim_ext_trig_sync_prescaler_t).
  * @retval SET (external trigger synchronous prescaler is valid) or
  *         RESET (external trigger synchronous prescaler is invalid).
  */
#define IS_TIM_EXT_TRIG_SYNC_PRESCALER(sync_prescaler) \
  (((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV1)    \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV2)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV3)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV4)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV5)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV6)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV7)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV8)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV9)  \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV10) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV11) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV12) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV13) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV14) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV15) \
   ||((sync_prescaler) == HAL_TIM_EXT_TRIG_SYNC_DIV16))

/**
  * @brief  Check the validity of the TIM1 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM1 external trigger source.
  */
#if defined(COMP2)
#define IS_TIM1_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM1_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_COMP2_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD3))
#else
#define IS_TIM1_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM1_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM1_ADC1_AWD3))
#endif /* PLAY1 && COMP3 */

/**
  * @brief  Check the validity of the TIM2 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM2 external trigger source.
  */
#if defined(TIM4)
#define IS_TIM2_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM2_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD3) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_LSE) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_MCO1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_TIM3_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_TIM4_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_TIM5_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ETH1_PTP_PPS_OUT))
#elif defined(TIM5)
#define IS_TIM2_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM2_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD3) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_LSE) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_MCO1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_TIM5_ETR))
#elif defined(COMP2)
#define IS_TIM2_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM2_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_COMP2_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_ADC1_AWD3) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_LSE) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM2_MCO1))
#endif /* PLAY1 */

#if defined(TIM3)
/**
  * @brief  Check the validity of the TIM3 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM3 external trigger source.
  */
#if defined(TIM4)
#define IS_TIM3_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM3_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM3_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM3_TIM2_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM3_TIM4_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM3_TIM5_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM3_ETH1_PTP_PPS_OUT))
#endif /* PLAY1 */
#endif /* TIM3 */

#if defined(TIM4)
/**
  * @brief  Check the validity of the TIM4 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM4 external trigger source.
  */
#define IS_TIM4_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM4_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_ADC3_AWD3) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_TIM2_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_TIM3_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM4_TIM5_ETR))
#endif /* TIM4 */

#if defined(TIM5)
/**
  * @brief  Check the validity of the TIM5 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM5 external trigger source.
  */
#if defined(TIM4)
#define IS_TIM5_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM5_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM2_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM3_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM4_ETR))
#elif defined(TIM3)
#define IS_TIM5_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM5_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM2_ETR) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM3_ETR))
#else
#define IS_TIM5_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM5_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM5_TIM2_ETR))
#endif /* COMP3 */
#endif /* TIM5 */

/**
  * @brief  Check the validity of the TIM8 external trigger sources.
  * @param  src  The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of TIM8 external trigger source.
  */
#if defined(ADC3)
#define IS_TIM8_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM8_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD3) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC3_AWD3))
#elif defined(ADC2)
#define IS_TIM8_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM8_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC2_AWD3))
#elif defined(COMP2)
#define IS_TIM8_EXT_TRG_SRC(src) \
  (((src) == HAL_TIM_EXT_TRIG_TIM8_GPIO) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_COMP1_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_COMP2_OUT) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD1) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD2) \
   || ((src) == HAL_TIM_EXT_TRIG_TIM8_ADC1_AWD3))
#endif /* PLAY1 */


/**
  * @brief  Check the validity of the external trigger sources.
  * @param  instance  TIM instance.
  * @param  src       The external trigger source to check (@ref hal_tim_ext_trig_src_t).
  * @return Validity of external trigger source.
  */
#if defined(TIM4)
#define IS_TIM_EXT_TRIG_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_EXT_TRG_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_EXT_TRG_SRC((src))) \
   || (((instance) == TIM3) && IS_TIM3_EXT_TRG_SRC((src))) \
   || (((instance) == TIM4) && IS_TIM4_EXT_TRG_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_EXT_TRG_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_EXT_TRG_SRC((src))))
#elif defined(TIM3)
#define IS_TIM_EXT_TRIG_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_EXT_TRG_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_EXT_TRG_SRC((src))) \
   || (((instance) == TIM3) && IS_TIM3_EXT_TRG_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_EXT_TRG_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_EXT_TRG_SRC((src))))
#elif defined(TIM5)
#define IS_TIM_EXT_TRIG_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_EXT_TRG_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_EXT_TRG_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_EXT_TRG_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_EXT_TRG_SRC((src))))
#else
#define IS_TIM_EXT_TRIG_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_EXT_TRG_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_EXT_TRG_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_EXT_TRG_SRC((src))))
#endif /* TIM20 */

/**
  * @brief  Check the validity of the TIM1 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(COMP2)
#define IS_TIM1_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM1_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM1_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM1_TI1_COMP2_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI4_GPIO)))
#else
#define IS_TIM1_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM1_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM1_TI1_COMP1_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM1_TI4_GPIO)))
#endif /* PLAY1 */

/**
  * @brief  Check the validity of the TIM2 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(TIM5) && defined(FDCAN2)
#define IS_TIM2_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM2_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_ETH1_PTP_PPS_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSI) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_TIM5_CH1) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_FDCAN1_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_HSE_RTC) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO1) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO2) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_FDCAN1_TXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI3_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI3_FDCAN2_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI4_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_FDCAN2_TXEOF_EVT))))
#elif defined(TIM5) && defined(FDCAN1)
#define IS_TIM2_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM2_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSI) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_TIM5_CH1) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_FDCAN1_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_HSE_RTC) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO1) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO2) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_FDCAN1_TXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM2_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI4_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT))))
#elif defined(TIM5)
#define IS_TIM2_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM2_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSI) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_TIM5_CH1))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_HSE_RTC) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO1) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO2))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM2_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI4_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT))))
#elif defined(FDCAN1)
#define IS_TIM2_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM2_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP2_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSI) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_FDCAN1_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_HSE_RTC) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO1) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO2) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_FDCAN1_TXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI3_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI3_FDCAN2_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI4_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP2_OUT) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_FDCAN2_TXEOF_EVT))))
#else
#define IS_TIM2_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM2_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_COMP2_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSI) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM2_TI1_RTC_WUT_TRG))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_HSE_RTC) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO1) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI2_MCO2))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM2_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && (((src) == HAL_TIM_INPUT_TIM2_TI4_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP1_OUT) \
           || ((src) == HAL_TIM_INPUT_TIM2_TI4_COMP2_OUT))))
#endif /* PLAY1 */

#if defined(TIM3)
/**
  * @brief  Check the validity of the TIM3 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(FDCAN2)
#define IS_TIM3_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM3_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM3_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM3_TI1_ETH1_PTP_PPS_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM3_TI1_FDCAN2_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM3_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM3_TI2_FDCAN2_TXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM3_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM3_TI4_GPIO)))
#else
#define IS_TIM3_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM3_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM3_TI1_COMP1_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM3_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM3_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM3_TI4_GPIO)))
#endif /* PLAY1 */
#endif /* TIM3 */

#if defined(TIM4)
/**
  * @brief  Check the validity of the TIM4 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_TIM4_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM4_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM4_TI1_COMP1_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM4_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM4_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM4_TI4_GPIO)))
#endif /* TIM4 */

#if defined(TIM5)
/**
  * @brief  Check the validity of the TIM5 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_TIM5_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM5_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM5_TI1_COMP1_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM5_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM5_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM5_TI4_GPIO)))
#endif /* TIM5 */

