MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/**
  * @brief  Check the validity of the TIM8 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(COMP2)
#define IS_TIM8_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM8_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM8_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM8_TI1_COMP2_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI4_GPIO)))
#else
#define IS_TIM8_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM8_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM8_TI1_COMP1_OUT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI2_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_3) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI3_GPIO)) \
   || (((channel) == HAL_TIM_CHANNEL_4) \
       && ((src) == HAL_TIM_INPUT_TIM8_TI4_GPIO)))
#endif /* PLAY1 */

/**
  * @brief  Check the validity of the TIM12 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(COMP2)
#define IS_TIM12_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM12_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_COMP2_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_MCO1) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_MCO2) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_HSE_RTC) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_I3C1_IBI_ACK))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM12_TI2_GPIO)))
#else
#define IS_TIM12_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM12_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_MCO1) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_MCO2) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_HSE_RTC) \
        || ((src) == HAL_TIM_INPUT_TIM12_TI1_I3C1_IBI_ACK))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM12_TI2_GPIO)))
#endif /* PLAY1 */

/**
  * @brief  Check the validity of the TIM15 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(COMP2) && defined(FDCAN2)
#define IS_TIM15_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM15_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP2_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_FDCAN2_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM15_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM15_TI2_FDCAN2_TXEOF_EVT))))
#elif defined(COMP2)
#define IS_TIM15_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM15_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP2_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_LSE))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM15_TI2_GPIO)))
#elif defined(FDCAN2)
#define IS_TIM15_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM15_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_LSE) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_FDCAN2_RXEOF_EVT))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && (((src) == HAL_TIM_INPUT_TIM15_TI2_GPIO) \
           || ((src) == HAL_TIM_INPUT_TIM15_TI2_FDCAN2_TXEOF_EVT))))
#else
#define IS_TIM15_CHANNEL_SRC(channel, src) \
  ((((channel) == HAL_TIM_CHANNEL_1) \
    && (((src) == HAL_TIM_INPUT_TIM15_TI1_GPIO) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_COMP1_OUT) \
        || ((src) == HAL_TIM_INPUT_TIM15_TI1_LSE))) \
   || (((channel) == HAL_TIM_CHANNEL_2) \
       && ((src) == HAL_TIM_INPUT_TIM15_TI2_GPIO)))
#endif /* PLAY1 */

#if defined(TIM16)
/**
  * @brief  Check the validity of the TIM16 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_TIM16_CHANNEL_SRC(channel, src) \
  (((channel) == HAL_TIM_CHANNEL_1) \
   && (((src) == HAL_TIM_INPUT_TIM16_TI1_GPIO) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_COMP1_OUT) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_LSI) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_LSE) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_RTC_WUT_TRG) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_MCO1) \
       || ((src) == HAL_TIM_INPUT_TIM16_TI1_MCO2)))

/**
  * @brief  Check the validity of the TIM17 channel sources.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#define IS_TIM17_CHANNEL_SRC(channel, src) \
  (((channel) == HAL_TIM_CHANNEL_1) \
   && (((src) == HAL_TIM_INPUT_TIM17_TI1_GPIO) \
       || ((src) == HAL_TIM_INPUT_TIM17_TI1_COMP1_OUT) \
       || ((src) == HAL_TIM_INPUT_TIM17_TI1_HSE_RTC) \
       || ((src) == HAL_TIM_INPUT_TIM17_TI1_MCO1) \
       || ((src) == HAL_TIM_INPUT_TIM17_TI1_MCO2) \
       || ((src) == HAL_TIM_INPUT_TIM17_TI1_I3C1_IBI_ACK)))
#endif /* TIM16 */


/**
  * @brief  Check the validity of the channel sources.
  * @param  instance  TIM instance.
  * @param  channel   The channel to check (@ref hal_tim_channel_t).
  * @param  src       The channel source to check (@ref hal_tim_channel_src_t).
  * @retval SET (channel source is valid) or RESET (channel source is invalid).
  */
#if defined(TIM4)
#define IS_TIM_CHANNEL_SRC(instance, channel, src) \
  ((((instance) == TIM1) && IS_TIM1_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM2) && IS_TIM2_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM3) && IS_TIM3_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM4) && IS_TIM4_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM5) && IS_TIM5_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM8) && IS_TIM8_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM12) && IS_TIM12_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM15) && IS_TIM15_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM16) && IS_TIM16_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM17) && IS_TIM17_CHANNEL_SRC((channel), (src))))
#elif defined(TIM3)
#define IS_TIM_CHANNEL_SRC(instance, channel, src) \
  ((((instance) == TIM1) && IS_TIM1_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM2) && IS_TIM2_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM3) && IS_TIM3_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM5) && IS_TIM5_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM8) && IS_TIM8_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM12) && IS_TIM12_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM15) && IS_TIM15_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM16) && IS_TIM16_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM17) && IS_TIM17_CHANNEL_SRC((channel), (src))))
#elif defined(TIM5)
#define IS_TIM_CHANNEL_SRC(instance, channel, src) \
  ((((instance) == TIM1) && IS_TIM1_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM2) && IS_TIM2_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM5) && IS_TIM5_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM8) && IS_TIM8_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM12) && IS_TIM12_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM15) && IS_TIM15_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM16) && IS_TIM16_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM17) && IS_TIM17_CHANNEL_SRC((channel), (src))))
#else
#define IS_TIM_CHANNEL_SRC(instance, channel, src) \
  ((((instance) == TIM1) && IS_TIM1_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM2) && IS_TIM2_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM8) && IS_TIM8_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM12) && IS_TIM12_CHANNEL_SRC((channel), (src))) \
   || (((instance) == TIM15) && IS_TIM15_CHANNEL_SRC((channel), (src))))
#endif /* TIM20 && TIM4 */

/**
  * @brief  Check the validity of the slave mode.
  * @param  mode  The slave mode to check (@ref hal_tim_slave_mode_t).
  * @retval SET (slave mode is valid) or RESET (slave mode is invalid).
  */
#define IS_TIM_SLAVE_MODE(mode) \
  (((mode) == HAL_TIM_SLAVE_DISABLED)                 \
   ||((mode) == HAL_TIM_SLAVE_RESET)                  \
   ||((mode) == HAL_TIM_SLAVE_GATED)                  \
   ||((mode) == HAL_TIM_SLAVE_TRIGGER)                \
   ||((mode) == HAL_TIM_SLAVE_COMBINED_RESET_TRIGGER) \
   ||((mode) == HAL_TIM_SLAVE_COMBINED_GATED_RESET))

/**
  * @brief  Check the validity of the trigger output source.
  * @param  src  The trigger output source to check (@ref hal_tim_trigger_output_source_t).
  * @retval SET (trigger output source is valid) or RESET (trigger output source is invalid).
  */
#define IS_TIM_TRIGGER_OUTPUT_SOURCE(src) \
  (((src) == HAL_TIM_TRGO_RESET)    \
   ||((src) == HAL_TIM_TRGO_ENABLE) \
   ||((src) == HAL_TIM_TRGO_UPDATE) \
   ||((src) == HAL_TIM_TRGO_CC1IF)  \
   ||((src) == HAL_TIM_TRGO_OC1)    \
   ||((src) == HAL_TIM_TRGO_OC2)    \
   ||((src) == HAL_TIM_TRGO_OC3)    \
   ||((src) == HAL_TIM_TRGO_OC4)    \
   ||((src) == HAL_TIM_TRGO_ENCODER_CLK))

/**
  * @brief  Check the validity of the trigger output2 source.
  * @param  src  The trigger output2 source to check (@ref hal_tim_trigger_output2_source_t).
  * @retval SET (trigger output2 source is valid) or RESET (trigger output2 source is invalid).
  */
#define IS_TIM_TRIGGER_OUTPUT2_SOURCE(src) \
  (((src) == HAL_TIM_TRGO2_RESET)                    \
   ||((src) == HAL_TIM_TRGO2_ENABLE)                 \
   ||((src) == HAL_TIM_TRGO2_UPDATE)                 \
   ||((src) == HAL_TIM_TRGO2_CC1F)                   \
   ||((src) == HAL_TIM_TRGO2_OC1)                    \
   ||((src) == HAL_TIM_TRGO2_OC2)                    \
   ||((src) == HAL_TIM_TRGO2_OC3)                    \
   ||((src) == HAL_TIM_TRGO2_OC4)                    \
   ||((src) == HAL_TIM_TRGO2_OC5)                    \
   ||((src) == HAL_TIM_TRGO2_OC6)                    \
   ||((src) == HAL_TIM_TRGO2_OC7)                    \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC7_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC6_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC6_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC6_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC7_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC6_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC7_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_OC7_FALLING))

/**
  * @brief  Check the validity of the trigger output2 postscaler source.
  * @param  src  The trigger output2 postscaler source to check (@ref hal_tim_trigger_output2_source_t).
  * @note   The postscaler is only applicable when tim_trgo2 transfers a pulse (reset, update, compare pulse).
  * @retval SET (trigger output2 postscaler source is valid) or RESET (trigger output2 postscaler source is invalid).
  */
#define IS_TIM_TRIGGER_OUTPUT2_PSC_SOURCE(src) \
  (((src) == HAL_TIM_TRGO2_RESET)                    \
   ||((src) == HAL_TIM_TRGO2_UPDATE)                 \
   ||((src) == HAL_TIM_TRGO2_CC1F)                   \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC7_RISING_FALLING)     \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC6_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC6_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_OC7_RISING)  \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC6_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC4_RISING_OC7_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC6_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC5_RISING_OC7_FALLING) \
   ||((src) == HAL_TIM_TRGO2_OC6_RISING_OC7_FALLING))

/**
  * @brief  Check the validity of the trigger output2 postscaler.
  * @param  psc  The trigger output2 postscaler to check.
  * @retval SET (trigger output2 postscaler is valid) or RESET (trigger output2 postscaler is invalid).
  */
#define IS_TIM_TRIGGER_OUTPUT2_PSC(psc)  ((psc) <= 0x1FU)

/**
  * @brief  Check the validity of the slave mode preload source.
  * @param  src  The slave mode preload source to check (@ref hal_tim_slave_mode_preload_src_t).
  * @retval SET (slave mode preload source is valid) or RESET (slave mode preload source is invalid).
  */
#define IS_TIM_SLAVE_MODE_PRELOAD_SRC(src) (((src) == HAL_TIM_SLAVE_MODE_PRELOAD_UPDATE)  \
                                            ||((src) == HAL_TIM_SLAVE_MODE_PRELOAD_INDEX))


/**
  * @brief  Check the validity of the TIM1 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#if defined(COMP2)
#define IS_TIM1_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM1_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM1_COMP1_OUT) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM1_COMP2_OUT))
#else
#define IS_TIM1_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM1_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM1_COMP1_OUT))
#endif /* PLAY1 */

/**
  * @brief  Check the validity of the TIM2 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#if defined(COMP2)
#define IS_TIM2_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM2_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM2_COMP1_OUT) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM2_COMP2_OUT))
#else
#define IS_TIM2_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM2_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM2_COMP1_OUT))
#endif /* PLAY1 */

#if defined(TIM3)
/**
  * @brief  Check the validity of the TIM3 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#define IS_TIM3_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM3_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM3_COMP1_OUT))
#endif /* TIM3 */

#if defined(TIM4)
/**
  * @brief  Check the validity of the TIM4 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#define IS_TIM4_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM4_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM4_COMP1_OUT))
#endif /* TIM4 */

#if defined(TIM5)
/**
  * @brief  Check the validity of the TIM5 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#define IS_TIM5_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM5_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM5_COMP1_OUT))
#endif /* TIM5 */

/**
  * @brief  Check the validity of the TIM8 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#if defined(COMP2)
#define IS_TIM8_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM8_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM8_COMP1_OUT) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM8_COMP2_OUT))
#else
#define IS_TIM8_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM8_ETR) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM8_COMP1_OUT))
#endif /* PLAY1 */

/**
  * @brief  Check the validity of the TIM15 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#if defined(COMP2)
#define IS_TIM15_OCREF_CLR_SRC(src) \
  (((src) == HAL_TIM_OCREF_CLR_TIM15_COMP1_OUT) \
   || ((src) == HAL_TIM_OCREF_CLR_TIM15_COMP2_OUT))
#else
#define IS_TIM15_OCREF_CLR_SRC(src) \
  ((src) == HAL_TIM_OCREF_CLR_TIM15_COMP1_OUT)
#endif /* PLAY1 */

#if defined(TIM16)
/**
  * @brief  Check the validity of the TIM16 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#define IS_TIM16_OCREF_CLR_SRC(src) \
  ((src) == HAL_TIM_OCREF_CLR_TIM16_COMP1_OUT)

/**
  * @brief  Check the validity of the TIM17 OCref clear sources.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#define IS_TIM17_OCREF_CLR_SRC(src) \
  ((src) == HAL_TIM_OCREF_CLR_TIM17_COMP1_OUT)
#endif /* TIM16 */


/**
  * @brief  Check the validity of the OCref clear sources.
  * @param  instance  TIM instance.
  * @param  src  The OCref clear source to check (@ref hal_tim_ocref_clr_src_t).
  * @retval SET (OCref clear source is valid) or RESET (OCref clear source is invalid).
  */
#if defined(TIM4)
#define IS_TIM_OCREF_CLR_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM3) && IS_TIM3_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM4) && IS_TIM4_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM15) && IS_TIM15_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM16) && IS_TIM16_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM17) && IS_TIM17_OCREF_CLR_SRC((src))))
#elif defined(TIM3)
#define IS_TIM_OCREF_CLR_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM3) && IS_TIM3_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM15) && IS_TIM15_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM16) && IS_TIM16_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM17) && IS_TIM17_OCREF_CLR_SRC((src))))
#elif defined(TIM5)
#define IS_TIM_OCREF_CLR_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM5) && IS_TIM5_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM15) && IS_TIM15_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM16) && IS_TIM16_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM17) && IS_TIM17_OCREF_CLR_SRC((src))))
#else
#define IS_TIM_OCREF_CLR_SRC(instance, src) \
  ((((instance) == TIM1) && IS_TIM1_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM2) && IS_TIM2_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM8) && IS_TIM8_OCREF_CLR_SRC((src))) \
   || (((instance) == TIM15) && IS_TIM15_OCREF_CLR_SRC((src))))
#endif /* TIM20 && TIM4 */

/**
  * @brief  Check the validity of the DMA index.
  * @param  index  The DMA index to check (@ref hal_tim_dma_index_t).
  * @retval SET (DMA index is valid) or RESET (DMA index is invalid).
  */
#define IS_TIM_DMA_INDEX(index) (((index) == HAL_TIM_DMA_ID_UPD)   \
                                 ||((index) == HAL_TIM_DMA_ID_CC1) \
                                 ||((index) == HAL_TIM_DMA_ID_CC2) \
                                 ||((index) == HAL_TIM_DMA_ID_CC3) \
                                 ||((index) == HAL_TIM_DMA_ID_CC4) \
                                 ||((index) == HAL_TIM_DMA_ID_COM) \
                                 ||((index) == HAL_TIM_DMA_ID_TRGI))

/**
  * @brief  Check the validity of the DMA burst base address register.
  * @param  address  The DMA burst base address register to check (@ref hal_tim_dmaburst_base_addr_reg_t).
  * @retval SET (DMA burst base address register is valid) or RESET (DMA burst base address register is invalid).
  */
#define IS_TIM_DMABURST_BASE_ADDR_REG(address) \
  (((address) == HAL_TIM_DMABURST_BASE_ADDR_CR1)     \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CR2)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_SMCR)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_DIER)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_SR)    \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_EGR)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCMR1) \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCMR2) \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCER)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CNT)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_PSC)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_ARR)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_RCR)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR1)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR2)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR3)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR4)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_BDTR)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR5)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR6)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCMR3) \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_DTR2)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_ECR)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_TISEL) \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_AF1)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_AF2)   \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCR7)  \
   ||((address) == HAL_TIM_DMABURST_BASE_ADDR_CCMR4))

