MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/**
  * @brief  Check the validity of the DMA burst source.
  * @param  instance  The TIM instance to check.
  * @param  source    The DMA burst source to check (@ref hal_tim_dmaburst_source_t).
  * @retval SET (DMA burst source is valid) or RESET (DMA burst source is invalid).
  */
#define IS_TIM_DMABURST_SRC(instance, source) \
  (((source) == HAL_TIM_DMABURST_UPD)   \
   || (((source) == HAL_TIM_DMABURST_CC1)  && IS_TIM_CC1_INSTANCE((instance)))               \
   || (((source) == HAL_TIM_DMABURST_CC2)  && IS_TIM_CC2_INSTANCE((instance)))               \
   || (((source) == HAL_TIM_DMABURST_CC3)  && IS_TIM_CC3_INSTANCE((instance)))               \
   || (((source) == HAL_TIM_DMABURST_CC4)  && IS_TIM_CC4_INSTANCE((instance)))               \
   || (((source) == HAL_TIM_DMABURST_COM)  && IS_TIM_COMMUTATION_EVENT_INSTANCE((instance))) \
   || (((source) == HAL_TIM_DMABURST_TRGI) && IS_TIM_SLAVE_INSTANCE((instance))))

/**
  * @brief  Check the validity of the DMA burst length.
  * @param  size  The DMA burst length to check (@ref hal_tim_dmaburst_length_t).
  * @retval SET (DMA burst length is valid) or RESET (DMA burst length is invalid).
  */
#define IS_TIM_DMABURST_LENGTH(size) \
  (((size) == HAL_TIM_DMABURST_1TRANSFER)     \
   ||((size) == HAL_TIM_DMABURST_2TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_3TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_4TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_5TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_6TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_7TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_8TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_9TRANSFERS)  \
   ||((size) == HAL_TIM_DMABURST_10TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_11TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_12TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_13TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_14TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_15TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_16TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_17TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_18TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_19TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_20TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_21TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_22TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_23TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_24TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_25TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_26TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_27TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_28TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_29TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_30TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_31TRANSFERS) \
   ||((size) == HAL_TIM_DMABURST_32TRANSFERS))

/**
  * @brief  Check the validity of the DMA burst direction.
  * @param  dir  The DMA burst direction to check (@ref hal_tim_dmaburst_direction_t).
  * @retval SET (DMA burst direction is valid) or RESET (DMA burst direction is invalid).
  */
#define IS_TIM_DMABURST_DIR(dir) (((dir) == HAL_TIM_DMABURST_READ) \
                                  || ((dir) == HAL_TIM_DMABURST_WRITE))

/**
  * @brief  Check the validity of the break input.
  * @param  id  The break input to check (@ref hal_tim_break_input_id_t).
  * @retval SET (break input is valid) or RESET (break input is invalid).
  */
#define IS_TIM_BREAK_INPUT_ID(id) \
  (((id) == HAL_TIM_BREAK_INPUT_1) || ((id) == HAL_TIM_BREAK_INPUT_2))

/**
  * @brief  Check the validity of the break input polarity.
  * @param  polarity  The break input polarity to check (@ref hal_tim_break_input_polarity_t).
  * @retval SET (break input polarity is valid) or RESET (break input polarity is invalid).
  */
#define IS_TIM_BREAK_INPUT_POLARITY(polarity) \
  (((polarity) == HAL_TIM_BREAK_INPUT_LOW) \
   ||((polarity) == HAL_TIM_BREAK_INPUT_HIGH))

/**
  * @brief  Check the validity of the break input mode.
  * @param  mode  The break input mode to check (@ref hal_tim_break_input_mode_t).
  * @retval SET (break input mode is valid) or RESET (break input mode is invalid).
  */
#define IS_TIM_BREAK_INPUT_MODE(mode) \
  (((mode) == HAL_TIM_BREAK_INPUT_MODE_INPUT) \
   ||((mode) == HAL_TIM_BREAK_INPUT_MODE_BIDIRECTIONAL))

/**
  * @brief  Check the validity of the break input source combination.
  * @param  instance  The TIM instance to check.
  * @param  id        The break input id to check (@ref hal_tim_break_input_id_t).
  * @param  brkinsrc  The break input source combination to check.
  * @retval SET (break input source combination is valid) or RESET (break input source combination is invalid).
  */
#if defined(TIM16)
#define IS_TIM_BREAK_INPUT_ALL_SRC(instance, id, brkinsrc) \
  (((brkinsrc) != 0U) \
   && ((((id) == HAL_TIM_BREAK_INPUT_1) \
        && ((((instance) == TIM1) && (((brkinsrc) & ~(TIM1_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM8) && (((brkinsrc) & ~(TIM8_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM15) && (((brkinsrc) & ~(TIM15_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM16) && (((brkinsrc) & ~(TIM16_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM17) && (((brkinsrc) & ~(TIM17_BRK_SOURCE_MASK)) == 0U)))) \
       || (((id) == HAL_TIM_BREAK_INPUT_2) \
           && ((((instance) == TIM1) && (((brkinsrc) & ~(TIM1_BRK2_SOURCE_MASK)) == 0U)) \
               || (((instance) == TIM8) && (((brkinsrc) & ~(TIM8_BRK2_SOURCE_MASK)) == 0U))))))
#else
#define IS_TIM_BREAK_INPUT_ALL_SRC(instance, id, brkinsrc) \
  (((brkinsrc) != 0U) \
   && ((((id) == HAL_TIM_BREAK_INPUT_1) \
        && ((((instance) == TIM1) && (((brkinsrc) & ~(TIM1_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM8) && (((brkinsrc) & ~(TIM8_BRK_SOURCE_MASK)) == 0U)) \
            || (((instance) == TIM15) && (((brkinsrc) & ~(TIM15_BRK_SOURCE_MASK)) == 0U)))) \
       || (((id) == HAL_TIM_BREAK_INPUT_2) \
           && ((((instance) == TIM1) && (((brkinsrc) & ~(TIM1_BRK2_SOURCE_MASK)) == 0U)) \
               || (((instance) == TIM8) && (((brkinsrc) & ~(TIM8_BRK2_SOURCE_MASK)) == 0U))))))
#endif /* TIM20 */

/**
  * @brief  Check that only one break input source is selected and supported.
  * @param  instance  The TIM instance to check.
  * @param  id        The break input id to check (@ref hal_tim_break_input_id_t).
  * @param  brkinsrc  The break input source to check.
  * @retval SET (only one break input source is selected and supported) or RESET (otherwise).
  */
#define IS_TIM_BREAK_INPUT_SRC(instance, id, brkinsrc) \
  ((((brkinsrc) & ((brkinsrc) - 1U)) == 0U) \
   && IS_TIM_BREAK_INPUT_ALL_SRC((instance), (id), (brkinsrc)))

/**
  * @brief  Check the validity of the break input source polarity for
  *         break input source that have a polarity configuration.
  * @param  brkinsrc  The break input source.
  * @param  polarity  The break input source polarity to check (@ref hal_tim_break_input_src_polarity_t).
  * @retval SET (break input source polarity is valid) or RESET (break input source polarity is invalid).
  */
#define IS_TIM_BREAK_INPUT_SRC_POLARITY(brkinsrc, polarity) \
  ((((brkinsrc) & TIM_BRK_BRK2_POLARITY_MASK) != 0U) \
   && (((polarity) == HAL_TIM_BREAK_INPUT_SRC_NONINVERTED) \
       || ((polarity) == HAL_TIM_BREAK_INPUT_SRC_INVERTED)))

/**
  * @brief  Check the validity of the break delay.
  * @param  break_delay  The break delay to check (@ref hal_tim_break_delay_t).
  * @retval SET (break delay is valid) or RESET (break delay is invalid).
  */
#define IS_TIM_BREAK_DELAY(break_delay)  \
  (((break_delay) == HAL_TIM_BREAK_DELAY1) \
   || ((break_delay) == HAL_TIM_BREAK_DELAY2))

/**
  * @brief  Check the validity of the break delay duration.
  * @param  delay  The break delay duration to check.
  * @retval SET (break delay duration is valid) or RESET (break delay duration is invalid).
  */
#define IS_TIM_BREAK_DELAY_DURATION(delay) ((delay) <= 0xFFU)

/**
  * @brief  Check the validity of the off state run.
  * @param  off_state_run  The off state run to check (@ref hal_tim_off_state_run_t).
  * @retval SET (off state run is valid) or RESET (off state run is invalid).
  */
#define IS_TIM_OFF_STATE_RUN(off_state_run) \
  (((off_state_run) == HAL_TIM_OFF_STATE_RUN_DISABLE) \
   || ((off_state_run) == HAL_TIM_OFF_STATE_RUN_ENABLE))

/**
  * @brief  Check the validity of the off state idle.
  * @param  off_state_idle  The off state idle to check (@ref hal_tim_off_state_idle_t).
  * @retval SET (off state idle is valid) or RESET (off state idle is invalid).
  */
#define IS_TIM_OFF_STATE_IDLE(off_state_idle) \
  (((off_state_idle) == HAL_TIM_OFF_STATE_IDLE_DISABLE) \
   || ((off_state_idle) == HAL_TIM_OFF_STATE_IDLE_ENABLE))

/**
  * @brief  Check the validity of the deadtime.
  * @param  deadtime  The deadtime to check.
  * @retval SET (deadtime is valid) or RESET (deadtime is invalid).
  */
#define IS_TIM_DEADTIME(deadtime) ((deadtime) <= 0xFFU)

/**
  * @brief  Check the validity of the lock level.
  * @param  level  The lock level to check (@ref hal_tim_lock_level_t).
  * @retval SET (lock level is valid) or RESET (lock level is invalid).
  */
#define IS_TIM_LOCK_LEVEL(level) (((level) == HAL_TIM_LOCK_OFF)   \
                                  ||((level) == HAL_TIM_LOCK_1)   \
                                  ||((level) == HAL_TIM_LOCK_2)   \
                                  ||((level) == HAL_TIM_LOCK_3))

/**
  * @brief  Check the validity of the commutation source.
  * @param  src  The commutation source to check (@ref hal_tim_commutation_src_t).
  * @retval SET (commutation source is valid) or RESET (commutation source is invalid).
  */
#define IS_TIM_COMMUTATION_SRC(src) \
  (((src) == HAL_TIM_COMMUTATION_SOFTWARE) \
   || ((src) == HAL_TIM_COMMUTATION_SOFTWARE_AND_TRIGGER))

/**
  * @brief  Check the validity of the DMA request source for the capture/compare channel.
  * @param  src  The DMA request source to check (@ref hal_tim_cc_dmareq_src_t).
  * @retval SET (DMA request source is valid) or RESET (DMA request source is invalid).
  */
#define IS_TIM_CC_DMAREQ_SRC(src) \
  (((src) == HAL_TIM_CC_DMAREQ_CC) \
   || ((src) == HAL_TIM_CC_DMAREQ_UPD))

/**
  * @brief  Check the validity of the software event.
  * @param  instance  The TIM instance to check.
  * @param  event_id  The software event to check (@ref hal_tim_sw_event_id_t).
  * @retval SET (software event is valid) or RESET (software event is invalid).
  */
#define IS_TIM_SW_EVENT_ID(instance, event_id) \
  (((event_id) == HAL_TIM_SW_EVENT_UPD) \
   || (((event_id) == HAL_TIM_SW_EVENT_CC1)  && IS_TIM_CC1_INSTANCE(instance))               \
   || (((event_id) == HAL_TIM_SW_EVENT_CC2)  && IS_TIM_CC2_INSTANCE(instance))               \
   || (((event_id) == HAL_TIM_SW_EVENT_CC3)  && IS_TIM_CC3_INSTANCE(instance))               \
   || (((event_id) == HAL_TIM_SW_EVENT_CC4)  && IS_TIM_CC4_INSTANCE(instance))               \
   || (((event_id) == HAL_TIM_SW_EVENT_COM)  && IS_TIM_COMMUTATION_EVENT_INSTANCE(instance)) \
   || (((event_id) == HAL_TIM_SW_EVENT_TRGI) && IS_TIM_SLAVE_INSTANCE(instance))             \
   || (((event_id) == HAL_TIM_SW_EVENT_BRK)  && IS_TIM_BREAK_INSTANCE(instance))             \
   || (((event_id) == HAL_TIM_SW_EVENT_BRK2) && IS_TIM_BKIN2_INSTANCE(instance)))

/**
  *  @}
  */

