MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
/* Private functions --------------------------------------------------------*/
/** @defgroup TIM_Private_Functions TIM Private Functions
  *  @{
  */

/**
  * @brief  Set the clock source of the timer's time-base unit.
  * @param  p_tim      Pointer to the handle of the TIM instance.
  * @param  p_clk_sel  Pointer to the clock selection.
  */
__STATIC_INLINE void TIM_SetClockSource(tim_t *p_tim,
                                        const hal_tim_clock_sel_t *p_clk_sel)
{
  const hal_tim_clk_src_t clock_source = p_clk_sel->clock_source;
  const hal_tim_trig_sel_t trigger = p_clk_sel->trigger;

  switch (clock_source)
  {
    case HAL_TIM_CLK_INTERNAL:
    {
      if (IS_TIM_SLAVE_INSTANCE(p_tim))
      {
        /* Disable the slave mode controller */
        LL_TIM_SetClockSource(p_tim, (uint32_t)clock_source);
      }
      break;
    }

    case HAL_TIM_CLK_EXTERNAL_MODE1:
    {
      ASSERT_DBG_PARAM(IS_TIM_EXTERNAL_CLOCK_MODE1_INSTANCE(p_tim));
      ASSERT_DBG_PARAM(IS_TIM_TRIG_SEL(p_tim, trigger));

      LL_TIM_SetClockSource(p_tim, (uint32_t)clock_source);
      /* Set the external trigger that is used as clock source */
      LL_TIM_SetTriggerInput(p_tim, (uint32_t)trigger);
      break;
    }

    case HAL_TIM_CLK_EXTERNAL_MODE2:
    {
      ASSERT_DBG_PARAM(IS_TIM_EXTERNAL_CLOCK_MODE2_INSTANCE(p_tim));

      LL_TIM_SetClockSource(p_tim, (uint32_t)clock_source);

      break;
    }

    default:
      /*
        HAL_TIM_CLK_ENCODER_X1_TI1:
        HAL_TIM_CLK_ENCODER_X1_TI2:
        HAL_TIM_CLK_ENCODER_X2_TI1:
        HAL_TIM_CLK_ENCODER_X2_TI2:
        HAL_TIM_CLK_ENCODER_X4_TI12:
        HAL_TIM_CLK_ENCODER_DEBOUNCER_X2_TI1:
        HAL_TIM_CLK_ENCODER_DEBOUNCER_X4_TI12:
        HAL_TIM_CLK_ENCODER_CLK_PLUS_X2:
        HAL_TIM_CLK_ENCODER_CLK_PLUS_X1:
        HAL_TIM_CLK_ENCODER_DIR_CLK_X2:
        HAL_TIM_CLK_ENCODER_DIR_CLK_X1_TI12:
      */
    {
      ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));

      LL_TIM_SetClockSource(p_tim, (uint32_t)clock_source);

      break;
    }
  }
}

/**
  * @brief  Get the clock source of the timer's time-base unit.
  * @param  p_tim      Pointer to the handle of the TIM instance.
  * @param  p_clk_sel  Pointer to the clock selection.
  */
__STATIC_INLINE void TIM_GetClockSource(const tim_t *p_tim,
                                        hal_tim_clock_sel_t *p_clk_sel)
{
  hal_tim_clk_src_t clk_src = (hal_tim_clk_src_t)LL_TIM_GetClockSource(p_tim);

  p_clk_sel->clock_source = clk_src;

  if (clk_src == HAL_TIM_CLK_EXTERNAL_MODE1)
  {
    p_clk_sel->trigger = (hal_tim_trig_sel_t)LL_TIM_GetTriggerInput(p_tim);
  }
}

/**
  * @brief  Set a channel source.
  * @param  p_tim        Pointer to the handle of the TIM instance.
  * @param  channel      Channel to configure.
  * @param  channel_src  Source of the channel.
  * @note   This function calls LL_TIM_IC_SetSource(), which completely rewrites the content
  *         of the TISEL register. Hence, the TISEL register is first read and modified
  *         with the new source for the channel.
  */
__STATIC_INLINE void TIM_SetRemap(tim_t *p_tim,
                                  hal_tim_channel_t channel,
                                  hal_tim_channel_src_t channel_src)
{
  uint32_t tisel = LL_TIM_READ_REG(p_tim, TISEL);
  tisel &= ~(MASK_TISEL((uint32_t)channel));
  tisel |= (uint32_t)channel_src;

  LL_TIM_IC_SetSource(p_tim, tisel);
}

/**
  * @brief  Start the timer in interrupt mode.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  interrupts  Selection of the TIM interrupts (subset of @ref TIM_Optional_Interruptions).
  * @note   This function is the core of @ref HAL_TIM_Start_IT().
  *         and @ref HAL_TIM_Start_IT_Opt().
  * @retval HAL_OK
  */
static hal_status_t TIM_Start_IT_Opt(hal_tim_handle_t *htim,
                                     uint32_t interrupts)
{
  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Enable interrupts */
  LL_TIM_EnableIT(p_tim, interrupts);

  /* Enable TIMx counter except in trigger and 'combined reset + trigger modes'
     where enable is automatically done with trigger */
  uint32_t slave_mode = LL_TIM_GetSlaveMode(p_tim);

  if (!(IS_TIM_SLAVE_INSTANCE(p_tim) && IS_TIM_SLAVE_MODE_ENABLING_COUNTER(slave_mode)))
  {
    LL_TIM_EnableCounter(p_tim);
  }

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)

/**
  * @brief  Get the channel associated to a DMA channel.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  hdma  Pointer to the handle of the DMA instance.
  * @retval hal_tim_channel_t  The channel associated to the DMA channel.
  */
__STATIC_INLINE hal_tim_channel_t TIM_GetCCxDMAHandler(hal_tim_handle_t *htim, hal_dma_handle_t *hdma)
{
  hal_tim_channel_t channel;

  if (hdma == htim->hdma[HAL_TIM_DMA_ID_CC1])
  {
    channel = HAL_TIM_CHANNEL_1;
  }
  else if (hdma == htim->hdma[HAL_TIM_DMA_ID_CC2])
  {
    channel = HAL_TIM_CHANNEL_2;
  }
  else if (hdma == htim->hdma[HAL_TIM_DMA_ID_CC3])
  {
    channel = HAL_TIM_CHANNEL_3;
  }
  else
  {
    channel = HAL_TIM_CHANNEL_4;
  }

  return channel;
}

/**
  * @brief  DMA transfer error callback.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMAErrorCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->error_callback(htim);
#else
  HAL_TIM_ErrorCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA transfer stopped callback when triggered by an update event (UDE),
  *         a commutation event (COMDE), a trigger event (TDE), or when using
  *         TIM DMA Burst from any burst source.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMAStopCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->stop_callback(htim);
#else
  HAL_TIM_StopCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA transfer stopped callback when triggered by a timer capture/compare event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMAChannelStopCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_tim_channel_t channel = TIM_GetCCxDMAHandler(htim, hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->channel_stop_callback(htim, channel);
#else
  HAL_TIM_ChannelStopCallback(htim, channel);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data half transfer complete callback when triggered by a timer update event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMAUpdateHalfCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->update_half_cplt_callback(htim);
#else
  HAL_TIM_UpdateHalfCpltCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback when triggered by a timer update event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMAUpdateCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->update_callback(htim);
#else
  HAL_TIM_UpdateCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data half transfer complete callback when triggered by a timer compare match event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACompareMatchHalfCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_tim_channel_t channel = TIM_GetCCxDMAHandler(htim, hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->compare_match_half_cplt_callback(htim, channel);
#else
  HAL_TIM_CompareMatchHalfCpltCallback(htim, channel);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback when triggered by a timer compare match event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACompareMatchCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_tim_channel_t channel = TIM_GetCCxDMAHandler(htim, hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->compare_match_callback(htim, channel);
#else
  HAL_TIM_CompareMatchCallback(htim, channel);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data half transfer complete callback when triggered by a timer capture event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACaptureHalfCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_tim_channel_t channel = TIM_GetCCxDMAHandler(htim, hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->input_capture_half_cplt_callback(htim, channel);
#else
  HAL_TIM_InputCaptureHalfCpltCallback(htim, channel);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback when triggered by a timer capture event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACaptureCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

  /* Identify the channel */
  hal_tim_channel_t channel = TIM_GetCCxDMAHandler(htim, hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->input_capture_callback(htim, channel);
#else
  HAL_TIM_InputCaptureCallback(htim, channel);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data half transfer complete callback when triggered by a timer trigger event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMATriggerHalfCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->trigger_half_cplt_callback(htim);
#else
  HAL_TIM_TriggerHalfCpltCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback when triggered by a timer trigger event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMATriggerCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->trigger_callback(htim);
#else
  HAL_TIM_TriggerCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data half transfer complete callback when triggered by a timer commutation event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACommutationHalfCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->commutation_half_cplt_callback(htim);
#else
  HAL_TIM_CommutationHalfCpltCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA data transfer complete callback when triggered by a timer commutation event.
  * @param  hdma  Pointer to the DMA handle.
  */
static void TIM_DMACommutationCpltCallback(hal_dma_handle_t *hdma)
{
  hal_tim_handle_t *htim = TIM_GET_HDMA_PARENT(hdma);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  htim->commutation_callback(htim);
#else
  HAL_TIM_CommutationCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
}

/**
  * @brief  Get the DMA index from the DMA request.
  * @param  dma_req  DMA request.
  * @retval hal_tim_dma_index_t  DMA index.
  */
__STATIC_INLINE hal_tim_dma_index_t TIM_DMARequestToDMAIndex(uint32_t dma_req)
{
  hal_tim_dma_index_t dma_index = HAL_TIM_DMA_ID_UPD;

  switch (dma_req)
  {
    case LL_TIM_DIER_CC1DE:
    {
      dma_index = HAL_TIM_DMA_ID_CC1;
      break;
    }
    case LL_TIM_DIER_CC2DE:
    {
      dma_index = HAL_TIM_DMA_ID_CC2;
      break;
    }
    case LL_TIM_DIER_CC3DE:
    {
      dma_index = HAL_TIM_DMA_ID_CC3;
      break;
    }
    case LL_TIM_DIER_CC4DE:
    {
      dma_index = HAL_TIM_DMA_ID_CC4;
      break;
    }
    case LL_TIM_DIER_COMDE:
    {
      dma_index = HAL_TIM_DMA_ID_COM;
      break;
    }
    case LL_TIM_DIER_TDE:
    {
      dma_index = HAL_TIM_DMA_ID_TRGI;
      break;
    }
    default:
    {
      /* LL_TIM_DIER_UDE:
           dma_index initialized with HAL_TIM_DMA_ID_UPD */
      break;
    }
  }

