MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  return dma_index;
}

/**
  * @brief  Configure a DMA handle for a DMA transfer.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  dma_config  Pointer to the DMA configuration.
  * @param  interrupts  Selection of the DMA interrupts.
  * @note   This function is called by @ref TIM_Start_DMA_Opt(),
  *         @ref TIM_OC_StartChannel_DMA_Opt() and @ref TIM_IC_StartChannel_DMA_Opt().
  * @retval hal_dma_handle_t  Pointer to the DMA handle.
  */
__STATIC_INLINE hal_dma_handle_t *TIM_Config_DMA(hal_tim_handle_t *htim, tim_dma_config_t *dma_config,
                                                 uint32_t interrupts)
{
  hal_dma_handle_t *hdma = htim->hdma[dma_config->dma_idx];

  ASSERT_DBG_PARAM((hdma != NULL));
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1) && defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_TIM_DMA_VALID_SILENT_MODE(htim, dma_config->dma_idx, interrupts));
#else
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(interrupts);
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Set DMA channel callback function pointers */
  hdma->p_xfer_halfcplt_cb = dma_config->halfcplt_cb;
  hdma->p_xfer_cplt_cb = dma_config->cplt_cb;
  hdma->p_xfer_error_cb = TIM_DMAErrorCallback;

  LL_TIM_EnableDMAReq(TIM_INSTANCE(htim), dma_config->dma_req);

  return hdma;
}

/**
  * @brief  Start the timer in DMA mode with optional DMA interrupts.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  p_data      Pointer to the data buffer.
  * @param  size_byte   Data buffer size (in bytes).
  * @param  interrupts  Selection of the DMA interrupts.
  * @note   This function is the core of @ref HAL_TIM_Start_DMA()
  *         and @ref HAL_TIM_Start_DMA_Opt().
  * @retval HAL_OK
  * @retval HAL_ERROR  Failed to start the DMA transfer.
  */
static hal_status_t TIM_Start_DMA_Opt(hal_tim_handle_t *htim,
                                      const uint8_t *p_data,
                                      uint32_t size_byte,
                                      uint32_t interrupts)
{
  tim_t *p_tim = TIM_INSTANCE(htim);
  uint32_t is_slave_instance = (IS_TIM_SLAVE_INSTANCE(p_tim)) ? 1U : 0U;
  uint32_t is_slave_mode_enabled = (IS_TIM_SLAVE_MODE_ENABLED(p_tim)) ? 1U : 0U;
  uint32_t is_preload_enabled = LL_TIM_CC_IsEnabledPreload(p_tim);
  hal_dma_handle_t *hdma = NULL;
  /* index 0: update dma request
     index 1: commutation dma request
     index 2: trigger dma request */
  static const tim_dma_config_t dma_configurations[] =
  {
    {LL_TIM_DIER_UDE, TIM_DMAUpdateHalfCpltCallback, TIM_DMAUpdateCpltCallback, HAL_TIM_DMA_ID_UPD},
    {LL_TIM_DIER_COMDE, TIM_DMACommutationHalfCpltCallback, TIM_DMACommutationCpltCallback, HAL_TIM_DMA_ID_COM},
    {LL_TIM_DIER_TDE, TIM_DMATriggerHalfCpltCallback, TIM_DMATriggerCpltCallback, HAL_TIM_DMA_ID_TRGI}
  };
  uint32_t dma_config_idx = UPDATE_DMA_REQ_IDX; /* default update dma request */

  if (IS_TIM_COMMUTATION_EVENT_INSTANCE(p_tim) && (is_preload_enabled != 0U))
  {
    dma_config_idx = COMMUTATION_DMA_REQ_IDX;
  }
  else if ((is_slave_instance != 0U) && (is_slave_mode_enabled != 0U))
  {
    dma_config_idx = TRIGGER_DMA_REQ_IDX;
  }
  else
  {
    /* Nothing to do, already at UPDATE_DMA_REQ_IDX */
  }

  tim_dma_config_t dma_config = dma_configurations[dma_config_idx];
  hdma = TIM_Config_DMA(htim, &dma_config, interrupts);

  /* Start DMA transfer in IT mode: from Memory to ARR register */
  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                     (uint32_t)p_data,
                                     (uint32_t)((uint32_t *)(&p_tim->ARR)),
                                     size_byte, interrupts) != HAL_OK)
  {
#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
    htim->last_error_codes |= HAL_TIM_ERROR_DMA;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */
    htim->global_state = HAL_TIM_STATE_IDLE;

    return HAL_ERROR;
  }

  /* Enable TIMx counter except in 'trigger' and 'combined reset + trigger modes'
     where enable is automatically done with trigger */
  uint32_t slave_mode = LL_TIM_GetSlaveMode(p_tim);

  if ((is_slave_instance != 0U) && IS_TIM_SLAVE_MODE_ENABLING_COUNTER(slave_mode))
  {
    return HAL_OK;
  }

  LL_TIM_EnableCounter(p_tim);

  return HAL_OK;
}

/**
  * @brief  Start a timer's Output Channel in DMA mode with optional DMA interrupts.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  channel     Output channel of interest.
  * @param  p_data      Pointer to the data buffer.
  * @param  size_byte   Data buffer size (in bytes).
  * @param  interrupts  Selection of the DMA interrupts.
  * @note   This function is the core of @ref HAL_TIM_OC_StartChannel_DMA()
  *         and @ref HAL_TIM_OC_StartChannel_DMA_Opt().
  * @retval HAL_OK
  * @retval HAL_ERROR  Failed to start the DMA transfer.
  */
__STATIC_INLINE hal_status_t TIM_OC_StartChannel_DMA_Opt(hal_tim_handle_t *htim,
                                                         hal_tim_channel_t channel,
                                                         const uint8_t *p_data,
                                                         uint32_t size_byte,
                                                         uint32_t interrupts)
{
  tim_t *p_tim = TIM_INSTANCE(htim);
  hal_dma_handle_t *hdma = NULL;
  tim_dma_config_t dma_config = {0};
  uint32_t channel_idx = (uint32_t)channel % (uint32_t)HAL_TIM_CHANNEL_1N;

  /* Check the validity of channel_idx value */
  if (channel_idx >= NB_TIM_CC_DMA_CONFIG)
  {
    return HAL_ERROR;
  }

  tim_cc_dma_config_t cc_dma_config = dma_channel_info[channel_idx];

  dma_config.dma_req = cc_dma_config.dma_req;
  dma_config.halfcplt_cb = TIM_DMACompareMatchHalfCpltCallback;
  dma_config.cplt_cb = TIM_DMACompareMatchCpltCallback;
  dma_config.dma_idx = cc_dma_config.dma_idx;

  hdma = TIM_Config_DMA(htim, &dma_config, interrupts);

  uint32_t dest_addr = (uint32_t)(&p_tim->CCR1) + LL_TIM_OFFSET_TAB_CCRx[channel_idx];

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                     (uint32_t)p_data,
                                     dest_addr,
                                     size_byte,
                                     interrupts) != HAL_OK)
  {
#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
    htim->last_error_codes |= HAL_TIM_ERROR_DMA;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */
    htim->channel_states[channel] = HAL_TIM_OC_CHANNEL_STATE_IDLE;

    return HAL_ERROR;
  }

