MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    LL_TIM_EnableAllOutputs(p_tim);
  }

  return HAL_OK;
}

/**
  * @brief  Start a timer's Input Channel in DMA mode with optional DMA interrupts.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  channel     Input channel of interest.
  * @param  p_data      Pointer to the data buffer.
  * @param  size_byte   Data buffer size (in bytes).
  * @param  interrupts  Selection of the DMA interrupts.
  * @note   This function is the core of @ref HAL_TIM_IC_StartChannel_DMA()
  *         and @ref HAL_TIM_IC_StartChannel_DMA_Opt().
  * @retval HAL_OK
  * @retval HAL_ERROR  Failed to start the DMA transfer.
  */
__STATIC_INLINE hal_status_t TIM_IC_StartChannel_DMA_Opt(hal_tim_handle_t *htim,
                                                         hal_tim_channel_t channel,
                                                         uint8_t *p_data,
                                                         uint32_t size_byte,
                                                         uint32_t interrupts)
{
  tim_t *p_tim = TIM_INSTANCE(htim);
  hal_dma_handle_t *hdma = NULL;
  tim_dma_config_t dma_config = {0};

  /* Check the validity of channel value */
  if ((uint32_t)channel >= NB_TIM_CC_DMA_CONFIG)
  {
    return HAL_ERROR;
  }

  tim_cc_dma_config_t cc_dma_config = dma_channel_info[channel];

  dma_config.dma_req = cc_dma_config.dma_req;
  dma_config.halfcplt_cb = TIM_DMACaptureHalfCpltCallback;
  dma_config.cplt_cb = TIM_DMACaptureCpltCallback;
  dma_config.dma_idx = cc_dma_config.dma_idx;

  hdma = TIM_Config_DMA(htim, &dma_config, interrupts);

  uint32_t src_addr = (uint32_t)(&p_tim->CCR1) + LL_TIM_OFFSET_TAB_CCRx[channel];

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma,
                                     src_addr,
                                     (uint32_t)p_data,
                                     size_byte,
                                     interrupts) != HAL_OK)
  {
#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
    htim->last_error_codes |= HAL_TIM_ERROR_DMA;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */
    htim->channel_states[channel] = HAL_TIM_IC_CHANNEL_STATE_IDLE;

    return HAL_ERROR;
  }

  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  return HAL_OK;
}

/**
  * @brief  Abort any ongoing DMA channel transfer.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  dma_idx  DMA handle index
  * @param  active_silent_mode  Status of the silent mode.
  */
__STATIC_INLINE void TIM_Abort_DMA(hal_tim_handle_t *htim,
                                   hal_tim_dma_index_t dma_idx,
                                   uint32_t active_silent_mode)
{
  hal_dma_cb_t xfer_abort_cb;
  hal_dma_handle_t *hdma = htim->hdma[dma_idx];

  ASSERT_DBG_PARAM((hdma != NULL));

  if (active_silent_mode == HAL_TIM_ACTIVE_SILENT)
  {
    (void)HAL_DMA_Abort(hdma);
    return;
  }

  /* DMA stop callback function pointer depends on the DMA request source */
  if ((dma_idx == HAL_TIM_DMA_ID_UPD) || (dma_idx == HAL_TIM_DMA_ID_COM) || (dma_idx == HAL_TIM_DMA_ID_TRGI))
  {
    xfer_abort_cb = TIM_DMAStopCallback;
  }
  else
  {
    xfer_abort_cb = TIM_DMAChannelStopCallback;
  }

  hdma->p_xfer_abort_cb = xfer_abort_cb;
  if (HAL_DMA_Abort_IT(hdma) != HAL_OK)
  {
    xfer_abort_cb(hdma);
  }
}

/**
  * @brief  Stop DMA transfer and disable the DMA request.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  p_tim    Pointer to the TIM instance.
  * @param  channel  Channel of interest. \n
  *                  For an input channel, the channel parameter can take one of the value: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4 \n
  *                  For an output channel, the channel parameter can take one of the value: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *                  @arg @ref HAL_TIM_CHANNEL_1N
  *                  @arg @ref HAL_TIM_CHANNEL_2N
  *                  @arg @ref HAL_TIM_CHANNEL_3N
  *                  @arg @ref HAL_TIM_CHANNEL_4N
  * @param  active_silent_mode  Status of the silent mode.
  * @note   The validity of the channel is checked in the caller.
  * @retval HAL_OK
  * @retval HAL_ERROR  Invalid channel for DMA.
  */
__STATIC_INLINE hal_status_t TIM_StopChannel_DMA(hal_tim_handle_t *htim,
                                                 tim_t *p_tim,
                                                 hal_tim_channel_t channel,
                                                 uint32_t active_silent_mode)
{
  uint32_t channel_idx = (uint32_t)channel % (uint32_t)HAL_TIM_CHANNEL_1N;

  /* Check the validity of channel_idx value */
  if (channel_idx >= NB_TIM_CC_DMA_CONFIG)
  {
    return HAL_ERROR;
  }
  tim_cc_dma_config_t cc_dma_config = dma_channel_info[channel_idx];

  TIM_Abort_DMA(htim,
                cc_dma_config.dma_idx,
                active_silent_mode);

  LL_TIM_DisableDMAReq(p_tim, cc_dma_config.dma_req);

  return HAL_OK;
}

#endif /* USE_HAL_TIM_DMA */

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
/**
  * @brief  Callbacks initialization function.
  * @param  htim  Pointer to the handle of the TIM instance.
  */
__STATIC_FORCEINLINE void TIM_InitCallbacks(hal_tim_handle_t *htim)
{
#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Error Callback */
  htim->error_callback = HAL_TIM_ErrorCallback;

  /* TIM Update DMA stop callback */
  htim->stop_callback = HAL_TIM_StopCallback;

  /* TIM capture/Compare DMA stop callback */
  htim->channel_stop_callback = HAL_TIM_ChannelStopCallback;
#endif /* USE_HAL_TIM_USER_DATA */

  /* TIM Period Elapsed Callback */
  htim->update_callback = HAL_TIM_UpdateCallback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Period Elapsed half complete Callback */
  htim->update_half_cplt_callback = HAL_TIM_UpdateHalfCpltCallback;
#endif /* USE_HAL_TIM_USER_DATA */

  /* TIM Trigger Callback */
  htim->trigger_callback = HAL_TIM_TriggerCallback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Trigger half complete Callback */
  htim->trigger_half_cplt_callback = HAL_TIM_TriggerHalfCpltCallback;
#endif /* USE_HAL_TIM_USER_DATA */

  /* TIM Input Capture Callback */
  htim->input_capture_callback = HAL_TIM_InputCaptureCallback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Input Capture half complete Callback */
  htim->input_capture_half_cplt_callback = HAL_TIM_InputCaptureHalfCpltCallback;
#endif /* USE_HAL_TIM_USER_DATA */

