MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* TIM Output Compare Delay Elapsed Callback */
  htim->compare_match_callback = HAL_TIM_CompareMatchCallback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Output Compare Delay Elapsed Callback */
  htim->compare_match_half_cplt_callback = HAL_TIM_CompareMatchHalfCpltCallback;
#endif /* USE_HAL_TIM_USER_DATA */

  /* TIM Commutation Callback */
  htim->commutation_callback = HAL_TIM_CommutationCallback;

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* TIM Commutation half complete Callback */
  htim->commutation_half_cplt_callback = HAL_TIM_CommutationHalfCpltCallback;
#endif /* USE_HAL_TIM_USER_DATA */

  /* TIM Break Callback */
  htim->break_callback = HAL_TIM_BreakCallback;

  /* TIM Break2 Callback */
  htim->break2_callback = HAL_TIM_Break2Callback;

  /* TIM Break2 Callback */
  htim->system_break_callback = HAL_TIM_SystemBreakCallback;

  /* TIM Software Break Callback */
  htim->software_break_callback = HAL_TIM_SoftwareBreakCallback;

  /* TIM Encoder Index Callback */
  htim->encoder_index_callback = HAL_TIM_EncoderIndexCallback;

  /* TIM Direction Change Callback */
  htim->direction_change_callback = HAL_TIM_DirectionChangeCallback;

  /* TIM Index Error Callback */
  htim->index_error_callback = HAL_TIM_IndexErrorCallback;

  /* TIM Transition Error Callback */
  htim->transition_error_callback = HAL_TIM_TransitionErrorCallback;
}
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

#if defined(USE_HAL_TIM_CLK_ENABLE_MODEL) && (USE_HAL_TIM_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
/**
  * @brief  Clock enabling for a particular instance.
  * @param  instance  HAL TIM instance
  */
__STATIC_FORCEINLINE void TIM_EnableClock(hal_tim_t instance)
{
  switch (instance)
  {
    case HAL_TIM1:
      HAL_RCC_TIM1_EnableClock();
      break;
    case HAL_TIM2:
      HAL_RCC_TIM2_EnableClock();
      break;
#if defined(TIM3)
    case HAL_TIM3:
      HAL_RCC_TIM3_EnableClock();
      break;
#endif /* TIM3 */
#if defined(TIM4)
    case HAL_TIM4:
      HAL_RCC_TIM4_EnableClock();
      break;
#endif /* TIM4 */
#if defined(TIM5)
    case HAL_TIM5:
      HAL_RCC_TIM5_EnableClock();
      break;
#endif /* TIM5 */
    case HAL_TIM6:
      HAL_RCC_TIM6_EnableClock();
      break;
    case HAL_TIM7:
      HAL_RCC_TIM7_EnableClock();
      break;
    case HAL_TIM8:
      HAL_RCC_TIM8_EnableClock();
      break;
    case HAL_TIM12:
      HAL_RCC_TIM12_EnableClock();
      break;
    case HAL_TIM15:
      HAL_RCC_TIM15_EnableClock();
      break;
#if defined(TIM16)
    case HAL_TIM16:
      HAL_RCC_TIM16_EnableClock();
      break;
    case HAL_TIM17:
      HAL_RCC_TIM17_EnableClock();
      break;
#endif /* TIM16 */
    default:
      break;
  }
}
#endif /* USE_HAL_TIM_CLK_ENABLE_MODEL */

/**
  *  @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup TIM_Exported_Functions
  *  @{
  */

/** @addtogroup TIM_Exported_Functions_Group1
  *  @brief This group gathers functions for the initialization/deinitialization of
  *         a timer instance.
  *  @{
  */

/**
  * @brief  Initialization function.
  *         Initialize the TIM handle and associate an instance.
  * @param  htim      Pointer to the handler of the TIM instance.
  * @param  instance  One of the value of the @ref hal_tim_t enumeration.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_Init(hal_tim_handle_t *htim, hal_tim_t instance)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM(IS_TIM_INSTANCE((tim_t *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (htim == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Register the TIM instance */
  htim->instance = instance;

#if defined(USE_HAL_TIM_CLK_ENABLE_MODEL) && (USE_HAL_TIM_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  TIM_EnableClock(instance);
#endif /* USE_HAL_TIM_CLK_ENABLE_MODEL */

#if defined (USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
  TIM_InitCallbacks(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

  /* Init the handle internal parameters */

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  htim->dmaburst_source = TIM_DMABURST_NONE;
#endif /* USE_HAL_TIM_DMA */

#if defined (USE_HAL_TIM_USER_DATA) && (USE_HAL_TIM_USER_DATA == 1)
  htim->p_user_data = NULL;
#endif /* USE_HAL_TIM_USER_DATA */

  /* Reset channels state */
  for (uint32_t i = 0; i < HAL_TIM_CHANNELS; ++i)
  {
    htim->channel_states[i] = HAL_TIM_CHANNEL_STATE_RESET;
  }

#if defined(USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
  htim->last_error_codes = HAL_TIM_ERROR_NONE;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */

  htim->global_state = HAL_TIM_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief   De-initialize the TIM instance handle.
  * @param   htim  Pointer to the handler of the TIM instance.
  * @note    Stop all current operations and reset states: \n
  *          @arg stop the counter
  *          @arg disable interrupts / DMA transfers
  *          @arg clear status flags
  *          @arg set channels' states to RESET
  *          @arg set global state to RESET
  * @note    HAL_TIM_DeInit does not reset all TIM registers.
  *          The Application must call RCC API to force the reset of all TIM registers.
  * @warning If a DMA transfer is ongoing, HAL_TIM_DeInit must be performed before
  *          calling HAL_DMA_DeInit to avoid asserts.
  */
void HAL_TIM_DeInit(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_INSTANCE(p_tim));

#if defined (USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  /* Abort potential DMA in progress */
  uint32_t dma_req = LL_TIM_READ_REG(p_tim, DIER) & TIM_DMAREQ_REQUESTS_MASK;
#endif /* USE_HAL_TIM_DMA */

  LL_TIM_DisableCounter(p_tim);

  LL_TIM_WRITE_REG(p_tim, DIER, 0U);

  LL_TIM_WRITE_REG(p_tim, SR, 0U);

#if defined (USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
  while (dma_req != 0U)
  {
    uint32_t active_dma_req = dma_req & (~dma_req + 1U);
    hal_tim_dma_index_t dma_idx = TIM_DMARequestToDMAIndex(active_dma_req);
    hal_dma_handle_t *hdma = htim->hdma[(uint32_t)dma_idx];

    if (hdma != NULL)
    {
      (void)HAL_DMA_Abort(hdma);
    }

    dma_req &= ~active_dma_req;
  }
#endif /* USE_HAL_TIM_DMA */

  /* Reset channels state */
  for (uint32_t i = 0; i < HAL_TIM_CHANNELS; ++i)
  {
    uint32_t ll_channel = ll_tim_channels[i];
    LL_TIM_CC_DisableChannel(p_tim, ll_channel);
    htim->channel_states[i] = HAL_TIM_CHANNEL_STATE_RESET;
  }

  htim->global_state = HAL_TIM_STATE_RESET;
}


#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Link a DMA handle to a DMA request.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param dma_idx  Index of the DMA request.
  * @param hdma     Pointer to a handle of the DMA instance.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetDMA(hal_tim_handle_t *htim,
                            hal_tim_dma_index_t dma_idx,
                            hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((hdma != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_INIT | HAL_TIM_STATE_IDLE));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(TIM_INSTANCE(htim)));

