MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  ASSERT_DBG_PARAM(IS_TIM_DMA_INDEX(dma_idx));

  /* link the DMA handle to the TIM handle */
  htim->hdma[(uint32_t)dma_idx] = hdma;
  hdma->p_parent = htim;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  *  @}
  */

/** @addtogroup TIM_Exported_Functions_Group2
  *  @{
  */

/**
  * @brief  Get the timer state.
  * @param  htim  Pointer to the handler of the TIM instance.
  * @retval hal_tim_state_t  HAL TIM state.
  */
hal_tim_state_t HAL_TIM_GetState(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));
  return htim->global_state;
}

/**
  * @brief  Get the state of a channel.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Channel of interest
  * @retval hal_tim_channel_state_t  TIM channel state
  */
hal_tim_channel_state_t HAL_TIM_GetChannelState(const hal_tim_handle_t *htim,
                                                hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM(IS_TIM_CHANNEL(channel));
  return htim->channel_states[channel];
}

#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the HAL TIM Last Errors.
  * @param  htim  Pointer to the handler of the TIM instance.
  * @retval uint32_t  last error code. \n
  *                   Values can be: \n
  *                   @arg @ref HAL_TIM_ERROR_NONE
  *                   @arg @ref HAL_TIM_ERROR_DMA
  */
uint32_t HAL_TIM_GetLastErrorCodes(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));
  return htim->last_error_codes;
}

#endif /* USE_HAL_TIM_GET_LAST_ERRORS */

/** @brief  Return the peripheral clock frequency for TIM.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  Frequency in Hz.
  *                   0 if the source clock of the TIM is not configured or not ready.
  */
uint32_t HAL_TIM_GetClockFreq(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_INIT | HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return HAL_RCC_TIM_GetKernelClkFreq(TIM_INSTANCE(htim));
}

/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group3
  *  @{
  */

/**
  * @brief  Configure the timer's time-base unit.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to the time-base unit configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetConfig(hal_tim_handle_t *htim,
                               const hal_tim_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_INIT | HAL_TIM_STATE_IDLE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check parameters that are common to all instances */
  ASSERT_DBG_PARAM(IS_TIM_PRESCALER(p_config->prescaler));
  ASSERT_DBG_PARAM(IS_TIM_PERIOD(p_tim, p_config->period));
  ASSERT_DBG_PARAM(IS_TIM_CLK_SRC(p_config->clock_sel.clock_source));

  /* Apply the configuration */

  if (IS_TIM_REPETITION_COUNTER_INSTANCE(p_tim))
  {
    ASSERT_DBG_PARAM(IS_TIM_REPETITION_COUNTER(p_tim, p_config->repetition_counter));
    LL_TIM_SetRepetitionCounter(p_tim, p_config->repetition_counter);
  }

  if (IS_TIM_COUNTER_MODE_SELECT_INSTANCE(p_tim))
  {
    ASSERT_DBG_PARAM(IS_TIM_COUNTER_MODE(p_config->counter_mode));
    LL_TIM_SetCounterMode(p_tim, (uint32_t)p_config->counter_mode);
  }

  LL_TIM_SetAutoReload(p_tim, p_config->period);

  LL_TIM_SetPrescaler(p_tim, p_config->prescaler);

  TIM_SetClockSource(p_tim, &(p_config->clock_sel));

  uint32_t update_source = LL_TIM_GetUpdateSource(p_tim);

  if (update_source == LL_TIM_UPDATESOURCE_REGULAR)
  {
    /* Disable update event (UEV) with update generation (UG)
      by changing update request source (URS) to avoid update flag (UIF) */
    LL_TIM_SetUpdateSource(p_tim, LL_TIM_UPDATESOURCE_COUNTER);

    /* Generate an update event to reload the prescaler
      and the repetition counter (if applicable) values immediately */
    LL_TIM_GenerateEvent_UPDATE(p_tim);

    /* Put back the update event source */
    LL_TIM_SetUpdateSource(p_tim, LL_TIM_UPDATESOURCE_REGULAR);
  }
  else
  {
    /* Generate an update event to reload the prescaler
      and the repetition counter (if applicable) values immediately */
    LL_TIM_GenerateEvent_UPDATE(p_tim);
  }

  /* Reset channels (needed only if in IDLE state but done by default) */
  for (uint32_t i = 0; i < HAL_TIM_CHANNELS; ++i)
  {
    htim->channel_states[i] = HAL_TIM_CHANNEL_STATE_RESET;
  }

  htim->global_state = HAL_TIM_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the the timer's time-base unit.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a time-base unit configuration structure to fill.
  */
void HAL_TIM_GetConfig(const hal_tim_handle_t *htim,
                       hal_tim_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  if (IS_TIM_REPETITION_COUNTER_INSTANCE(p_tim))
  {
    p_config->repetition_counter = LL_TIM_GetRepetitionCounter(p_tim);
  }

  if (IS_TIM_COUNTER_MODE_SELECT_INSTANCE(p_tim))
  {
    p_config->counter_mode = (hal_tim_counter_mode_t)LL_TIM_GetCounterMode(p_tim);
  }

  p_config->period = LL_TIM_GetAutoReload(p_tim);

  p_config->prescaler = LL_TIM_GetPrescaler(p_tim);

  /* Get the clock source (and trigger input in case of external clock signal) */
  TIM_GetClockSource(p_tim, &(p_config->clock_sel));
}

/**
  * @brief  Set the period of the timer's time-base unit.
  * @param  htim    Pointer to the handle of the TIM instance.
  * @param  period  Period for the time base unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetPeriod(hal_tim_handle_t *htim,
                               uint32_t period)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_PERIOD_WITHOUT_DITHERING(p_tim, period));

