MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_SetAutoReload(p_tim, period);

  return HAL_OK;
}

/**
  * @brief  Get the period of the timer's time-base unit.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  Period of the timer's time-base unit.
  */
uint32_t HAL_TIM_GetPeriod(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return LL_TIM_GetAutoReload(TIM_INSTANCE(htim));
}

/**
  * @brief   Set the period and dithering pattern of the timer's
  *          time-base unit.
  * @param   htim    Pointer to the handle of the TIM instance.
  * @param   period  Period for the time base unit(integer part).
  * @param   period_dithering_pattern  Dithering pattern for the period (period
  *          fractional part)
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_SetDitheredPeriod(hal_tim_handle_t *htim,
                                       uint32_t period,
                                       hal_tim_dithering_pattern_t period_dithering_pattern)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM(IS_TIM_DITHERING_PATTERN(period_dithering_pattern));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the period can be shifted */
  ASSERT_DBG_PARAM(IS_TIM_PERIOD_WITH_DITHERING(p_tim, period));

  /* Set in ARR the integer period and the dithering part */
  LL_TIM_SetAutoReload(p_tim, HAL_TIM_COMPUTE_DITHERED_PERIOD(period,
                                                              (uint32_t)period_dithering_pattern));

  return HAL_OK;
}

/**
  * @brief  Get the period and its dithering pattern of the timer's
  *         time-base unit.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_period  Pointer for the period for the time base unit
  *         (period's integer part).
  * @param  p_period_dithering_pattern  Dithering pattern for the period
  *         (period's fractional part)
  */
void HAL_TIM_GetDitheredPeriod(const hal_tim_handle_t *htim,
                               uint32_t *p_period,
                               hal_tim_dithering_pattern_t *p_period_dithering_pattern)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  const tim_t *p_tim = TIM_INSTANCE(htim);

  /* Get in ARR the integer period and the dithering part */
  uint32_t arr = LL_TIM_GetAutoReload(p_tim);
  *p_period = (arr & ~TIM_DITHERING_MASK) >> HAL_TIM_DITHERING_SHIFT;
  *p_period_dithering_pattern = (hal_tim_dithering_pattern_t)((uint32_t)(arr & TIM_DITHERING_MASK));
}

/**
  * @brief  Set the prescaler of the timer's time-base unit.
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  prescaler  Prescaler for the time base unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetPrescaler(hal_tim_handle_t *htim,
                                  uint32_t prescaler)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_PRESCALER(prescaler));

  LL_TIM_SetPrescaler(p_tim, prescaler);

  return HAL_OK;
}

/**
  * @brief  Get the prescaler value of the timer's time-base unit.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  Prescaler value of the timer's time-base unit.
  */
uint32_t HAL_TIM_GetPrescaler(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return LL_TIM_GetPrescaler(TIM_INSTANCE(htim));
}

/**
  * @brief  Set the counter mode of the timer's time-base unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  counter_mode  Counter mode.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetCounterMode(hal_tim_handle_t *htim,
                                    hal_tim_counter_mode_t counter_mode)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports mode selection */
  ASSERT_DBG_PARAM(IS_TIM_COUNTER_MODE_SELECT_INSTANCE(p_tim));

  /* Check counter mode validity */
  ASSERT_DBG_PARAM(IS_TIM_COUNTER_MODE(counter_mode));

  LL_TIM_SetCounterMode(p_tim, (uint32_t)counter_mode);

  return HAL_OK;
}

/**
  * @brief  Get the counter mode of the timer's time-base unit.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_counter_mode_t  Counter mode of the timer's time-base unit.
  */
hal_tim_counter_mode_t HAL_TIM_GetCounterMode(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports mode selection */
  ASSERT_DBG_PARAM(IS_TIM_COUNTER_MODE_SELECT_INSTANCE(p_tim));

  return (hal_tim_counter_mode_t)LL_TIM_GetCounterMode(p_tim);
}

/**
  * @brief  Set the DTS clock prescaler.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  dts_prescaler  The DTS clock prescaler.
  * @note   The prescaler set the division ratio between the timer kernel clock (tim_ker_ck)
  *         and the DTS sampling clock (DTS_ck).
  * @note   The DTS sampling clock is used, when supported, by the dead-time
  *         generator, the break/break2 filters and the delayed break.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetDTSPrescaler(hal_tim_handle_t *htim,
                                     hal_tim_dts_prescaler_t dts_prescaler)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports clock division */
  ASSERT_DBG_PARAM(IS_TIM_CLOCK_DIVISION_INSTANCE(p_tim));

  /* Check clock division validity */
  ASSERT_DBG_PARAM(IS_TIM_DTS_PRESCALER(dts_prescaler));

