MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_SetClockDivision(p_tim, (uint32_t)dts_prescaler);

  return HAL_OK;
}

/**
  * @brief  Get the DTS clock prescaler.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_dts_prescaler_t  DTS clock prescaler.
  */
hal_tim_dts_prescaler_t HAL_TIM_GetDTSPrescaler(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports clock division */
  ASSERT_DBG_PARAM(IS_TIM_CLOCK_DIVISION_INSTANCE(p_tim));

  return (hal_tim_dts_prescaler_t)LL_TIM_GetClockDivision(p_tim);
}

/**
  * @brief  Set the DTS2 clock prescaler.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  dts2_prescaler  The DTS2 clock prescaler.
  * @note   The prescaler sets the division ratio between the DTS sampling clock (DTS_ck)
  *         and the DTS2 sampling clock (DTS2_ck).
  * @note   The DTS2 sampling clock is used by the digital filters (tim_etr_in, tim_tix).
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetDTS2Prescaler(hal_tim_handle_t *htim,
                                      hal_tim_dts2_prescaler_t dts2_prescaler)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports clock division */
  ASSERT_DBG_PARAM(IS_TIM_CLOCK_DIVISION_INSTANCE(p_tim));

  /* Check clock division validity */
  ASSERT_DBG_PARAM(IS_TIM_DTS2_PRESCALER(dts2_prescaler));

  LL_TIM_SetClockDivision2(p_tim, (uint32_t)dts2_prescaler);

  return HAL_OK;
}

/**
  * @brief  Get the DTS2 clock prescaler.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_dts2_prescaler_t  DTS2 clock prescaler.
  */
hal_tim_dts2_prescaler_t HAL_TIM_GetDTS2Prescaler(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports clock division */
  ASSERT_DBG_PARAM(IS_TIM_CLOCK_DIVISION_INSTANCE(p_tim));

  return (hal_tim_dts2_prescaler_t)LL_TIM_GetClockDivision2(p_tim);
}

/**
  * @brief  Set the repetition counter value of the timer's time-base unit.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  repetition_counter  Value of the repetition counter.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetRepetitionCounter(hal_tim_handle_t *htim,
                                          uint32_t repetition_counter)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports repetition counter */
  ASSERT_DBG_PARAM(IS_TIM_REPETITION_COUNTER_INSTANCE(p_tim));

  /* Check repetition counter validity */
  ASSERT_DBG_PARAM(IS_TIM_REPETITION_COUNTER(p_tim, repetition_counter));

  LL_TIM_SetRepetitionCounter(p_tim, repetition_counter);

  return HAL_OK;
}

/**
  * @brief  Get the repetition counter value of the timer's time-base unit.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  Repetition counter value of the timer's time-base unit.
  */
uint32_t HAL_TIM_GetRepetitionCounter(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Ensure that the instance supports repetition counter */
  ASSERT_DBG_PARAM(IS_TIM_REPETITION_COUNTER_INSTANCE(p_tim));

  return LL_TIM_GetRepetitionCounter(p_tim);

}

/**
  * @brief  Set the clock source of the timer's time-base unit.
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  p_clk_sel  Pointer to the clock selection.
  *                    Clock selection is used to set the clock source of the
  *                    timer's time-base unit.
  *                    If the clock source is @ref HAL_TIM_CLK_EXTERNAL_MODE1 then
  *                    the external trigger that is used as clock signal is also
  *                    specified.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetClockSource(hal_tim_handle_t *htim,
                                    const hal_tim_clock_sel_t *p_clk_sel)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_clk_sel != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_clk_sel == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE));

  ASSERT_DBG_PARAM(IS_TIM_CLK_SRC(p_clk_sel->clock_source));

  TIM_SetClockSource(TIM_INSTANCE(htim), p_clk_sel);

  return HAL_OK;
}

/**
  * @brief  Get the clock source of the timer's time-base unit.
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  p_clk_sel  Pointer to the clock selection that gather 2 parameters: \n
  *                    @arg clock_source  for the clock source of the timer's time-base unit.
  *                    @arg trigger       which is meaningful only in the case where the
  *                                       clock source is @ref HAL_TIM_CLK_EXTERNAL_MODE1.
  *                                       Then, it stores the value of the external
  *                                       trigger that is used as clock signal.
  */
void HAL_TIM_GetClockSource(const hal_tim_handle_t *htim,
                            hal_tim_clock_sel_t *p_clk_sel)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_clk_sel != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

