MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  TIM_GetClockSource(TIM_INSTANCE(htim), p_clk_sel);
}

/**
  * @brief   Set Counter Register (TIMx_CNT) value at runtime.
  * @param   htim           Pointer to the handle of the TIM instance.
  * @param   counter_value  Counter register new value.
  * @warning When UIF bit remapping is enabled (see @ref HAL_TIM_EnableUpdateFlagRemap),
  *          bit 31 of the timer counter register is read-only. This can affect the
  *          counter range for a 32-bit counter TIM instance.
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_SetCounter(hal_tim_handle_t *htim,
                                uint32_t counter_value)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_COUNTER(p_tim, counter_value));

  LL_TIM_SetCounter(p_tim, counter_value);

  return HAL_OK;
}

/**
  * @brief  Get Counter Register (TIMx_CNT) value at runtime.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   When UIF bit remapping is enabled (see @ref HAL_TIM_EnableUpdateFlagRemap),
  *         bit 31 of the returned value contains a copy of the update interrupt flag (UIF).
  * @retval uint32_t  16-bit or 32-bit value of the timer counter register (TIMx_CNT).
  */
uint32_t HAL_TIM_GetCounter(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return LL_TIM_GetCounter(TIM_INSTANCE(htim));
}

/**
  * @brief  Enable update event generation.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableUpdateGeneration(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_EnableUpdateEvent(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Disable update event generation.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   Once update event generation has been disabled, no update event
  *         occurs until @ref HAL_TIM_EnableUpdateGeneration is called.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableUpdateGeneration(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_DisableUpdateEvent(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Tell whether update event generation is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_update_generation_status_t  Update Event Generation Status (Disabled/Enabled)
  */
hal_tim_update_generation_status_t HAL_TIM_IsEnabledUpdateGeneration(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_update_generation_status_t)
         (LL_TIM_IsEnabledUpdateEvent((tim_t *)((uint32_t)htim->instance)));
}

/**
  * @brief  Set update event source.
  * @param  htim           Pointer to the handle of the TIM instance.
  * @param  update_source  Source for the Update event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetUpdateSource(hal_tim_handle_t *htim,
                                     hal_tim_update_src_t update_source)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM(IS_TIM_UPDATE_SRC(update_source));

  LL_TIM_SetUpdateSource(TIM_INSTANCE(htim), (uint32_t)update_source);

  return HAL_OK;
}

/**
  * @brief  Get update event source.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_update_src_t  Source of the update event.
  */
hal_tim_update_src_t HAL_TIM_GetUpdateSource(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_update_src_t)(LL_TIM_GetUpdateSource(TIM_INSTANCE(htim)));
}

/**
  * @brief  Force a continuous copy of the update interrupt flag (UIF)
  *         into the timer counter register (bit 31).
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableUpdateFlagRemap(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_EnableUIFRemap(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Disable the copy of the update interrupt flag (UIF)
  *         into the timer counter register (bit 31).
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableUpdateFlagRemap(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_DisableUIFRemap(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Tell whether the copy of the update interrupt flag (UIF) into the
  *         timer counter register is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_update_flag_remap_status_t  Update interrupt flag copy
  *                                             status (Disabled/Enabled)
  */
hal_tim_update_flag_remap_status_t HAL_TIM_IsEnabledUpdateFlagRemap(const hal_tim_handle_t *htim)

{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_update_flag_remap_status_t)(LL_TIM_IsEnabledUIFRemap(TIM_INSTANCE(htim)));
}

/**
  * @brief  Enable the auto-reload preload.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   When autoreload preload is enabled, autoreload (TIMx_ARR) preload
  *         value isn't taken into account immediately. \n
  *         It is loaded in the active register at next update event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableAutoReloadPreload(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

