MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_EnableARRPreload(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Disable the auto-reload preload.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableAutoReloadPreload(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_DisableARRPreload(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Tell whether autoreload preload is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_auto_reload_preload_status_t  Auto-reload preload status of TIM.
  */
hal_tim_auto_reload_preload_status_t HAL_TIM_IsEnabledAutoReloadPreload(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return ((hal_tim_auto_reload_preload_status_t)
          LL_TIM_IsEnabledARRPreload(TIM_INSTANCE(htim)));
}

/**
  * @brief  Enable dithering for the timer.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableDithering(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_EnableDithering(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Disable dithering for the timer.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   It is recommended to follow this sequence when disabling the dithering:
  *          1. The Counter must be stopped @ref HAL_TIM_Stop(_IT/_DMA) and
  *             Auto Reload preload disabled @ref HAL_TIM_DisableAutoReloadPreload
  *          2. The new Period without dithering must be set @ref HAL_TIM_SetPeriod
  *          3. The new Pulse values without dithering must be set @ref HAL_TIM_OC_SetCompareUnitPulse
  *          3. The Dithering must be disabled @ref HAL_TIM_DisableDithering
  *          4. Capture/compare interrupt flags must be cleared LL_TIM_ClearFlag_CC1 (for each channel)
  *          5. The Counter can be re-enabled @ref HAL_TIM_Start(_IT/_DMA)
  *             (eventually with Auto Reload preload).
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableDithering(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_DisableDithering(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Tell whether dithering is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_dithering_status_t  Dithering status of TIM.
  */
hal_tim_dithering_status_t HAL_TIM_IsEnabledDithering(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_dithering_status_t)LL_TIM_IsEnabledDithering(TIM_INSTANCE(htim));
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Set the source that triggers the capture/compare DMA request.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  cc_dmareq_source  Source for the Capture/Compare DMA request.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetCaptureCompareDMAReqSource(hal_tim_handle_t *htim,
                                                   hal_tim_cc_dmareq_src_t cc_dmareq_source)
{

  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM(IS_TIM_CC_DMAREQ_SRC(cc_dmareq_source));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_DMA_CC_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_CC_SetDMAReqTrigger(p_tim, (uint32_t)cc_dmareq_source);

  return HAL_OK;
}

/**
  * @brief  Get the source that triggers the capture/compare DMA request.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_cc_dmareq_src_t  The source that triggers the DMA request.
  */
hal_tim_cc_dmareq_src_t HAL_TIM_GetCaptureCompareDMAReqSource(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_DMA_CC_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_cc_dmareq_src_t)LL_TIM_CC_GetDMAReqTrigger(p_tim);

}
#endif /* USE_HAL_TIM_DMA */


/**
  * @brief  Start the timer in polling mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Start(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, global_state, HAL_TIM_STATE_IDLE,
                         HAL_TIM_STATE_ACTIVE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Enable TIMx counter except in 'trigger' and 'combined reset + trigger modes'
     where enable is automatically done with trigger.
     Thus it is not mandatory to call HAL_TIM_Start() for these modes. */
  uint32_t slave_mode = LL_TIM_GetSlaveMode(p_tim);

  if (!(IS_TIM_SLAVE_INSTANCE(p_tim) && IS_TIM_SLAVE_MODE_ENABLING_COUNTER(slave_mode)))
  {
    LL_TIM_EnableCounter(p_tim);
  }

  return HAL_OK;
}

/**
  * @brief  Stop the timer that was started in polling mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Stop(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_ACTIVE);

  LL_TIM_DisableCounter(p_tim);

  htim->global_state = HAL_TIM_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start the timer in interrupt mode (default TIM update interrupt).
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Start_IT(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, global_state, HAL_TIM_STATE_IDLE,
                         HAL_TIM_STATE_ACTIVE);

  return TIM_Start_IT_Opt(htim, HAL_TIM_OPT_IT_UPDATE);
}

/**
  * @brief  Start the timer in interrupt mode.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  interrupts  Selection of the TIM interrupts (subset of @ref TIM_Optional_Interruptions). \n
  *                     Can be any of the (meaningful) ored values: \n
  *                     @arg @ref HAL_TIM_OPT_IT_UPDATE
  *                     @arg @ref HAL_TIM_OPT_IT_COMMUTATION
  *                     @arg @ref HAL_TIM_OPT_IT_TRIGGER_INPUT
  *                     @arg @ref HAL_TIM_OPT_IT_BREAK
  *                     @arg @ref HAL_TIM_OPT_IT_ENCODER_INDEX
  *                     @arg @ref HAL_TIM_OPT_IT_ENCODER_DIRECTION
  *                     @arg @ref HAL_TIM_OPT_IT_ENCODER_INDEX_ERROR
  *                     @arg @ref HAL_TIM_OPT_IT_ENCODER_TRANSITION_ERROR
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Start_IT_Opt(hal_tim_handle_t *htim, uint32_t interrupts)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, global_state, HAL_TIM_STATE_IDLE,
                         HAL_TIM_STATE_ACTIVE);

  /* Check that all the interrupts selected are supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_OPTIONAL_INTERRUPTS(TIM_INSTANCE(htim), interrupts));

  return TIM_Start_IT_Opt(htim, interrupts);
}

/**
  * @brief  Stop the timer that was started in interrupt mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Stop_IT(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_ACTIVE);

  tim_t *p_tim = TIM_INSTANCE(htim);

