MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Disable all interrupts by default */
  LL_TIM_DisableIT(p_tim, TIM_OPTIONAL_INTERRUPTS_MASK);

  LL_TIM_DisableCounter(p_tim);

  htim->global_state = HAL_TIM_STATE_IDLE;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Start the timer in DMA mode (default DMA interrupts).
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  p_data     Pointer to the data buffer.
  * @param  size_byte  Data buffer size (in bytes).
  * @note   One data will be transferred from the buffer to the autoreload
  *         register (TIMx_ARR) at each update event. \n
  *         DMA transfer ends when all the data of the buffer have been
  *         transferred.
  * @note   @ref HAL_TIM_SetDMA() must be called with the correct DMA index
  *         (see @ref hal_tim_dma_index_t) before calling this function.
  * @retval HAL_OK
  * @retval HAL_ERROR          Failed to start the DMA transfer.
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_Start_DMA(hal_tim_handle_t *htim,
                               const uint8_t *p_data,
                               uint32_t size_byte)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(TIM_INSTANCE(htim)));

  HAL_CHECK_UPDATE_STATE(htim, global_state, HAL_TIM_STATE_IDLE,
                         HAL_TIM_STATE_ACTIVE);

  return TIM_Start_DMA_Opt(htim, p_data, size_byte, HAL_TIM_OPT_DMA_IT_DEFAULT);
}

/**
  * @brief  Start the timer in DMA mode (optional DMA interrupts).
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  p_data      Pointer to the data buffer.
  * @param  size_byte   Data buffer size (in bytes).
  * @param  interrupts  Selection of the DMA interrupts (subset of @ref TIM_Optional_Interruptions). \n
  *                     Can be any of the (meaningful) ored values: \n
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_NONE
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_HT
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_DEFAULT
  * @if USE_HAL_DMA_LINKEDLIST
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_SILENT
  * @endif
  * @note   One data will be transferred from the buffer to the autoreload
  *         register (TIMx_ARR) at each update event. \n
  *         DMA transfer ends when all the data of the buffer have been
  *         transferred.
  * @note   @ref HAL_TIM_SetDMA() must be called with the correct DMA index
  *         (see @ref hal_tim_dma_index_t) before calling this function.
  * @retval HAL_OK
  * @retval HAL_ERROR          Failed to start the DMA transfer.
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_Start_DMA_Opt(hal_tim_handle_t *htim,
                                   const uint8_t *p_data,
                                   uint32_t size_byte,
                                   uint32_t interrupts)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(TIM_INSTANCE(htim)));

  HAL_CHECK_UPDATE_STATE(htim, global_state, HAL_TIM_STATE_IDLE,
                         (TIM_STATE_ACTIVE(interrupts)));

  return TIM_Start_DMA_Opt(htim, p_data, size_byte, interrupts);
}

/**
  * @brief  Stop the timer that was started in DMA mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_Stop_DMA(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_ACTIVE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(p_tim));

  uint32_t dier = LL_TIM_READ_REG(p_tim, DIER);

  /* Retrieve dma requests already enabled (update, commutation and trigger) */
  uint32_t dma_req = dier & (LL_TIM_DIER_UDE | LL_TIM_DIER_COMDE | LL_TIM_DIER_TDE);

  /* Check that almost one dma request is enabled.
     Otherwise, it means that no HAL_TIM_Start_DMA() has been done.
     When using the driver, no more than 2 dma requests must be enabled.
     So, no check for this. */
  ASSERT_DBG_PARAM(dma_req != 0U);

  if (htim->dmaburst_source != TIM_DMABURST_NONE)
  {
    /* Calculate the dma request associated to the dma burst source
      (-1U because dma burst source starts at 1 (0 is reserved)) */
    uint32_t dmaburst_req = LL_TIM_DIER_UDE << (((uint32_t)htim->dmaburst_source >> TIM_DMABURST_DMAINDEX_SHIFT) - 1U);

    /* Disable dma requests except if used by the dma burst */
    dma_req &= ~dmaburst_req;
  }

  LL_TIM_DisableDMAReq(p_tim, dma_req);

  /* Calculate the dma index from the dma request */
  hal_tim_dma_index_t dma_index = TIM_DMARequestToDMAIndex(dma_req);

  TIM_Abort_DMA(htim,
                dma_index,
                (IS_TIM_ACTIVE_SILENT(htim->global_state)));

  LL_TIM_DisableCounter(p_tim);

  htim->global_state = HAL_TIM_STATE_IDLE;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @}
  */


/** @addtogroup TIM_Exported_Functions_Group4
  *  @{
  */

/**
  * @brief  Configure an output compare unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit to configure.
  * @param  p_config      Pointer to an output compare unit configuration structure.
  * @note   If dithering is activated, the value of pulse is split in two parts:
  *         bits[31:4] holds the integer part and bits[3:0] the fractional part.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_OC_SetConfigCompareUnit(hal_tim_handle_t *htim,
                                             hal_tim_oc_compare_unit_t compare_unit,
                                             const hal_tim_oc_compare_unit_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check compare unit configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_OC_MODE(compare_unit, p_config->mode));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_OC_PULSE(p_tim, p_config->pulse));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_SetMode(p_tim, ll_tim_channels[(uint32_t)compare_unit], (uint32_t)p_config->mode);

