MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_OC_SetCompareValue(p_tim, (uint32_t)compare_unit, p_config->pulse);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of an output compare unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @param  p_config      Pointer to an output compare unit configuration structure.
  * @note   If dithering is activated, pay attention to the returned value interpretation.
  */
void HAL_TIM_OC_GetConfigCompareUnit(const hal_tim_handle_t *htim,
                                     hal_tim_oc_compare_unit_t compare_unit,
                                     hal_tim_oc_compare_unit_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  p_config->mode = (hal_tim_oc_mode_t)LL_TIM_OC_GetMode(p_tim, ll_tim_channels[(uint32_t)compare_unit]);

  p_config->pulse = LL_TIM_OC_GetCompareValue(p_tim, (uint32_t)compare_unit);
}

/**
  * @brief  Set the pulse of an output compare unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @param  pulse         Compare match value.
  * @note   The pulse value can also include the fractional part for the dithering mode.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_SetCompareUnitPulse(hal_tim_handle_t *htim,
                                            hal_tim_oc_compare_unit_t compare_unit,
                                            uint32_t pulse)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);
  ASSERT_DBG_PARAM(IS_TIM_OC_PULSE(p_tim, pulse));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_SetCompareValue(p_tim, (uint32_t)compare_unit, pulse);

  return HAL_OK;
}

/**
  * @brief  Get the pulse of an output compare unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval uint32_t  Compare match value
  */
uint32_t HAL_TIM_OC_GetCompareUnitPulse(const hal_tim_handle_t *htim,
                                        hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  return LL_TIM_OC_GetCompareValue(p_tim, (uint32_t)compare_unit);
}

/**
  * @brief   Set the pulse and dithering pattern of an output compare unit.
  * @param   htim          Pointer to the handle of the TIM instance.
  * @param   compare_unit  Output compare unit to configure.
  * @param   pulse         Compare match value (integer part).
  * @param   pulse_dithering_pattern  Dithering pattern for the pulse (fractional part).
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_OC_SetCompareUnitDitheredPulse(hal_tim_handle_t *htim,
                                                    hal_tim_oc_compare_unit_t compare_unit,
                                                    uint32_t pulse,
                                                    hal_tim_dithering_pattern_t pulse_dithering_pattern)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM(IS_TIM_DITHERING_PATTERN(pulse_dithering_pattern));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_OC_PULSE_WITH_DITHERING(p_tim, pulse));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_SetCompareValue(p_tim, (uint32_t)compare_unit,
                            HAL_TIM_COMPUTE_DITHERED_PULSE(pulse,
                                                           (uint32_t)pulse_dithering_pattern));

  return HAL_OK;
}

/**
  * @brief  Get the pulse and dithering pattern of an output compare unit.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @param  p_pulse       Pointer to compare match value (integer part).
  * @param  p_pulse_dithering_pattern  Pointer to dithering pattern for the pulse
  *                                    (fractional part)
  */
void HAL_TIM_OC_GetCompareUnitDitheredPulse(const hal_tim_handle_t *htim,
                                            hal_tim_oc_compare_unit_t compare_unit,
                                            uint32_t *p_pulse,
                                            hal_tim_dithering_pattern_t *p_pulse_dithering_pattern)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_pulse != NULL));
  ASSERT_DBG_PARAM((p_pulse_dithering_pattern != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  uint32_t compare_match_value = LL_TIM_OC_GetCompareValue(p_tim, (uint32_t)compare_unit);

  *p_pulse = ((compare_match_value & ~TIM_DITHERING_MASK)
              >> HAL_TIM_DITHERING_SHIFT);

  *p_pulse_dithering_pattern = (hal_tim_dithering_pattern_t)(uint32_t)(compare_match_value &
                                                                       TIM_DITHERING_MASK);
}

/**
  * @brief  Enable compare register (TIMx_CCRy) preload of an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @note   When output compare preload is enabled, compare (TIMx_CCRy) preload
  *         value isn't taken into account immediately. \n
  *         It is loaded in the active register at next update event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_EnableComparePreload(hal_tim_handle_t *htim,
                                             hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

