MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_OC_EnablePreload(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Disable register (TIMx_CCRy) compare preload of an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_DisableComparePreload(hal_tim_handle_t *htim,
                                              hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_DisablePreload(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Tell whether output compare preload is enabled or not for an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval hal_tim_oc_compare_preload_status_t  Compare preload status.
  */
hal_tim_oc_compare_preload_status_t HAL_TIM_OC_IsEnabledComparePreload(const hal_tim_handle_t *htim,
                                                                       hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  return (hal_tim_oc_compare_preload_status_t)LL_TIM_OC_IsEnabledPreload(p_tim,
                                                                         ll_tim_channels[compare_unit]);
}

/**
  * @brief  Enable fast mode for an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_EnableCompareFastMode(hal_tim_handle_t *htim,
                                              hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_EnableFast(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Disable fast mode for an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_DisableCompareFastMode(hal_tim_handle_t *htim,
                                               hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_DisableFast(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Tell whether fast mode is enabled or not for an output channel.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval hal_tim_oc_compare_fast_mode_status_t  Fast Mode status.
  */
hal_tim_oc_compare_fast_mode_status_t HAL_TIM_OC_IsEnabledCompareFastMode(const hal_tim_handle_t *htim,
                                                                          hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  return (hal_tim_oc_compare_fast_mode_status_t)LL_TIM_OC_IsEnabledFast(p_tim,
                                                                        ll_tim_channels[compare_unit]);
}

/**
  * @brief  Configure an output channel.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  channel   Output channel to configure.
  * @param  p_config  Pointer to an output channel configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_OC_SetConfigChannel(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         const hal_tim_oc_channel_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_PARAM(IS_TIM_OC_POLARITY(p_config->polarity));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_CHANNEL_STATE_RESET | TIM_CHANNEL_STATE_IDLE));

  LL_TIM_OC_SetPolarity(p_tim, ll_tim_channels[channel], (uint32_t)p_config->polarity);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    ASSERT_DBG_PARAM(IS_TIM_OC_IDLE_STATE(p_config->idle_state));
    LL_TIM_OC_SetIdleState(p_tim, ll_tim_channels[channel], (uint32_t)p_config->idle_state);
    if (!(IS_TIM_OC_INTERNAL_CHANNEL(channel)))
    {
      ASSERT_DBG_PARAM(IS_TIM_OC_OVERRIDE_STATE(p_config->override_state));
      ASSERT_DBG_PARAM(IS_TIM_OC_BREAK_MODE(p_config->break_mode));
      LL_TIM_OC_SetOverrideState(p_tim, ll_tim_channels[channel], (uint32_t)p_config->override_state);
      LL_TIM_OC_SetBreakMode(p_tim, ll_tim_channels[channel], (uint32_t)p_config->break_mode);
    }
  }

  htim->channel_states[channel] = HAL_TIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the configuration of an Output Channel.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  channel   Output channel.
  * @param  p_config  Pointer to an output channel configuration structure.
  * @note   There is no check that the channel direction is indeed output.
  */
void HAL_TIM_OC_GetConfigChannel(const hal_tim_handle_t *htim,
                                 hal_tim_channel_t channel,
                                 hal_tim_oc_channel_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

