MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_CHANNEL_STATE_RESET | HAL_TIM_OC_CHANNEL_STATE_IDLE \
                    | HAL_TIM_OC_CHANNEL_STATE_ACTIVE));

  uint32_t ll_channel = ll_tim_channels[channel];

  p_config->polarity = (hal_tim_oc_polarity_t)LL_TIM_OC_GetPolarity(p_tim, ll_channel);

  p_config->idle_state = (hal_tim_oc_idle_state_t)LL_TIM_OC_GetIdleState(p_tim, ll_channel);

  p_config->override_state = (hal_tim_oc_override_state_t)LL_TIM_OC_GetOverrideState(p_tim, ll_tim_channels[channel]);

  p_config->break_mode = (hal_tim_oc_break_mode_t)LL_TIM_OC_GetBreakMode(p_tim, ll_tim_channels[channel]);
}

/**
  * @brief   Enable output override.
  * @param   htim  Pointer to the handle of the TIM instance.
  * @note    Outputs are forced in an override state defined in @ref HAL_TIM_OC_SetConfigChannel().
  * @warning This function can only be used when the outputs are in idle state (MOE = 0).
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_OC_EnableOutputOverride(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_OC_EnableOutputOverride(p_tim);

  return HAL_OK;
}

/**
  * @brief   Disable output override.
  * @param   htim  Pointer to the handle of the TIM instance.
  * @note    Outputs return to the default idle state.
  * @warning This function can only be used when the outputs are in idle state (MOE = 0).
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_OC_DisableOutputOverride(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_OC_DisableOutputOverride(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether the output override is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_oc_output_override_status_t  Output override status.
  */
hal_tim_oc_output_override_status_t HAL_TIM_OC_IsEnabledOutputOverride(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_oc_output_override_status_t)LL_TIM_OC_IsEnabledOutputOverride(p_tim);
}

/**
  * @brief  Program the pulse width and prescaler when the output channel
  *         operates in pulse on compare mode.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a pulse generation configuration structure.
  * @note   Pulse on compare mode is only available on channel 3 and channel 4.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_OC_SetPulseGenerator(hal_tim_handle_t *htim,
                                          const hal_tim_pulse_generator_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Make sure pulse on compare is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_PULSE_ON_COMPARE_INSTANCE(p_tim));

  /* Check pulse generator configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_PULSE_PRESCALER(p_config->prescaler));
  ASSERT_DBG_PARAM(IS_TIM_OC_PULSE_WIDTH(p_config->pulse_width));

  LL_TIM_OC_SetPulseWidthPrescaler(p_tim, (uint32_t)p_config->prescaler);

  LL_TIM_OC_SetPulseWidth(p_tim, p_config->pulse_width);

  return HAL_OK;
}

/**
  * @brief  Get the pulse width and prescaler of an output channel
  *         operating in pulse on compare mode.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a pulse generation configuration structure.
  * @note   Pulse on compare mode is only available on channel 3 and channel 4.
  */
void HAL_TIM_OC_GetPulseGenerator(const hal_tim_handle_t *htim,
                                  hal_tim_pulse_generator_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  p_config->prescaler = (hal_tim_pulse_prescaler_t)LL_TIM_OC_GetPulseWidthPrescaler(p_tim);

  p_config->pulse_width = LL_TIM_OC_GetPulseWidth(p_tim);
}

/**
  * @brief   Select on which reference signal the OC5REF (i.e. output compare of channel 5)
  *          is combined to.
  * @param   htim   Pointer to the handle of the TIM instance.
  * @param   group  This parameter can be a combination of the following values: \n
  *                 @arg @ref HAL_TIM_GROUP_NONE
  *                 @arg @ref HAL_TIM_GROUP_AND_OC1REFC
  *                 @arg @ref HAL_TIM_GROUP_AND_OC2REFC
  *                 @arg @ref HAL_TIM_GROUP_AND_OC3REFC
  *                 @arg @ref HAL_TIM_GROUP_AND_OC4REFC
  *                 @arg @ref HAL_TIM_GROUP_OR_OC1REFC
  *                 @arg @ref HAL_TIM_GROUP_OR_OC2REFC
  *                 @arg @ref HAL_TIM_GROUP_OR_OC3REFC
  *                 @arg @ref HAL_TIM_GROUP_OR_OC4REFC
  * @note    When OC5REF is grouped with OCxREF, resulting tim_ocxrefc is made of
  *          an AND/OR logical combination of two reference PWMs.
  * @warning If both HAL_TIM_GROUP_AND_OCxREFC and HAL_TIM_GROUP_OR_OCxREFC are selected,
  *          HAL_TIM_GROUP_AND_OCxREFC overrides HAL_TIM_GROUP_OR_OCxREFC programming.
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_OC_SetGroupChannel(hal_tim_handle_t *htim,
                                        uint32_t group)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

