MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check that the instance supports OC5REF and group is a valid combination */
  ASSERT_DBG_PARAM(IS_TIM_GROUP_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_GROUP(group));

  LL_TIM_SetCH5CombinedChannels(p_tim, group);

  return HAL_OK;
}

/**
  * @brief  Get the group configuration of OC5REF signal of timer.
  *         That is, it returns a bitfield that informs if any of the output
  *         channels 1, 2 and 3 is combined with output channel 5.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  OC5REF signal which is a combination of the following values: \n
  *                   @arg @ref HAL_TIM_GROUP_NONE
  *                   @arg @ref HAL_TIM_GROUP_AND_OC1REFC
  *                   @arg @ref HAL_TIM_GROUP_AND_OC2REFC
  *                   @arg @ref HAL_TIM_GROUP_AND_OC3REFC
  *                   @arg @ref HAL_TIM_GROUP_AND_OC4REFC
  *                   @arg @ref HAL_TIM_GROUP_OR_OC1REFC
  *                   @arg @ref HAL_TIM_GROUP_OR_OC2REFC
  *                   @arg @ref HAL_TIM_GROUP_OR_OC3REFC
  *                   @arg @ref HAL_TIM_GROUP_OR_OC4REFC
  */
uint32_t HAL_TIM_OC_GetGroupChannel(const hal_tim_handle_t *htim)
{
  /* Check the TIM handle and config allocation */
  ASSERT_DBG_PARAM((htim != NULL));

  /* Check the global state */
  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports OC5REF */
  ASSERT_DBG_PARAM(IS_TIM_GROUP_INSTANCE(p_tim));

  return LL_TIM_GetCH5CombinedChannels(p_tim);
}

/**
  * @brief  Start a timer's output channel in polling mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Output channel of interest.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_StartChannel(hal_tim_handle_t *htim,
                                     hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel)));

  /* Check and update the channel state */
  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_OC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_OC_CHANNEL_STATE_IDLE,
                         HAL_TIM_OC_CHANNEL_STATE_ACTIVE);

  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    LL_TIM_EnableAllOutputs(p_tim);
  }

  return HAL_OK;
}

/**
  * @brief  Stop a timer's output channel that was started in polling mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Output channel of interest.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_StopChannel(hal_tim_handle_t *htim,
                                    hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_OC_CHANNEL_STATE_ACTIVE);

  uint32_t ll_channel = ll_tim_channels[channel];
  LL_TIM_CC_DisableChannel(p_tim, ll_channel);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    if (TIM_ARE_ALL_CHANNELS_DISABLED(p_tim))
    {
      LL_TIM_DisableAllOutputs(p_tim);
    }
  }

  htim->channel_states[channel] = HAL_TIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start a timer's output channel in interrupt mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Output channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  *                  @arg @ref HAL_TIM_CHANNEL_1N
  *                  @arg @ref HAL_TIM_CHANNEL_2N
  *                  @arg @ref HAL_TIM_CHANNEL_3N
  *                  @arg @ref HAL_TIM_CHANNEL_4N
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_StartChannel_IT(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the channel is supported by the instance and
     is not an internal channel */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel))
                   && !(IS_TIM_OC_INTERNAL_CHANNEL(channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_OC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_OC_CHANNEL_STATE_IDLE,
                         HAL_TIM_OC_CHANNEL_STATE_ACTIVE);

  /* Enable compare match interrupt */
  uint32_t it_shift = (uint32_t)channel % (uint32_t)HAL_TIM_CHANNEL_1N;
  LL_TIM_EnableIT(p_tim, LL_TIM_DIER_CC1IE << it_shift);

  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    LL_TIM_EnableAllOutputs(p_tim);
  }

  return HAL_OK;
}

/**
  * @brief  Stop a timer's output channel that was started in interrupt mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Output channel of interest.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_OC_StopChannel_IT(hal_tim_handle_t *htim,
                                       hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the channel is supported by the instance and
     is not an internal channel */
  ASSERT_DBG_PARAM((IS_TIM_OC_CHANNEL(p_tim, channel))
                   && !(IS_TIM_OC_INTERNAL_CHANNEL(channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_OC_CHANNEL_STATE_ACTIVE);

  /* Disable compare match interrupt */
  uint32_t it_shift = (uint32_t)channel % (uint32_t)HAL_TIM_CHANNEL_1N;
  LL_TIM_DisableIT(p_tim, LL_TIM_DIER_CC1IE << it_shift);

