MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Ensure that the channel is in active or active silent mode */
  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_OC_CHANNEL_STATE_ACTIVE);

  /* Stop DMA transfer and disable compare match DMA request */
  if (TIM_StopChannel_DMA(htim, p_tim, channel,
                          (IS_TIM_ACTIVE_SILENT(htim->channel_states[channel]))) != HAL_OK)
  {
    return HAL_ERROR;
  }

  uint32_t ll_channel = ll_tim_channels[channel];
  LL_TIM_CC_DisableChannel(p_tim, ll_channel);

  if (IS_TIM_BREAK_INSTANCE(p_tim))
  {
    if (TIM_ARE_ALL_CHANNELS_DISABLED(p_tim))
    {
      LL_TIM_DisableAllOutputs(p_tim);
    }
  }

  htim->channel_states[channel] = HAL_TIM_OC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group5
  *  @{
  */

/**
  * @brief   Configure an input channel.
  * @param   htim      Pointer to the handle of the TIM instance.
  * @param   channel   Input channel to configure. \n
  *                    Must be one of the following values: \n
  *                    @arg @ref HAL_TIM_CHANNEL_1
  *                    @arg @ref HAL_TIM_CHANNEL_2
  *                    @arg @ref HAL_TIM_CHANNEL_3
  *                    @arg @ref HAL_TIM_CHANNEL_4
  * @param   p_config  Pointer to an input channel configuration structure.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_IC_SetConfigChannel(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         const hal_tim_ic_channel_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_CHANNEL_STATE_RESET | TIM_CHANNEL_STATE_IDLE));

  /* Check channel configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_CHANNEL_SRC(p_tim, channel, p_config->source));
  ASSERT_DBG_PARAM(IS_TIM_IC_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_TIM_FILTER(p_config->filter));

  const uint32_t ll_channel = ll_tim_channels[channel];
  const hal_tim_channel_src_t source = p_config->source;

  /* Configure the channel */
  TIM_SetRemap(p_tim, channel, source);

  LL_TIM_IC_SetPolarity(p_tim, ll_channel, (uint32_t)p_config->polarity);

  LL_TIM_IC_SetFilter(p_tim, ll_channel, TIM_IC_HAL2LL_FILTER(p_config->filter));

  htim->channel_states[channel] = HAL_TIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Get the configuration of an input channel.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  channel   Input channel of interest \n
  *                   Must be one of the following values: \n
  *                   @arg @ref HAL_TIM_CHANNEL_1
  *                   @arg @ref HAL_TIM_CHANNEL_2
  *                   @arg @ref HAL_TIM_CHANNEL_3
  *                   @arg @ref HAL_TIM_CHANNEL_4
  * @param  p_config  Pointer to an input channel configuration structure.
  */
void HAL_TIM_IC_GetConfigChannel(const hal_tim_handle_t *htim,
                                 hal_tim_channel_t channel,
                                 hal_tim_ic_channel_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_CHANNEL_STATE_RESET | HAL_TIM_IC_CHANNEL_STATE_IDLE \
                    | HAL_TIM_IC_CHANNEL_STATE_ACTIVE));

  uint32_t ll_channel = ll_tim_channels[channel];

  p_config->source = (hal_tim_channel_src_t)LL_TIM_IC_GetSource(p_tim, ll_channel);

  p_config->polarity = (hal_tim_ic_polarity_t)LL_TIM_IC_GetPolarity(p_tim,
                                                                    ll_channel);

  uint32_t ll_filter = LL_TIM_IC_GetFilter(p_tim, ll_channel);
  p_config->filter = TIM_IC_LL2HAL_FILTER(ll_filter);
}

/**
  * @brief  Configure the source of an input channel.
  * @param  htim         Pointer to the handle of the TIM instance.
  * @param  channel      Input channel of interest \n
  *                      Must be one of the following values: \n
  *                      @arg @ref HAL_TIM_CHANNEL_1
  *                      @arg @ref HAL_TIM_CHANNEL_2
  *                      @arg @ref HAL_TIM_CHANNEL_3
  *                      @arg @ref HAL_TIM_CHANNEL_4
  * @param  channel_src  Input source for the channel.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_SetChannelSource(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         hal_tim_channel_src_t channel_src)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  /* Check the source is valid for the instance */
  ASSERT_DBG_PARAM(IS_TIM_CHANNEL_SRC(p_tim, channel, channel_src));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  TIM_SetRemap(p_tim, channel, channel_src);

  return HAL_OK;
}

/**
  * @brief  Get the source of a input channel.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval hal_tim_channel_src_t  The input source for the channel.
  */
hal_tim_channel_src_t HAL_TIM_IC_GetChannelSource(const hal_tim_handle_t *htim,
                                                  hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

