MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE | HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  return (hal_tim_channel_src_t)LL_TIM_IC_GetSource(p_tim, ll_tim_channels[channel]);
}

/**
  * @brief   Configure a capture unit.
  * @param   htim          Pointer to the handle of the TIM instance.
  * @param   capture_unit  Identify the capture unit to configure.
  * @param   p_config      Pointer to a capture unit configuration structure.
  * @warning When the adjacent timer input channel is selected as the source of the capture unit
  *          (i.e. input channel 1 is captured by capture unit 2) then the polarity of the adjacent
  *          input channel is overwritten by this function as per the source field value.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM  Input parameter is invalid
  *                             (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_IC_SetConfigCaptureUnit(hal_tim_handle_t *htim,
                                             hal_tim_ic_capture_unit_t capture_unit,
                                             const hal_tim_ic_capture_unit_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the capture unit is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_IC_CAPTURE_UNIT(p_tim, capture_unit));

  /* Check the config parameters */
  ASSERT_DBG_PARAM((IS_TIM_IC_CAPTURE_UNIT_SRC(p_config->source)));
  ASSERT_DBG_PARAM((IS_TIM_IC_CAPTURE_UNIT_PRESCALER(p_config->prescaler)));

  hal_tim_ic_capture_unit_src_t source = p_config->source;
  LL_TIM_IC_SetActiveInput(p_tim, (uint32_t)capture_unit,
                           TIM_LL_ACTIVE_INPUT((uint32_t)source));

  if ((source != HAL_TIM_IC_DIRECT) && (source != HAL_TIM_IC_TRC))
  {
    LL_TIM_IC_SetPolarity(p_tim, (uint32_t)capture_unit,
                          TIM_LL_IC_POLARITY((uint32_t)source));
  }

  LL_TIM_IC_SetPrescaler(p_tim, (uint32_t)capture_unit,
                         (uint32_t)p_config->prescaler);

  return HAL_OK;
}

/**
  * @brief  Get a capture unit configuration.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  capture_unit  Identify the capture unit.
  * @param  p_config      Pointer to a capture unit configuration structure.
  */
void HAL_TIM_IC_GetConfigCaptureUnit(const hal_tim_handle_t *htim,
                                     hal_tim_ic_capture_unit_t capture_unit,
                                     hal_tim_ic_capture_unit_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the capture unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CAPTURE_UNIT(p_tim, capture_unit)));

  uint32_t source = LL_TIM_IC_GetActiveInput(p_tim, (uint32_t)capture_unit);
  if ((source != (uint32_t)HAL_TIM_IC_DIRECT)
      && (source != (uint32_t)HAL_TIM_IC_TRC))
  {
    source |= LL_TIM_IC_GetPolarity(p_tim, (uint32_t)capture_unit);
  }
  p_config->source = (hal_tim_ic_capture_unit_src_t)source;

  p_config->prescaler = (hal_tim_ic_capture_unit_prescaler_t)LL_TIM_IC_GetPrescaler(p_tim,
                        (uint32_t)capture_unit);
}

/**
  * @brief  Configure the XOR gate position.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  xor_position  XOR gate position.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_SetXORGatePosition(hal_tim_handle_t *htim,
                                           hal_tim_ic_xor_gate_position_t xor_position)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate and has at least 3 channels */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim) && IS_TIM_CC3_INSTANCE(p_tim)));

  /* Check the XOR gate position is valid */
  ASSERT_DBG_PARAM((IS_TIM_XOR_GATE_POSITION(xor_position)));

  LL_TIM_IC_SetXORGatePosition(p_tim, (uint32_t)xor_position);

  return HAL_OK;
}

/**
  * @brief  Get the XOR gate position configuration.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_ic_xor_gate_position_t  The XOR gate position.
  */
hal_tim_ic_xor_gate_position_t HAL_TIM_IC_GetXORGatePosition(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate and has at least 3 channels */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim) && IS_TIM_CC3_INSTANCE(p_tim)));

  return (hal_tim_ic_xor_gate_position_t)LL_TIM_IC_GetXORGatePosition(p_tim);
}

/**
  * @brief  Enable the signal inversion of a XOR gate input channel.
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  channel    Input channel to configure. \n
  *                    Must be one of the following values: \n
  *                    @arg @ref HAL_TIM_CHANNEL_1
  *                    @arg @ref HAL_TIM_CHANNEL_2
  *                    @arg @ref HAL_TIM_CHANNEL_3
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_EnableXORGateInputInversion(hal_tim_handle_t *htim, hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

