MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance and is a XOR input */
  ASSERT_DBG_PARAM((IS_TIM_XOR_GATE_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  LL_TIM_IC_EnableXORGateInputInversion(p_tim, ll_tim_channels[channel]);

  return HAL_OK;
}

/**
  * @brief  Disable the signal inversion of a XOR gate input channel.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel to configure. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_DisableXORGateInputInversion(hal_tim_handle_t *htim, hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

  /* Check the channel is supported by the instance and is a XOR input */
  ASSERT_DBG_PARAM((IS_TIM_XOR_GATE_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  LL_TIM_IC_DisableXORGateInputInversion(p_tim, ll_tim_channels[channel]);

  return HAL_OK;
}

/**
  * @brief  Tell whether the XOR gate input channel signal is inverted or not.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel to configure. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  * @retval hal_tim_ic_xor_gate_input_inversion_status_t  The XOR gate inversion status for the input channel.
  */
hal_tim_ic_xor_gate_input_inversion_status_t HAL_TIM_IC_IsEnabledXORGateInputInversion(const hal_tim_handle_t *htim,
    hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

  /* Check the channel is supported by the instance and is a XOR input */
  ASSERT_DBG_PARAM((IS_TIM_XOR_GATE_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE | HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  return (hal_tim_ic_xor_gate_input_inversion_status_t)LL_TIM_IC_IsEnabledXORGateInputInversion(p_tim,
         ll_tim_channels[channel]);
}

/**
  * @brief  Enable the XOR gate.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_EnableXORGate(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

  /* Make sure all channels connected to the XOR gate are in IDLE state */
  ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_1],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_2],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);
  if (IS_TIM_CC3_INSTANCE(p_tim))
  {
    ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_3],
                     HAL_TIM_IC_CHANNEL_STATE_IDLE);
  }

  LL_TIM_IC_EnableXORCombination(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable the XOR gate.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_DisableXORGate(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

  /* Make sure all channels connected to the XOR gate are in IDLE state */
  ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_1],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);
  ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_2],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);
  if (IS_TIM_CC3_INSTANCE(p_tim))
  {
    ASSERT_DBG_STATE(htim->channel_states[HAL_TIM_CHANNEL_3],
                     HAL_TIM_IC_CHANNEL_STATE_IDLE);
  }

  LL_TIM_IC_DisableXORCombination(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether XOR gate is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_ic_xor_gate_status_t  XOR gate status of timer.
  */
hal_tim_ic_xor_gate_status_t HAL_TIM_IC_IsEnabledXORGate(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that the instance supports XOR gate */
  ASSERT_DBG_PARAM((IS_TIM_XOR_INSTANCE(p_tim)));

  return (hal_tim_ic_xor_gate_status_t)LL_TIM_IC_IsEnabledXORCombination(p_tim);
}

/**
  * @brief  Read the captured value for an input channel of timer.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval uint32_t  Captured value
  */
uint32_t HAL_TIM_IC_ReadChannelCapturedValue(const hal_tim_handle_t *htim,
                                             hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

