MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_IC_CHANNEL_STATE_IDLE | HAL_TIM_IC_CHANNEL_STATE_ACTIVE));

  return LL_TIM_IC_GetCapturedValue(p_tim, ll_tim_channels[channel]);
}

/**
  * @brief  Indicate the input signal level of a channel (after the digital filtering stage),
  *         for polling purpose.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval hal_tim_ic_channel_level_t  Input channel signal level
  */
hal_tim_ic_channel_level_t HAL_TIM_IC_GetChannelLevel(const hal_tim_handle_t *htim,
                                                      hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   (HAL_TIM_IC_CHANNEL_STATE_IDLE | HAL_TIM_IC_CHANNEL_STATE_ACTIVE));

  return (hal_tim_ic_channel_level_t)LL_TIM_IC_GetInputStatus(p_tim, ll_tim_channels[channel]);
}

/**
  * @brief  Start a timer's input channel in polling mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_StartChannel(hal_tim_handle_t *htim,
                                     hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_IC_CHANNEL_STATE_IDLE,
                         HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  return HAL_OK;
}

/**
  * @brief  Stop a timer's input channel that was started in polling mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_StopChannel(hal_tim_handle_t *htim,
                                    hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  LL_TIM_CC_DisableChannel(p_tim, ll_tim_channels[channel]);

  htim->channel_states[channel] = HAL_TIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start a timer's input channel in interrupt mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_StartChannel_IT(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_IC_CHANNEL_STATE_IDLE,
                         HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  /* Enable capture interrupt */
  LL_TIM_EnableIT(p_tim, LL_TIM_DIER_CC1IE << (uint32_t)channel);

  LL_TIM_CC_EnableChannel(p_tim, ll_tim_channels[channel]);

  return HAL_OK;
}

/**
  * @brief  Stop a timer's input channel that was started in interrupt mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_StopChannel_IT(hal_tim_handle_t *htim,
                                       hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

