MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  /* Disable capture interrupt */
  LL_TIM_DisableIT(p_tim, LL_TIM_DIER_CC1IE << (uint32_t)channel);

  LL_TIM_CC_DisableChannel(p_tim, ll_tim_channels[channel]);

  htim->channel_states[channel] = HAL_TIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Start a timer's Input Channel in DMA mode (default DMA interrupts).
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  channel    Input channel of interest. \n
  *                    Must be one of the following values: \n
  *                    @arg @ref HAL_TIM_CHANNEL_1
  *                    @arg @ref HAL_TIM_CHANNEL_2
  *                    @arg @ref HAL_TIM_CHANNEL_3
  *                    @arg @ref HAL_TIM_CHANNEL_4
  * @param  p_data     Pointer to the data buffer.
  * @param  size_byte  Data buffer size (in bytes).
  * @note   One data will be transferred from the capture register (TIMx_CCRy) to
  *         the buffer at each capture event. \n
  *         DMA transfer ends when all the data have been transferred to the buffer.
  * @retval HAL_OK
  * @retval HAL_ERROR          Failed to start the DMA transfer.
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_IC_StartChannel_DMA(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel,
                                         uint8_t *p_data,
                                         uint32_t size_byte)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(TIM_INSTANCE(htim)));

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(TIM_INSTANCE(htim), channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_IC_CHANNEL_STATE_IDLE,
                         HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  return TIM_IC_StartChannel_DMA_Opt(htim, channel, p_data, size_byte, HAL_TIM_OPT_DMA_IT_DEFAULT);
}

/**
  * @brief  Start a timer's Input Channel in DMA mode (optional DMA interrupts).
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  channel     Input channel of interest. \n
  *                     Must be one of the following values: \n
  *                     @arg @ref HAL_TIM_CHANNEL_1
  *                     @arg @ref HAL_TIM_CHANNEL_2
  *                     @arg @ref HAL_TIM_CHANNEL_3
  *                     @arg @ref HAL_TIM_CHANNEL_4
  * @param  p_data      Pointer to the data buffer.
  * @param  size_byte   Data buffer size (in bytes).
  * @param  interrupts  Selection of the DMA interrupts. \n
  *                     Can be any of the (meaningful) ored values: \n
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_NONE
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_HT
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_DEFAULT
  * @if USE_HAL_DMA_LINKEDLIST
  *                     @arg @ref HAL_TIM_OPT_DMA_IT_SILENT
  * @endif
  * @note   One data will be transferred from the capture register (TIMx_CCRy) to
  *         the buffer at each capture event. \n
  *         DMA transfer ends when all the data have been transferred to the buffer.
  * @retval HAL_OK
  * @retval HAL_ERROR          Failed to start the DMA transfer.
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_IC_StartChannel_DMA_Opt(hal_tim_handle_t *htim,
                                             hal_tim_channel_t channel,
                                             uint8_t *p_data,
                                             uint32_t size_byte,
                                             uint32_t interrupts)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(TIM_INSTANCE(htim)));

  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(TIM_INSTANCE(htim), channel)));

  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_IDLE);

  /* Move to state HAL_TIM_IC_CHANNEL_STATE_ACTIVE or
     HAL_TIM_IC_CHANNEL_STATE_ACTIVE_SILENT */
  HAL_CHECK_UPDATE_STATE(htim, channel_states[channel],
                         HAL_TIM_IC_CHANNEL_STATE_IDLE,
                         TIM_IC_CHANNEL_STATE_ACTIVE(interrupts));

  return TIM_IC_StartChannel_DMA_Opt(htim, channel, p_data, size_byte, interrupts);
}

/**
  * @brief  Stop a timer's input channel that was started in DMA mode.
  * @param  htim     Pointer to the handle of the TIM instance.
  * @param  channel  Input channel of interest. \n
  *                  Must be one of the following values: \n
  *                  @arg @ref HAL_TIM_CHANNEL_1
  *                  @arg @ref HAL_TIM_CHANNEL_2
  *                  @arg @ref HAL_TIM_CHANNEL_3
  *                  @arg @ref HAL_TIM_CHANNEL_4
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_IC_StopChannel_DMA(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that DMA is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_DMA_INSTANCE(p_tim));

