MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Check the channel is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_IC_CHANNEL(p_tim, channel)));

  /* Ensure that the channel is in active or active silent mode */
  ASSERT_DBG_STATE(htim->channel_states[channel],
                   HAL_TIM_IC_CHANNEL_STATE_ACTIVE);

  /* Stop DMA transfer and disable capture DMA request */
  if (TIM_StopChannel_DMA(htim, p_tim, channel,
                          (IS_TIM_ACTIVE_SILENT(htim->channel_states[channel]))) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_TIM_CC_DisableChannel(p_tim, ll_tim_channels[channel]);

  htim->channel_states[channel] = HAL_TIM_IC_CHANNEL_STATE_IDLE;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_USER_DATA */
/**
  * @}
  */


/** @addtogroup TIM_Exported_Functions_Group6
  *  @{
  */

/**
  * @brief  Enable the one-pulse mode of timer (single pulse).
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableOnePulseMode(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_EnableOnePulseMode(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Disable the one-pulse mode of timer.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableOnePulseMode(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_DisableOnePulseMode(TIM_INSTANCE(htim));

  return HAL_OK;
}

/**
  * @brief  Tell whether one-pulse mode is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_one_pulse_mode_status_t  One-pulse mode status.
  */
hal_tim_one_pulse_mode_status_t HAL_TIM_IsEnabledOnePulseMode(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_one_pulse_mode_status_t)LL_TIM_IsEnabledOnePulseMode(TIM_INSTANCE(htim));
}

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group7
  *  @{
  */

/**
  * @brief  Configure the index input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to the encoder index configuration structure.
  * @note   The index input is a pulse coming from an encoder.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetConfigEncoderIndex(hal_tim_handle_t *htim,
                                           const hal_tim_encoder_index_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INDEX_DIR(p_config->dir));
  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INDEX_POS_SEL(p_config->pos));
  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INDEX_BLANK_MODE(p_config->blanking));
  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INDEX_SEL(p_config->idx));

  uint32_t encoder_idx_cfg = (uint32_t)p_config->dir | (uint32_t)p_config->pos |
                             (uint32_t)p_config->blanking | (uint32_t)p_config->idx;

  LL_TIM_ConfigEncoderIndex(p_tim, encoder_idx_cfg);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the index input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to an encoder index configuration structure.
  */
void HAL_TIM_GetConfigEncoderIndex(const hal_tim_handle_t *htim,
                                   hal_tim_encoder_index_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  uint32_t ecr = LL_TIM_READ_REG(p_tim, ECR);

  p_config->dir = (hal_tim_encoder_index_dir_t)(uint32_t)(ecr & TIM_ECR_IDIR);

  p_config->pos = (hal_tim_encoder_index_pos_sel_t)(uint32_t)(ecr & TIM_ECR_IPOS);

  p_config->blanking = (hal_tim_encoder_index_blank_mode_t)(uint32_t)(ecr & TIM_ECR_IBLK);

  p_config->idx = (hal_tim_encoder_index_sel_t)(uint32_t)(ecr & TIM_ECR_FIDX);
}

/**
  * @brief  Enable the index input.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   when the index input is enabled, the encoder index signal
  *         connected to the timer's external trigger can reset the counter
  *         as per index input configuration.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableEncoderIndex(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_EnableEncoderIndex(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable the index input.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableEncoderIndex(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_DisableEncoderIndex(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether index input is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_encoder_index_status_t  Encoder index status.
  */
hal_tim_encoder_index_status_t HAL_TIM_IsEnabledEncoderIndex(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_ENCODER_INTERFACE_INSTANCE(p_tim));
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  return (hal_tim_encoder_index_status_t)LL_TIM_IsEnabledEncoderIndex(p_tim);
}

/**
  * @}
  */


/** @addtogroup TIM_Exported_Functions_Group8
  *  @{
  */

/**
  * @brief  Configure the external trigger input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to an external trigger input configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetExternalTriggerInput(hal_tim_handle_t *htim,
                                             const hal_tim_ext_trig_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check ETR source selection is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_EXT_TRIG_SRC(p_tim, p_config->source));
  ASSERT_DBG_PARAM(IS_TIM_EXT_TRIG_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_TIM_EXT_TRIG_PRESCALER(p_config->prescaler));
  ASSERT_DBG_PARAM(IS_TIM_EXT_TRIG_SYNC_PRESCALER(p_config->sync_prescaler));
  ASSERT_DBG_PARAM(IS_TIM_FILTER(p_config->filter));

  LL_TIM_SetETRSource(p_tim, (uint32_t)p_config->source);

  uint32_t presc = (uint32_t)(p_config->prescaler) | (uint32_t)(p_config->sync_prescaler);

  LL_TIM_ConfigETR(p_tim,
                   (uint32_t)p_config->polarity,
                   presc,
                   TIM_ETR_HAL2LL_FILTER(p_config->filter));

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the external trigger input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to an external trigger input configuration structure.
  */
void HAL_TIM_GetExternalTriggerInput(const hal_tim_handle_t *htim,
                                     hal_tim_ext_trig_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check ETR source selection is supported by the instance */
  ASSERT_DBG_PARAM(IS_TIM_ETR_INSTANCE(p_tim));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  p_config->source = (hal_tim_ext_trig_src_t)LL_TIM_GetETRSource(p_tim);

