MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  uint32_t polarity;
  uint32_t prescaler;
  uint32_t filter;

  LL_TIM_GetConfigETR(p_tim, &polarity, &prescaler, &filter);

  p_config->polarity = (hal_tim_ext_trig_polarity_t)polarity;
  p_config->prescaler = (hal_tim_ext_trig_prescaler_t)((uint32_t)(prescaler & TIM_SMCR_ETPS));
  p_config->sync_prescaler = (hal_tim_ext_trig_sync_prescaler_t)((uint32_t)(prescaler & TIM_SMCR_SETPS));
  p_config->filter = TIM_ETR_LL2HAL_FILTER(filter);
}

/**
  * @}
  */


/** @addtogroup TIM_Exported_Functions_Group9
  *  @{
  */

/**
  * @brief  Configure the slave mode controller.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a slave mode controller configuration structure.
  * @note   The selection of the event triggering the transfer of the preloaded
  *         slave mode configuration to the active register is done with
  *         @ref HAL_TIM_EnableSlaveModePreload().
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetSynchroSlave(hal_tim_handle_t *htim,
                                     const hal_tim_slave_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_INSTANCE(p_tim)));

  /* Check configuration parameters */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_MODE(p_config->mode)));
  ASSERT_DBG_PARAM((IS_TIM_TRIG_SEL(p_tim, p_config->trigger)));

  /* Make sure that a pulse trigger is not used
     in gated or combined gated + reset mode   */
  ASSERT_DBG_PARAM(IS_TIM_SLAVE_MODE_TRIGGER_VALID(p_config->mode,
                                                   p_config->trigger));

  LL_TIM_SetSlaveMode(p_tim, (uint32_t)p_config->mode);

  LL_TIM_SetTriggerInput(p_tim, (uint32_t)p_config->trigger);

  return HAL_OK;
}

/**
  * @brief  Get the slave mode controller configuration.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to the slave mode controller configuration structure.
  */
void HAL_TIM_GetSynchroSlave(const hal_tim_handle_t *htim,
                             hal_tim_slave_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_INSTANCE(p_tim)));

  p_config->mode = (hal_tim_slave_mode_t)LL_TIM_GetSlaveMode(p_tim);

  p_config->trigger = (hal_tim_trig_sel_t)LL_TIM_GetTriggerInput(p_tim);
}

/**
  * @brief  Set the trigger output source of master mode controller.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  trgo_src  Trigger-output source.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetTriggerOutput(hal_tim_handle_t *htim,
                                      hal_tim_trigger_output_source_t trgo_src)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a master timer */
  ASSERT_DBG_PARAM((IS_TIM_MASTER_INSTANCE(p_tim)));

  ASSERT_DBG_PARAM(IS_TIM_TRIGGER_OUTPUT_SOURCE(trgo_src));

  LL_TIM_SetTriggerOutput(p_tim, (uint32_t)trgo_src);

  return HAL_OK;
}

/**
  * @brief  Get the trigger output source of the master mode controller configuration.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_trigger_output_source_t  Trigger-output source.
  */
hal_tim_trigger_output_source_t HAL_TIM_GetTriggerOutput(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a master timer */
  ASSERT_DBG_PARAM((IS_TIM_MASTER_INSTANCE(p_tim)));

  return (hal_tim_trigger_output_source_t)LL_TIM_GetTriggerOutput(p_tim);
}

/**
  * @brief   Configure the trigger output2.
  * @param   htim      Pointer to the handle of the TIM instance.
  * @param   p_config  Pointer to a trigger output2 configuration structure.
  * @warning The postscaler is only applicable when tim_trgo2 transfers a pulse
  *          (reset, update, compare pulse). When the tim_trgo2 outputs a level-based information
  *          (compare signal or enable bit for gated mode), the postscaler must be set set to 0.
  * @retval  HAL_OK
  * @retval  HAL_INVALID_PARAM  Input parameter is invalid
  *                             (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetConfigTriggerOutput2(hal_tim_handle_t *htim,
                                             hal_tim_trigger_output2_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

  ASSERT_DBG_PARAM(IS_TIM_TRIGGER_OUTPUT2_SOURCE(p_config->trgo2_src));

  ASSERT_DBG_PARAM(IS_TIM_TRIGGER_OUTPUT2_PSC(p_config->postscaler));

  LL_TIM_SetTriggerOutput2(p_tim, (uint32_t)p_config->trgo2_src);

  /* Set trgo2 postscaler only for specific sources */
  if (IS_TIM_TRIGGER_OUTPUT2_PSC_SOURCE(p_config->trgo2_src))
  {
    LL_TIM_SetTriggerOutput2Postscaler(p_tim, p_config->postscaler);
  }
  else
  {
    LL_TIM_SetTriggerOutput2Postscaler(p_tim, 0U);
  }

  return HAL_OK;
}

/**
  * @brief  Get the trigger output2 configuration.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a trgo2 configuration structure.
  */
void HAL_TIM_GetConfigTriggerOutput2(const hal_tim_handle_t *htim,
                                     hal_tim_trigger_output2_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

  p_config->trgo2_src = (hal_tim_trigger_output2_source_t)LL_TIM_GetTriggerOutput2(p_tim);

  p_config->postscaler = LL_TIM_GetTriggerOutput2Postscaler(p_tim);
}

/**
  * @brief  Set the trigger output2 source of the master mode controller.
  * @param  htim       Pointer to the handle of the TIM instance.
  * @param  trgo2_src  Trigger-output2 source.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetTriggerOutput2(hal_tim_handle_t *htim,
                                       hal_tim_trigger_output2_source_t trgo2_src)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

