MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  ASSERT_DBG_PARAM(IS_TIM_TRIGGER_OUTPUT2_SOURCE(trgo2_src));

  LL_TIM_SetTriggerOutput2(p_tim, (uint32_t)trgo2_src);

  return HAL_OK;
}

/**
  * @brief  Get the trigger output2 source of the master mode controller.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_trigger_output2_source_t  Trigger-output2 source.
  */
hal_tim_trigger_output2_source_t HAL_TIM_GetTriggerOutput2(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

  return (hal_tim_trigger_output2_source_t)LL_TIM_GetTriggerOutput2(p_tim);
}

/**
  * @brief   Set the trigger output2 postscaler of the master mode controller.
  * @param   htim        Pointer to the handle of the TIM instance.
  * @param   postscaler  Trigger-output2 postscaler (number between 0x00 and 0x1F).
  * @warning The postscaler is only applicable when tim_trgo2 transfers a pulse
  *          (reset, update, compare pulse). When the tim_trgo2 outputs a level-based information
  *          (compare signal or enable bit for gated mode), the postscaler must be set set to 0.
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_SetTriggerOutput2Postscaler(hal_tim_handle_t *htim,
                                                 uint32_t postscaler)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

  ASSERT_DBG_PARAM(IS_TIM_TRIGGER_OUTPUT2_PSC(postscaler));

  LL_TIM_SetTriggerOutput2Postscaler(p_tim, postscaler);

  return HAL_OK;
}

/**
  * @brief  Get the trigger output2 postscaler of the master mode controller.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval uint32_t  Trigger-output2 postscaler (number between 0x00 and 0x1F).
  */
uint32_t HAL_TIM_GetTriggerOutput2Postscaler(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_TRGO2_INSTANCE(p_tim)));

  return LL_TIM_GetTriggerOutput2Postscaler(p_tim);
}

/**
  * @brief  Enable slave mode preload.
  * @param  htim         Pointer to the handle of the TIM instance.
  * @param  preload_src  Slave mode preload source.
  * @note   When slave mode preload is enabled, slave mode selection
  *         (TIMx_SMCR.SMS) preload value isn't taken into account immediately. \n
  *         It is loaded in the active register at next update event or at next
  *         index event as per chosen slave mode preload source.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableSlaveModePreload(hal_tim_handle_t *htim,
                                            const hal_tim_slave_mode_preload_src_t preload_src)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SMS_PRELOAD_INSTANCE(p_tim)));

  ASSERT_DBG_PARAM(IS_TIM_SLAVE_MODE_PRELOAD_SRC(preload_src));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_SetSMSPreloadSource(p_tim, (uint32_t)preload_src);

  LL_TIM_EnableSMSPreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable slave mode preload.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableSlaveModePreload(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SMS_PRELOAD_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_DisableSMSPreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether slave mode preload is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_slave_mode_preload_status_t  Slave Preload Status.
  */
hal_tim_slave_mode_preload_status_t HAL_TIM_IsEnabledSlaveModePreload(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SMS_PRELOAD_INSTANCE(p_tim)));

  return (hal_tim_slave_mode_preload_status_t)LL_TIM_IsEnabledSMSPreload(p_tim);
}

/**
  * @brief  Enable master-slave mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   When the Master/slave mode is enabled, the effect of an event on the
  *         trigger input (TRGI) is delayed to allow a perfect synchronization
  *         between the current timer and its slaves (through TRGO).
  *         It is not mandatory in case of timer synchronization mode.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableMasterSlaveMode(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_INSTANCE(p_tim)));

  LL_TIM_EnableMasterSlaveMode(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable master-slave mode.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableMasterSlaveMode(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_INSTANCE(p_tim)));

  LL_TIM_DisableMasterSlaveMode(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether Master/Slave mode is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_master_slave_mode_status_t  Master-slave mode status.
  */
hal_tim_master_slave_mode_status_t HAL_TIM_IsEnabledMasterSlaveMode(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check the instance can operate as a slave timer */
  ASSERT_DBG_PARAM((IS_TIM_SLAVE_INSTANCE(p_tim)));

