MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  return (hal_tim_master_slave_mode_status_t)LL_TIM_IsEnabledMasterSlaveMode(p_tim);
}

/**
  * @brief   Enable ADC synchronization.
  * @param   htim  Pointer to the handle of the TIM instance.
  * @note    It is mandatory to follow the procedure below to use the ADC synchronization:
  *           1. Enable the destination ADC clock.
  *           2. Configure the timer and set the ADSYNC bit.
  *           3. Configure the ADC and enable it (using ADSTART and/or JADSTART bits).
  *           4. Start the timer (with the CEN counter enable bit).
  * @warning The ADC synchronization feature must not be modified during run-time.
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_EnableADCSynchronization(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_ADC_SYNCHRO_INSTANCE(p_tim)));

  LL_TIM_EnableADCSynchronization(p_tim);

  return HAL_OK;
}

/**
  * @brief   Disable ADC synchronization.
  * @param   htim  Pointer to the handle of the TIM instance.
  * @warning The ADC synchronization feature must not be modified during run-time.
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_DisableADCSynchronization(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_ADC_SYNCHRO_INSTANCE(p_tim)));

  LL_TIM_DisableADCSynchronization(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether ADC synchronization is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_adc_synchronization_status_t  ADC synchronization status.
  */
hal_tim_adc_synchronization_status_t HAL_TIM_IsEnabledADCSynchronization(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_ADC_SYNCHRO_INSTANCE(p_tim)));

  return (hal_tim_adc_synchronization_status_t)LL_TIM_IsEnabledADCSynchronization(p_tim);
}

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group10
  *  @{
  */

/**
  * @brief   Set the OCRef clear source.
  * @param   htim    Pointer to the handle of the TIM instance.
  * @param   source  OCRef clear source.
  * @warning This function can only be used in specific output modes (output compare and PWM)
  *          configured in @ref HAL_TIM_OC_SetConfigCompareUnit().
  * @retval  HAL_OK
  */
hal_status_t HAL_TIM_SetOCRefClearSource(hal_tim_handle_t *htim,
                                         hal_tim_ocref_clr_src_t source)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Control that OCRefClear is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OCXREF_CLEAR_INSTANCE(p_tim)));

  ASSERT_DBG_PARAM((IS_TIM_OCREF_CLR_SRC(p_tim, source)));

  LL_TIM_SetOCRefClearInputSource(p_tim, (uint32_t)source);

  return HAL_OK;
}

/**
  * @brief  Get the OCRef clear source.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_ocref_clr_src_t  OCRef clear source.
  */
hal_tim_ocref_clr_src_t HAL_TIM_GetOCRefClearSource(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Control that OCRefClear is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OCXREF_CLEAR_INSTANCE(p_tim)));

  return (hal_tim_ocref_clr_src_t)LL_TIM_GetOCRefClearInputSource(p_tim);
}

/**
  * @brief  Enable clearing of the OCxRef signal by the OCRef clear input.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableCompareUnitOCRefClear(hal_tim_handle_t *htim,
                                                 hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Control that OCRefClear is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OCXREF_CLEAR_INSTANCE(p_tim)));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_EnableClear(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Disable clearing of the OCxRef signal by the OCRef clear input.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableCompareUnitOCRefClear(hal_tim_handle_t *htim,
                                                  hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Control that OCRefClear is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OCXREF_CLEAR_INSTANCE(p_tim)));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  LL_TIM_OC_DisableClear(p_tim, ll_tim_channels[compare_unit]);

  return HAL_OK;
}

/**
  * @brief  Tell whether OCxRef signal can be cleared by the OCRef clear input or not.
  * @param  htim          Pointer to the handle of the TIM instance.
  * @param  compare_unit  Output compare unit.
  * @retval hal_tim_ocref_clr_status_t  OCRefClear status.
  */
hal_tim_ocref_clr_status_t HAL_TIM_IsEnabledCompareUnitOCRefClear(const hal_tim_handle_t *htim,
                                                                  hal_tim_oc_compare_unit_t compare_unit)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Control that OCRefClear is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OCXREF_CLEAR_INSTANCE(p_tim)));

  /* Check if the compare unit is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_OC_COMPARE_UNIT(p_tim, compare_unit)));

  return (hal_tim_ocref_clr_status_t)LL_TIM_OC_IsEnabledClear(p_tim,
                                                              ll_tim_channels[compare_unit]);
}

/**
  *  @}
  */

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/** @addtogroup TIM_Exported_Functions_Group11
  *  @{
  */

/**
  * @brief Configure the DMA Burst.
  * @param htim      Pointer to the handle of the TIM instance.
  * @param p_config  Pointer to the DMA burst configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_SetConfigDMABurst(hal_tim_handle_t *htim,
                                       hal_tim_dmaburst_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_DMABURST_INSTANCE(p_tim));

