MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  ASSERT_DBG_PARAM(IS_TIM_DMABURST_BASE_ADDR_REG(p_config->address));
  ASSERT_DBG_PARAM(IS_TIM_DMABURST_SRC(p_tim, p_config->source));
  ASSERT_DBG_PARAM(IS_TIM_DMABURST_LENGTH(p_config->length));

  /* Save the DMA burst source in the handle for the DMA Burst start/stop operations */
  htim->dmaburst_source = (tim_dmaburst_source_t)p_config->source;

  LL_TIM_ConfigDMABurst(p_tim, (uint32_t)p_config->address,
                        (uint32_t)p_config->length,
                        (uint32_t)p_config->source);

  return HAL_OK;
}

/**
  * @brief Get the DMA Burst configuration.
  * @param htim      Pointer to the handle of the TIM instance.
  * @param p_config  Pointer to the DMA burst configuration structure to fill.
  */
void HAL_TIM_GetConfigDMABurst(const hal_tim_handle_t *htim,
                               hal_tim_dmaburst_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_DMABURST_INSTANCE(p_tim));

  uint32_t address;
  uint32_t length;
  uint32_t source;

  LL_TIM_GetConfigDMABurst(p_tim, &address, &length, &source);

  p_config->source = (hal_tim_dmaburst_source_t)source;
  p_config->address = (hal_tim_dmaburst_base_addr_reg_t)address;
  p_config->length = (hal_tim_dmaburst_length_t)length;
}

/**
  * @brief   Start the timer DMA Burst operation.
  * @param   htim                Pointer to the handle of the TIM instance.
  * @param   dmaburst_direction  DMA burst transfer direction.
  * @param   p_data              Pointer to the data buffer.
  * @param   size_byte           Number of byte data to transfer from memory to register.
  * @warning This function can only be called after DMA burst configuration, i.e.
  *          calling @ref HAL_TIM_SetConfigDMABurst().
  * @retval  HAL_OK
  * @retval  HAL_ERROR          Failed to start the DMA transfer.
  * @retval  HAL_INVALID_PARAM  Input parameter is invalid
  *                             (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_StartDMABurst(hal_tim_handle_t *htim,
                                   hal_tim_dmaburst_direction_t dmaburst_direction,
                                   const uint8_t *p_data,
                                   uint32_t size_byte)
{
  /* LUT to retrieve callbacks associated to the dma burst source
     (format: {half complete callback, complete callback}) */
  static const hal_dma_cb_t dma_burst_cb[][2] =
  {
    {TIM_DMAUpdateHalfCpltCallback, TIM_DMAUpdateCpltCallback},
    {TIM_DMACompareMatchHalfCpltCallback, TIM_DMACompareMatchCpltCallback},
    {TIM_DMACompareMatchHalfCpltCallback, TIM_DMACompareMatchCpltCallback},
    {TIM_DMACompareMatchHalfCpltCallback, TIM_DMACompareMatchCpltCallback},
    {TIM_DMACompareMatchHalfCpltCallback, TIM_DMACompareMatchCpltCallback},
    {TIM_DMACommutationHalfCpltCallback, TIM_DMACommutationCpltCallback},
    {TIM_DMATriggerHalfCpltCallback, TIM_DMATriggerCpltCallback}
  };
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_data != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM(IS_TIM_DMABURST_INSTANCE(p_tim));

  ASSERT_DBG_PARAM(IS_TIM_DMABURST_DIR(dmaburst_direction));

  /* Retrieve the dma burst source configured from the handle */
  tim_dmaburst_source_t dma_burst_src = htim->dmaburst_source;

  /* Check that the retrieved dma burst source is correct */
  ASSERT_DBG_PARAM(IS_TIM_DMABURST_SRC(p_tim, (hal_tim_dmaburst_source_t)dma_burst_src));

  /* Calculate the dma request associated to the dma burst source
     (-1U because dma burst source starts at 1 (0 is reserved)) */
  hal_tim_dma_index_t dma_index = (hal_tim_dma_index_t)(uint32_t)(((uint32_t)dma_burst_src \
                                                                   >> TIM_DMABURST_DMAINDEX_SHIFT) - 1U);

  hal_dma_handle_t *hdma = htim->hdma[dma_index];
  ASSERT_DBG_PARAM((hdma != NULL));

  /* Set DMA channel callback function pointers */
  hdma->p_xfer_halfcplt_cb = dma_burst_cb[dma_index][0];
  hdma->p_xfer_cplt_cb = dma_burst_cb[dma_index][1];
  hdma->p_xfer_error_cb = TIM_DMAErrorCallback;
  hdma->p_xfer_abort_cb = TIM_DMAStopCallback;

  if ((dma_index >= HAL_TIM_DMA_ID_CC1) && (dma_index <= HAL_TIM_DMA_ID_CC4))
  {
    /* Calculate the tim channel associated to the dma index */
    hal_tim_channel_t channel = (hal_tim_channel_t)((uint32_t)((uint32_t)dma_index - (uint32_t)HAL_TIM_DMA_ID_CC1));

    if (TIM_IS_INPUT_CHANNEL(p_tim, channel))
    {
      /* Use capture callbacks if the channel is in input mode
         (compare callbacks by default) */
      hdma->p_xfer_halfcplt_cb = TIM_DMACaptureHalfCpltCallback;
      hdma->p_xfer_cplt_cb = TIM_DMACaptureCpltCallback;
    }
  }

  /* Enable the DMA request */
  uint32_t dma_req = LL_TIM_DIER_UDE << (uint32_t)dma_index;

  LL_TIM_EnableDMAReq(p_tim, dma_req);

  uint32_t src_addr;
  uint32_t dest_addr;

  /* Update the source and destination addresses depending
     the DMA burst transfer direction */
  if (dmaburst_direction == HAL_TIM_DMABURST_READ)
  {
    src_addr = (uint32_t)((uint32_t *)(&p_tim->DMAR));
    dest_addr = (uint32_t)p_data;
  }
  else
  {
    src_addr = (uint32_t)p_data;
    dest_addr = (uint32_t)((uint32_t *)(&p_tim->DMAR));
  }

  /* Start DMA transfer in interrupt mode */
  if (HAL_DMA_StartPeriphXfer_IT_Opt(hdma, src_addr,
                                     dest_addr, size_byte,
                                     HAL_TIM_OPT_DMA_IT_DEFAULT) != HAL_OK)
  {
#if defined (USE_HAL_TIM_GET_LAST_ERRORS) && (USE_HAL_TIM_GET_LAST_ERRORS == 1)
    htim->last_error_codes |= HAL_TIM_ERROR_DMA;
#endif /* USE_HAL_TIM_GET_LAST_ERRORS */

    return HAL_ERROR;
  }

  return HAL_OK;
}


/**
  * @brief  Stop the timer DMA Burst operation.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_StopDMABurst(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM(IS_TIM_DMABURST_INSTANCE(TIM_INSTANCE(htim)));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Retrieve the dma burst source configured */
  tim_dmaburst_source_t dma_burst_src = htim->dmaburst_source;

  /* Check that the retrieved dma burst source is correct */
  ASSERT_DBG_PARAM(IS_TIM_DMABURST_SRC(p_tim, (hal_tim_dmaburst_source_t)dma_burst_src));

