MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /* Calculate the dma request associated to the dma burst source
     (-1U because dma burst source starts at 1 (0 is reserved)) */
  hal_tim_dma_index_t dma_index = (hal_tim_dma_index_t)(uint32_t)(((uint32_t)dma_burst_src \
                                                                   >> TIM_DMABURST_DMAINDEX_SHIFT) - 1U);

  /* Calculate the dma request associated to the dma burst source */
  uint32_t dma_req = LL_TIM_DIER_UDE << (uint32_t)dma_index;

  hal_dma_handle_t *hdma = htim->hdma[dma_index];
  ASSERT_DBG_PARAM((hdma != NULL));

  (void)HAL_DMA_Abort_IT(hdma);

  LL_TIM_DisableDMAReq(p_tim, dma_req);

  return HAL_OK;
}


/**
  *  @}
  */
#endif /* USE_HAL_TIM_DMA */


/** @addtogroup TIM_Exported_Functions_Group12
  *  @{
  */

/**
  * @brief  Configure the break input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input to configure.
  * @param  p_config  Pointer to the break input configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_BREAK_SetConfigInput(hal_tim_handle_t *htim,
                                          hal_tim_break_input_id_t brkin,
                                          const hal_tim_break_input_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check break input configuration parameters */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_POLARITY(p_config->polarity)));
  ASSERT_DBG_PARAM((IS_TIM_FILTER(p_config->filter)));
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_MODE(p_config->mode)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  if (brkin == HAL_TIM_BREAK_INPUT_1)
  {
    LL_TIM_ConfigBRK(p_tim,
                     TIM_BREAK_HAL2LL_POLARITY(p_config->polarity),
                     TIM_BREAK_HAL2LL_FILTER(p_config->filter),
                     TIM_BREAK_HAL2LL_MODE(p_config->mode));
  }
  else
  {
    LL_TIM_ConfigBRK2(p_tim,
                      TIM_BREAK2_HAL2LL_POLARITY(p_config->polarity),
                      TIM_BREAK2_HAL2LL_FILTER(p_config->filter),
                      TIM_BREAK2_HAL2LL_MODE(p_config->mode));
  }

  return HAL_OK;
}

/**
  * @brief  Get the configuration of the break input.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input of interest.
  * @param  p_config  Pointer to the break input configuration structure.
  */
void HAL_TIM_BREAK_GetConfigInput(const hal_tim_handle_t *htim,
                                  hal_tim_break_input_id_t brkin,
                                  hal_tim_break_input_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  uint32_t polarity;
  uint32_t filter;
  uint32_t mode;

  if (brkin == HAL_TIM_BREAK_INPUT_1)
  {
    LL_TIM_GetConfigBRK(p_tim, &polarity, &filter, &mode);

    p_config->polarity = TIM_BREAK_LL2HAL_POLARITY(polarity);
    p_config->filter = TIM_BREAK_LL2HAL_FILTER(filter);
  }
  else
  {
    LL_TIM_GetConfigBRK2(p_tim, &polarity, &filter, &mode);

    p_config->polarity = TIM_BREAK2_LL2HAL_POLARITY(polarity);
    p_config->filter = TIM_BREAK2_LL2HAL_FILTER(filter);
  }

  p_config->mode = (mode != LL_TIM_BREAK_AFMODE_INPUT) ? \
                   HAL_TIM_BREAK_INPUT_MODE_BIDIRECTIONAL : HAL_TIM_BREAK_INPUT_MODE_INPUT;
}

/**
  * @brief  Configure the timer's break input polarity.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input to configure.
  * @param  polarity  Polarity for the break input.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_SetInputPolarity(hal_tim_handle_t *htim,
                                            hal_tim_break_input_id_t brkin,
                                            hal_tim_break_input_polarity_t polarity)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_POLARITY(polarity)));

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  LL_TIM_SetBreakInputPolarity(p_tim, (uint32_t)brkin,
                               TIM_BRK_BRK2_HAL2LL_POLARITY((uint32_t)brkin,
                                                            (uint32_t)polarity));

  return HAL_OK;
}

/**
  * @brief  Get the polarity of the timer's break input.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input of interest.
  * @retval hal_tim_break_input_polarity_t  Polarity of the break input.
  */
hal_tim_break_input_polarity_t HAL_TIM_BREAK_GetInputPolarity(const hal_tim_handle_t *htim,
                                                              hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  uint32_t polarity = LL_TIM_GetBreakInputPolarity(p_tim, (uint32_t)brkin);

  return TIM_BRK_BRK2_LL2HAL_POLARITY((uint32_t)brkin, (uint32_t)polarity);
}

/**
  * @brief  Configure the timer's break input filter.
  * @param  htim    Pointer to the handle of the TIM instance.
  * @param  brkin   The break input to configure.
  * @param  filter  Filter to apply to the break input.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_SetInputFilter(hal_tim_handle_t *htim,
                                          hal_tim_break_input_id_t brkin,
                                          hal_tim_filter_t filter)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  ASSERT_DBG_PARAM((IS_TIM_FILTER(filter)));

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  LL_TIM_SetBreakInputFilter(p_tim, (uint32_t)brkin,
                             TIM_BRK_BRK2_HAL2LL_FILTER((uint32_t)brkin,
                                                        (uint32_t)filter));

  return HAL_OK;
}

/**
  * @brief  Get the filter applied to the timer's break input.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input of interest.
  * @retval hal_tim_filter_t  Filter applied to the break input.
  */
hal_tim_filter_t HAL_TIM_BREAK_GetInputFilter(const hal_tim_handle_t *htim,
                                              hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  uint32_t filter = LL_TIM_GetBreakInputFilter(p_tim, (uint32_t)brkin);

  return TIM_BRK_BRK2_LL2HAL_FILTER((uint32_t)brkin, filter);
}

/**
  * @brief  Configure the timer's break input AF mode (input versus bidirectional).
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input to configure.
  * @param  mode   Mode (input or bidirectional) for the break input.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_SetInputMode(hal_tim_handle_t *htim,
                                        hal_tim_break_input_id_t brkin,
                                        hal_tim_break_input_mode_t mode)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_MODE(mode)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  LL_TIM_SetBreakInputAFMode(p_tim, (uint32_t)brkin,
                             TIM_BRK_BRK2_HAL2LL_MODE((uint32_t)brkin,
                                                      (uint32_t)mode));

  return HAL_OK;
}

/**
  * @brief  Get the timer's break input mode.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input to configure.
  * @retval hal_tim_break_input_mode_dir_t  Break input mode.
  */
hal_tim_break_input_mode_t HAL_TIM_BREAK_GetInputMode(const hal_tim_handle_t *htim,
                                                      hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

