MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  return TIM_BRK_BRK2_LL2HAL_MODE(brkin,
                                  LL_TIM_GetBreakInputAFMode(p_tim,
                                                             (uint32_t)brkin));
}

/**
  * @brief  Enable a break input.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input to enable.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_EnableInput(hal_tim_handle_t *htim,
                                       hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  LL_TIM_EnableBreakInput(p_tim, (uint32_t)brkin);

  return HAL_OK;
}

/**
  * @brief  Disable a break input.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input to disable.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_DisableInput(hal_tim_handle_t *htim,
                                        hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  LL_TIM_DisableBreakInput(p_tim, (uint32_t)brkin);

  return HAL_OK;
}

/**
  * @brief  Tell whether a break input is enabled or not.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input.
  * @retval hal_tim_break_input_status_t  Status of the break input
  */
hal_tim_break_input_status_t HAL_TIM_BREAK_IsEnabledInput(const hal_tim_handle_t *htim,
                                                          hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  return (hal_tim_break_input_status_t)LL_TIM_IsEnabledBreakInput(p_tim,
                                                                  (uint32_t)brkin);
}

/**
  * @brief  Re-arm the break input after a break event.
  *         This function must be called to re-activate the break circuitry
  *         after a break (break2) event.
  * @param  htim   Pointer to the handle of the TIM instance.
  * @param  brkin  The break input to re-arm.
  * @note   The system break condition must have disappeared and the system
  *         break flag must have been cleared.
  * @note   If this function succeeds then @ref HAL_TIM_BREAK_EnableMainOutput
  *         can be called to re-enable the outputs.
  * @retval HAL_OK
  * @retval HAL_ERROR  Break input condition still present.
  */
hal_status_t HAL_TIM_BREAK_RearmInput(hal_tim_handle_t *htim,
                                      hal_tim_break_input_id_t brkin)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BRKIN_INSTANCE(p_tim, brkin)));

  /* Note: release of the output control is meaningful only in
     bidirectional mode but it is done by default. */

  /* Release the output control */
  LL_TIM_DisarmBreakInput(p_tim, (uint32_t)brkin);

  /* Break input is re-armed automatically by hardware.
     Poll to check whether application break condition disappeared. */
  uint32_t tickstart = HAL_GetTick();
  while (LL_TIM_IsDisarmedBreakInput(p_tim, (uint32_t)brkin) != 0U)
  {
    if (TIM_BREAK_INPUT_REARM_TIMEOUT_PERIOD_EXPIRED(HAL_GetTick() - tickstart))
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_TIM_IsDisarmedBreakInput(p_tim, (uint32_t)brkin) != 0U)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Configure the break input source polarity.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input to configure.
  * @param  brkinsrc  This parameter can be one of the following values: \n
  *         The description below summarizes "Timer Instance" and "BREAK(2) input source" possibilities:
  *
  *         TIM1: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM1_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            @arg @ref HAL_TIM_BRK2_TIM1_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM8: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM8_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            @arg @ref HAL_TIM_BRK2_TIM8_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM15: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM15_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP4_OUT (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM16_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM17_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM20_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP4_OUT (*)
  * @endif
  *
  *            @arg @ref HAL_TIM_BRK2_TIM20_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices. \n
  *         (**) Timer instance not available on all devices. \n
  * @param  polarity  Polarity for the break input source.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_SetInputSourcePolarity(hal_tim_handle_t *htim,
                                                  hal_tim_break_input_id_t brkin,
                                                  uint32_t brkinsrc,
                                                  hal_tim_break_input_src_polarity_t polarity)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  /* Check if the instance supports the break input source */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_SRC(p_tim, brkin, brkinsrc)));
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_SRC_POLARITY(brkinsrc, polarity)));

  LL_TIM_SetBreakInputSourcePolarity(p_tim, (uint32_t)brkin,
                                     (uint32_t)brkinsrc, (uint32_t)polarity);
  return HAL_OK;
}

/**
  * @brief  Get the polarity of the break input source.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input of interest.
  * @param  brkinsrc  This parameter can be one of the following values: \n
  *         The description below summarizes "Timer Instance" and "BREAK(2) input source" possibilities:
  *
  *         TIM1: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM1_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM1_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            @arg @ref HAL_TIM_BRK2_TIM1_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM1_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM8: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM8_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM8_COMP4_OUT (*)
  * @endif
  *
  * @if TIM20
  *            @arg @ref HAL_TIM_BRK2_TIM8_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM8_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         TIM15: one of the following values:
  *            @arg @ref HAL_TIM_BRK_TIM15_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP1_OUT
  * @if COMP2
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP2_OUT (*)
  * @endif
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM15_COMP4_OUT (*)
  * @endif
  *
  * @if TIM16
  *         TIM16: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM16_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM16_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM17
  *         TIM17: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM17_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM17_COMP4_OUT (*)
  * @endif
  * @endif
  *
  * @if TIM20
  *         TIM20: one of the following values: (**)
  *            @arg @ref HAL_TIM_BRK_TIM20_GPIO
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK_TIM20_COMP4_OUT (*)
  * @endif
  *
  *            @arg @ref HAL_TIM_BRK2_TIM20_GPIO
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP1_OUT
  * @if COMP3
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP2_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP3_OUT (*)
  *            @arg @ref HAL_TIM_BRK2_TIM20_COMP4_OUT (*)
  * @endif
  * @endif
  *
  *         (*)  Value not defined in all devices. \n
  *         (**) Timer instance not available on all devices. \n
  * @retval hal_tim_break_input_src_polarity_t  The break input source polarity.
  */
hal_tim_break_input_src_polarity_t HAL_TIM_BREAK_GetInputSourcePolarity(const hal_tim_handle_t *htim,
                                                                        hal_tim_break_input_id_t brkin,
                                                                        uint32_t brkinsrc)
{
  ASSERT_DBG_PARAM((htim != NULL));

  /* Check the global state */
  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  const tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  /* Check if the instance supports the break input source */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_SRC(p_tim, brkin, brkinsrc)));

