MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  return ((hal_tim_break_input_src_polarity_t)
          LL_TIM_GetBreakInputSourcePolarity(p_tim, (uint32_t)brkin,
                                             (uint32_t)brkinsrc));
}

/**
  * @brief  Enable a break input source.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input.
  * @param  brkinsrc  This parameter can be a combination of @ref TIM_Break_Input_Sources values.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_EnableInputSource(hal_tim_handle_t *htim,
                                             hal_tim_break_input_id_t brkin,
                                             uint32_t brkinsrc)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  /* Check if the instance supports the break input source(s) */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ALL_SRC(p_tim, brkin, brkinsrc)));

  LL_TIM_EnableBreakInputSource(p_tim, (uint32_t)brkin, (uint32_t)brkinsrc);

  return HAL_OK;
}

/**
  * @brief  Disable a break input source.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input.
  * @param  brkinsrc  This parameter can be a combination of @ref TIM_Break_Input_Sources values.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_DisableInputSource(hal_tim_handle_t *htim,
                                              hal_tim_break_input_id_t brkin,
                                              uint32_t brkinsrc)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  /* Check if the instance supports the break input source(s) */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ALL_SRC(p_tim, brkin, brkinsrc)));

  LL_TIM_DisableBreakInputSource(p_tim, (uint32_t)brkin, (uint32_t)brkinsrc);

  return HAL_OK;
}

/**
  * @brief  Tell whether a break input source is enabled or not.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  brkin     The break input.
  * @param  brkinsrc  This parameter can be one of @ref TIM_Break_Input_Sources values.
  * @retval hal_tim_break_input_src_status_t  Break input source status
  */
hal_tim_break_input_src_status_t HAL_TIM_BREAK_IsEnabledInputSource(const hal_tim_handle_t *htim,
                                                                    hal_tim_break_input_id_t brkin,
                                                                    uint32_t brkinsrc)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_ID(brkin)));
  /* Check if the instance supports the break input source */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INPUT_SRC(p_tim, brkin, brkinsrc)));

  return ((hal_tim_break_input_src_status_t)
          LL_TIM_IsEnabledBreakInputSource(p_tim, (uint32_t)brkin,
                                           (uint32_t)brkinsrc));
}

/**
  * @brief  Enable main output.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_EnableMainOutput(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_EnableAllOutputs(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable main output.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_DisableMainOutput(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_DisableAllOutputs(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether the main output is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_break_main_output_status_t  Main output status.
  */
hal_tim_break_main_output_status_t HAL_TIM_BREAK_IsEnabledMainOutput(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_break_main_output_status_t)LL_TIM_IsEnabledAllOutputs(p_tim);
}

/**
  * @brief  Enable automatic output.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   Main output is cleared by hardware as soon as one of the break inputs
  *         is active. \n
  *         When the break input is not active anymore, main output is
  *         automatically set by hardware if automatic output is enabled.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_EnableAutomaticOutput(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_EnableAutomaticOutput(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable automatic output.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_DisableAutomaticOutput(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_DisableAutomaticOutput(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether the automatic output is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_break_automatic_output_status_t  Status of the automatic output.
  */
hal_tim_break_automatic_output_status_t HAL_TIM_BREAK_IsEnabledAutomaticOutput(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_break_automatic_output_status_t)LL_TIM_IsEnabledAutomaticOutput(p_tim);
}

/**
  * @brief  Configure the delay duration for a specific break delay.
  * @param  htim         Pointer to the handle of the TIM instance.
  * @param  break_delay  Output channel break delay.
  * @param  delay        Delay duration (number between 0x00 and 0xFF).
  * @note   Delayed break (DBKx[7:0]) preload value isn't taken into account
  *         immediately. It is loaded in the active register at next update event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_BREAK_SetBreakDelay(hal_tim_handle_t *htim,
                                         hal_tim_break_delay_t break_delay,
                                         uint32_t delay)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  /* Check that it is a break delay */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_DELAY(break_delay)));

  /* Check the delay duration */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_DELAY_DURATION(delay)));

  LL_TIM_SetBreakDelay(p_tim, (uint32_t)break_delay, delay);

  return HAL_OK;
}

/**
  * @brief  Get the delay duration for a specific break delay.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  break_delay Output channel break delay. \n
  * @retval uint32_t  Delay duration (number between 0x00 and 0xFF).
  */
uint32_t HAL_TIM_BREAK_GetBreakDelay(const hal_tim_handle_t *htim,
                                     hal_tim_break_delay_t break_delay)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  /* Check that it is a break delay */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_DELAY(break_delay)));

