MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  return LL_TIM_GetBreakDelay(p_tim, (uint32_t)break_delay);
}

/**
  * @brief  Configure the off-state of the timer's outputs for both RUN mode
  *         (when main output is enabled) and IDLE mode (when main output is disabled).
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a off states configuration structure.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM  Input parameter is invalid
  *                            (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_BREAK_SetOutputOffStates(hal_tim_handle_t *htim,
                                              const hal_tim_off_states_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that off-state (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  /* Check off-state configuration parameters */
  ASSERT_DBG_PARAM(IS_TIM_OFF_STATE_IDLE(p_config->off_state_idle));
  ASSERT_DBG_PARAM(IS_TIM_OFF_STATE_RUN(p_config->off_state_run));

  LL_TIM_SetOffStates(p_tim, (uint32_t)p_config->off_state_idle,
                      (uint32_t)p_config->off_state_run);

  return HAL_OK;
}

/**
  * @brief  Get the off-state configuration.
  * @param  htim      Pointer to the handle of the TIM instance.
  * @param  p_config  Pointer to a off states configuration structure.
  */
void HAL_TIM_BREAK_GetOutputOffStates(const hal_tim_handle_t *htim,
                                      hal_tim_off_states_config_t *p_config)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that off-state (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  uint32_t off_state_run;
  uint32_t off_state_idle;

  LL_TIM_GetOffStates(p_tim, &off_state_idle, &off_state_run);

  p_config->off_state_idle = (hal_tim_off_state_idle_t)off_state_idle;
  p_config->off_state_run = (hal_tim_off_state_run_t)off_state_run;
}

/**
  * @brief  Indicate the global output state when a break or break2 event
  *         occurred, to discriminate the source.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_output_disable_status_t  Output disable status.
  */
hal_tim_output_disable_status_t HAL_TIM_BREAK_GetOutputDisableStatus(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check if the instance supports break input */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_output_disable_status_t)LL_TIM_GetOutputDisableStatus(p_tim);
}
/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group13
  *  @{
  */
/**
  * @brief  Configure the deadtime inserted between two complementary outputs.
  * @param  htim                   Pointer to the handle of the TIM instance.
  * @param  rising_edge_deadtime   Deadtime value for rising edge (number between 0x00 and 0xFF)
  * @param  falling_edge_deadtime  Deadtime value for falling edge (number between 0x00 and 0xFF)
  * @note   For asymmetrical deadtime HAL_TIM_EnableAsymmetricalDeadTime must be called.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetDeadtime(hal_tim_handle_t *htim,
                                 uint32_t rising_edge_deadtime,
                                 uint32_t falling_edge_deadtime)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  /* Check the deadtime values */
  ASSERT_DBG_PARAM((IS_TIM_DEADTIME(rising_edge_deadtime)));
  ASSERT_DBG_PARAM((IS_TIM_DEADTIME(falling_edge_deadtime)));

  LL_TIM_OC_SetDeadTime(p_tim, rising_edge_deadtime);
  LL_TIM_SetFallingDeadTime(p_tim, falling_edge_deadtime);

  return HAL_OK;
}

/**
  * @brief  Get the deadtime configuration.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  p_rising_edge_deadtime   Pointer to a storage for the deadtime value for rising edge
  *                                  (number between 0x00 and 0xFF).
  * @param  p_falling_edge_deadtime  Pointer to a storage for the deadtime value for falling edge
  *                                  (number between 0x00 and 0xFF).
  */
void HAL_TIM_GetDeadtime(const hal_tim_handle_t *htim,
                         uint32_t *p_rising_edge_deadtime,
                         uint32_t *p_falling_edge_deadtime)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_PARAM((p_rising_edge_deadtime != NULL));
  ASSERT_DBG_PARAM((p_falling_edge_deadtime != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  *p_rising_edge_deadtime = LL_TIM_OC_GetDeadTime(p_tim);
  *p_falling_edge_deadtime = LL_TIM_GetFallingDeadTime(p_tim);
}

/**
  * @brief  Enable the deadtime configuration preload
  *         (DTG[7:0] and DTGF[7:0] bitfields).
  * @param  htim  Pointer to the handle of the TIM instance.
  * @note   When deadtime preload is enabled, rising and falling deatime
  *         (TIMx_BDTR.DTG and TIMx_DTR2.DTGF) preload values aren't taken
  *         into account immediately. \n
  *         They are loaded in the active register at next update event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableDeadtimePreload(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

