MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  LL_TIM_EnableDeadTimePreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable the deadtime configuration preload.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableDeadtimePreload(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_DisableDeadTimePreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether the deadtime configuration preload is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_deadtime_preload_status_t  Deadtime preload status.
  */
hal_tim_deadtime_preload_status_t HAL_TIM_IsEnabledDeadtimePreload(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_deadtime_preload_status_t)LL_TIM_IsEnabledDeadTimePreload(p_tim);
}

/**
  * @brief  Enable asymmetrical deadtime.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableAsymmetricalDeadtime(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_EnableAsymmetricalDeadTime(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable asymmetrical deadtime.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableAsymmetricalDeadtime(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  LL_TIM_DisableAsymmetricalDeadTime(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether asymmetrical deadtime is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_asymmetrical_deadtime_status_t  Asymmetrical deadtime status.
  */
hal_tim_asymmetrical_deadtime_status_t HAL_TIM_IsEnabledAsymmetricalDeadtime(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that deadtime (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  return (hal_tim_asymmetrical_deadtime_status_t)LL_TIM_IsEnabledAsymmetricalDeadTime(p_tim);
}

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group14
  *  @{
  */

/**
  * @brief  Set the timer lock level.
  * @param  htim        Pointer to the handle of the TIM instance.
  * @param  lock_level  Lock level.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_SetLockLevel(hal_tim_handle_t *htim,
                                  hal_tim_lock_level_t lock_level)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  ASSERT_DBG_PARAM(IS_TIM_LOCK_LEVEL(lock_level));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that lock (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  LL_TIM_CC_SetLockLevel(p_tim, (uint32_t)lock_level);

  return HAL_OK;
}

/**
  * @brief  Get the timer lock level.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_lock_level_t  Lock level.
  */
hal_tim_lock_level_t HAL_TIM_GetLockLevel(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check that lock (<=>break input) is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_BREAK_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_lock_level_t)LL_TIM_CC_GetLockLevel(p_tim);
}

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group15
  *  @{
  */

/**
  * @brief  Enable the commutation and set the commutation event source.
  * @param  htim                Pointer to the handle of the TIM instance.
  * @param  commutation_source  Commutation source.
  * @note    when commutation is enabled, CCxE, CCxNE and OCxM bit are preloaded. \n
  *          They are loaded in the active register when the commutation event occurs. \n
  *          Commutation event can be triggered by software or both by software and trigger
  *          input as per chosen commutation source.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_EnableCommutation(hal_tim_handle_t *htim,
                                       hal_tim_commutation_src_t commutation_source)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check commutation is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_COMMUTATION_EVENT_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Check commutation source */
  ASSERT_DBG_PARAM((IS_TIM_COMMUTATION_SRC(commutation_source)));

  /* Configure the commutation event source */
  LL_TIM_CC_SetUpdate(p_tim, (uint32_t)commutation_source);

  /* Enable the capture/compare control bits (CCxE, CCxNE and OCxM) preload */
  LL_TIM_CC_EnablePreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Disable the commutation feature.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_DisableCommutation(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check commutation is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_COMMUTATION_EVENT_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state, HAL_TIM_STATE_IDLE);

  /* Disable the capture/compare control bits (CCxE, CCxNE and OCxM) preload */
  LL_TIM_CC_DisablePreload(p_tim);

  return HAL_OK;
}

/**
  * @brief  Tell whether the commutation is enabled or not.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_commutation_status_t  Status (Enabled/Disabled) of the commutation feature.
  */
hal_tim_commutation_status_t HAL_TIM_IsEnabledCommutation(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check commutation is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_COMMUTATION_EVENT_INSTANCE(p_tim)));

  return (hal_tim_commutation_status_t)LL_TIM_CC_IsEnabledPreload(p_tim);
}

/**
  * @brief  Get the commutation event source.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval hal_tim_commutation_src_t  Source (software only or software and trigger input)
  *                                    of the commutation feature.
  */
hal_tim_commutation_src_t HAL_TIM_GetCommutationSource(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  /* Check commutation is supported by the instance */
  ASSERT_DBG_PARAM((IS_TIM_COMMUTATION_EVENT_INSTANCE(p_tim)));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  return (hal_tim_commutation_src_t)LL_TIM_CC_GetUpdate(p_tim);
}

/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group16
  *  @{
  */

/**
  * @brief  Generate a software event for the timer.
  * @param  htim         Pointer to the handle of the TIM instance.
  * @param  sw_event_id  The source of the event.
  * @retval HAL_OK
  */
hal_status_t HAL_TIM_GenerateEvent(hal_tim_handle_t *htim,
                                   hal_tim_sw_event_id_t sw_event_id)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

