MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  ASSERT_DBG_PARAM((IS_TIM_SW_EVENT_ID(p_tim, sw_event_id)));

  ASSERT_DBG_STATE(htim->global_state,
                   (HAL_TIM_STATE_IDLE | HAL_TIM_STATE_ACTIVE));

  LL_TIM_GenerateEvent(p_tim, (uint32_t)sw_event_id);

  return HAL_OK;
}
/**
  *  @}
  */


/** @addtogroup TIM_Exported_Functions_Group17
  *  @{
  */

/**
  * @brief This function handles TIM generic interrupts requests.
  * @param htim  Pointer to the handle of the TIM instance.
  * @note  Handle all the timer interrupt requests.
  */
void HAL_TIM_IRQHandler(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  const uint32_t flag_status = LL_TIM_READ_REG(p_tim, SR);
  const uint32_t it_sources = LL_TIM_READ_REG(p_tim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND between flags status and interrupts
                                                                   sources enabled (for registers bitfields aligned) */
  const uint32_t break_it_source = (uint32_t)STM32_IS_BIT_SET(it_sources, LL_TIM_DIER_BIE); /* for break registers
                                                                                               bitfields not aligned */

  if ((flag_status_masked & LL_TIM_SR_UIF) != 0UL)
  {
    LL_TIM_ClearFlag_UPDATE(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->update_callback(htim);
#else
    HAL_TIM_UpdateCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_CC1IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC1(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_1))
    {
      /* Channel 1 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_1);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 1 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_1);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC2IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC2(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_2))
    {
      /* Channel 2 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_2);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 2 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_2);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC3IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC3(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_3))
    {
      /* Channel 3 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_3);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_3);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 3 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_3);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_3);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC4IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC4(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_4))
    {
      /* Channel 4 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_4);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_4);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 4 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_4);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_4);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_SBIF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_SYSBRK(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->system_break_callback(htim);
#else
    HAL_TIM_SystemBreakCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_BGF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_BG(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->software_break_callback(htim, HAL_TIM_BREAK_INPUT_1);
#else
    HAL_TIM_SoftwareBreakCallback(htim, HAL_TIM_BREAK_INPUT_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_B2GF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_B2G(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->software_break_callback(htim, HAL_TIM_BREAK_INPUT_2);
#else
    HAL_TIM_SoftwareBreakCallback(htim, HAL_TIM_BREAK_INPUT_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_BIF) != 0UL)
  {
    LL_TIM_ClearFlag_BRK(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->break_callback(htim);
#else
    HAL_TIM_BreakCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

