MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  if (STM32_IS_BIT_SET(flag_status, TIM_SR_B2IF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_BRK2(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->break2_callback(htim);
#else
    HAL_TIM_Break2Callback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_TERRF) != 0UL)
  {
    LL_TIM_ClearFlag_TERR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->transition_error_callback(htim);
#else
    HAL_TIM_TransitionErrorCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_IERRF) != 0UL)
  {
    LL_TIM_ClearFlag_IERR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->index_error_callback(htim);
#else
    HAL_TIM_IndexErrorCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_TIF) != 0UL)
  {
    LL_TIM_ClearFlag_TRIG(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->trigger_callback(htim);
#else
    HAL_TIM_TriggerCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_COMIF) != 0UL)
  {
    LL_TIM_ClearFlag_COM(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->commutation_callback(htim);
#else
    HAL_TIM_CommutationCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_DIRF) != 0UL)
  {
    LL_TIM_ClearFlag_DIR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->direction_change_callback(htim);
#else
    HAL_TIM_DirectionChangeCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_IDXF) != 0UL)
  {
    LL_TIM_ClearFlag_IDX(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->encoder_index_callback(htim);
#else
    HAL_TIM_EncoderIndexCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }
}

/**
  * @brief Timer update interrupt handler.
  * @param htim  Pointer to the handle of the TIM instance.
  */
void HAL_TIM_UPD_IRQHandler(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  if (LL_TIM_IsEnabledIT_UPDATE(p_tim) == 1U)
  {
    LL_TIM_ClearFlag_UPDATE(p_tim);
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->update_callback(htim);
#else
    HAL_TIM_UpdateCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }
}

/**
  * @brief Timer Capture/Compare interrupt handler.
  * @param htim  Pointer to the handle of the TIM instance.
  */
void HAL_TIM_CC_IRQHandler(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  const uint32_t flag_status = LL_TIM_READ_REG(p_tim, SR);
  const uint32_t it_sources = LL_TIM_READ_REG(p_tim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND between flags status and interrupts
                                                                   sources enabled (for registers bitfields aligned) */

  if ((flag_status_masked & LL_TIM_SR_CC1IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC1(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_1))
    {
      /* Channel 1 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_1);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 1 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_1);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC2IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC2(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_2))
    {
      /* Channel 2 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_2);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 2 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_2);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC3IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC3(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_3))
    {
      /* Channel 3 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_3);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_3);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 3 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_3);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_3);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }

  if ((flag_status_masked & LL_TIM_SR_CC4IF) != 0UL)
  {
    LL_TIM_ClearFlag_CC4(p_tim);

    if (TIM_IS_INPUT_CHANNEL(p_tim, HAL_TIM_CHANNEL_4))
    {
      /* Channel 4 is configured as input */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->input_capture_callback(htim, HAL_TIM_CHANNEL_4);
#else
      HAL_TIM_InputCaptureCallback(htim, HAL_TIM_CHANNEL_4);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
    else
    {
      /* Channel 4 is configured as output */
#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
      htim->compare_match_callback(htim, HAL_TIM_CHANNEL_4);
#else
      HAL_TIM_CompareMatchCallback(htim, HAL_TIM_CHANNEL_4);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief Timer Break, Transition error and Index error interrupt handler.
  * @param htim  Pointer to the handle of the TIM instance.
  */
void HAL_TIM_BRK_TERR_IERR_IRQHandler(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  const uint32_t flag_status = LL_TIM_READ_REG(p_tim, SR);
  const uint32_t it_sources = LL_TIM_READ_REG(p_tim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND between flags status and interrupts
                                                                   sources enabled (for registers bitfields aligned) */
  const uint32_t break_it_source = (uint32_t)STM32_IS_BIT_SET(it_sources, LL_TIM_DIER_BIE); /* for break registers
                                                                                               bitfields not aligned */

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_SBIF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_SYSBRK(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->system_break_callback(htim);
#else
    HAL_TIM_SystemBreakCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

