MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_BGF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_BG(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->software_break_callback(htim, HAL_TIM_BREAK_INPUT_1);
#else
    HAL_TIM_SoftwareBreakCallback(htim, HAL_TIM_BREAK_INPUT_1);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_B2GF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_B2G(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->software_break_callback(htim, HAL_TIM_BREAK_INPUT_2);
#else
    HAL_TIM_SoftwareBreakCallback(htim, HAL_TIM_BREAK_INPUT_2);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_BIF) != 0UL)
  {
    LL_TIM_ClearFlag_BRK(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->break_callback(htim);
#else
    HAL_TIM_BreakCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if (STM32_IS_BIT_SET(flag_status, LL_TIM_SR_B2IF) && (break_it_source != 0U))
  {
    LL_TIM_ClearFlag_BRK2(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->break2_callback(htim);
#else
    HAL_TIM_Break2Callback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_TERRF) != 0UL)
  {
    LL_TIM_ClearFlag_TERR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->transition_error_callback(htim);
#else
    HAL_TIM_TransitionErrorCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_IERRF) != 0UL)
  {
    LL_TIM_ClearFlag_IERR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->index_error_callback(htim);
#else
    HAL_TIM_IndexErrorCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }
}

/**
  * @brief Timer Trigger, Commutation, Direction change and Index interrupt handler.
  * @param htim  Pointer to the handle of the TIM instance.
  */
void HAL_TIM_TRGI_COM_DIR_IDX_IRQHandler(hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  tim_t *p_tim = TIM_INSTANCE(htim);

  const uint32_t flag_status = LL_TIM_READ_REG(p_tim, SR);
  const uint32_t it_sources = LL_TIM_READ_REG(p_tim, DIER);
  const uint32_t flag_status_masked = flag_status & it_sources; /* Logical AND between flags status and interrupts
                                                                   sources enabled (for registers bitfields aligned) */

  if ((flag_status_masked & LL_TIM_SR_TIF) != 0UL)
  {
    LL_TIM_ClearFlag_TRIG(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->trigger_callback(htim);
#else
    HAL_TIM_TriggerCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_COMIF) != 0UL)
  {
    LL_TIM_ClearFlag_COM(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->commutation_callback(htim);
#else
    HAL_TIM_CommutationCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_DIRF) != 0UL)
  {
    LL_TIM_ClearFlag_DIR(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->direction_change_callback(htim);
#else
    HAL_TIM_DirectionChangeCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }

  if ((flag_status_masked & LL_TIM_SR_IDXF) != 0UL)
  {
    LL_TIM_ClearFlag_IDX(p_tim);

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)
    htim->encoder_index_callback(htim);
#else
    HAL_TIM_EncoderIndexCallback(htim);
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
  }
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief DMA Error callback \n
  *        This function is called in case of a DMA transfer error.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_ErrorCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief DMA Stop callback \n
  *        This function is called after stopping a DMA transfer either triggered
  *        by the timer update event, the commutation event or the trigger event.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_StopCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_StopCallback can be implemented in the user file.
   */
}

/**
  * @brief DMA Channel Stop callback \n
  *        This function is called after stopping a DMA transfer triggered
  *        by a capture/compare event.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param channel  Channel stopped for the capture/compare.
  */
__WEAK void HAL_TIM_ChannelStopCallback(hal_tim_handle_t *htim,
                                        hal_tim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(channel);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_ChannelStopCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Update callback. \n
  *        Function called when the timer update interrupt is generated or when
  *        the DMA transfer triggered by the timer update DMA request is completed.
  *
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_UpdateCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

