MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_UpdateCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Update Half Complete callback. \n
  *        Function called when the DMA transfer triggered by the timer update
  *        DMA request is half completed.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_UpdateHalfCpltCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_UpdateHalfCpltCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Trigger callback. \n
  *        Function called when the timer trigger interrupt is generated or when
  *        the DMA transfer triggered by the timer trigger DMA request is completed.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_TriggerCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_TriggerCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Trigger Half Complete callback. \n
  *        Function called when the DMA transfer triggered by the timer trigger
  *        DMA request is half completed.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_TriggerHalfCpltCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_TriggerHalfCpltCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Input Capture callback. \n
  *        Function called when an input capture interrupt is generated or when
  *        the DMA transfer triggered by the an input capture DMA request is completed.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param channel  Channel for the input capture.
  */
__WEAK void HAL_TIM_InputCaptureCallback(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(channel);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_InputCaptureCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Input Capture Half Complete callback. \n
  *        Function called when the DMA transfer triggered by an input capture
  *        DMA request is half completed.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param channel  Channel for the input capture.
  */
__WEAK void HAL_TIM_InputCaptureHalfCpltCallback(hal_tim_handle_t *htim,
                                                 hal_tim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(channel);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_InputCaptureHalfCpltCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Compare Match callback. \n
  *        Function called when a compare match interrupt is generated or when the
  *        DMA transfer triggered by the compare match DMA request is completed.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param channel  Channel for the output compare.
  */
__WEAK void HAL_TIM_CompareMatchCallback(hal_tim_handle_t *htim,
                                         hal_tim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(channel);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_CompareMatchCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)

/**
  * @brief Compare Match Half Complete callback. \n
  *        Function called when the DMA transfer triggered by compare matche DMA
  *        request is half completed.
  * @param htim     Pointer to the handle of the TIM instance.
  * @param channel  Channel for the output compare.
  */
__WEAK void HAL_TIM_CompareMatchHalfCpltCallback(hal_tim_handle_t *htim,
                                                 hal_tim_channel_t channel)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(channel);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_CompareMatchHalfCpltCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Commutation callback. \n
  *        Function called when the timer commutation interrupt is generated or
  *        when the DMA transfer triggered by the commutation DMA request is completed.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_CommutationCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_CommutationCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief Commutation Half Complete callback. \n
  *        Function called when the DMA transfer triggered by the commutation DMA
  *        request is half completed.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_CommutationHalfCpltCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

