MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_CommutationHalfCpltCallback can be implemented in the user file.
   */
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief Break callback. \n
  *        Function called when the break interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_BreakCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_BreakCallback can be implemented in the user file.
   */
}

/**
  * @brief Break2 callback. \n
  *        Function called when the break2 interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_Break2Callback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_Break2Callback can be implemented in the user file.
   */
}

/**
  * @brief System Break callback. \n
  *        Function called when the system break interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_SystemBreakCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_SystemBreakCallback can be implemented in the user file.
   */
}

/**
  * @brief Software Break callback. \n
  *        Function called when the software break interrupt is generated.
  * @param htim   Pointer to the handle of the TIM instance.
  * @param brkin  The break input of interest.
  */
__WEAK void HAL_TIM_SoftwareBreakCallback(hal_tim_handle_t *htim, hal_tim_break_input_id_t brkin)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);
  STM32_UNUSED(brkin);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_SoftwareBreakCallback can be implemented in the user file.
   */
}

/**
  * @brief Encoder Index callback. \n
  *        Could be renamed HAL_TIM_IndexCallback
  *        Function called when the index interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_EncoderIndexCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_EncoderIndexCallback can be implemented in the user file.
   */
}

/**
  * @brief Encoder Direction Change callback. \n
  *        Function called when the direction change interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_DirectionChangeCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_DirectionChangeCallback can be implemented in the user file.
   */
}

/**
  * @brief Index Error callback. \n
  *        Function called when the index error interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_IndexErrorCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_IndexErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief Transition Error callback. \n
  *        Function called when the transition error interrupt is generated.
  * @param htim  Pointer to the handle of the TIM instance.
  */
__WEAK void HAL_TIM_TransitionErrorCallback(hal_tim_handle_t *htim)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(htim);

  /*
   * WARNING : This function must preferably not be modified, when the callback is needed,
   *           HAL_TIM_TransitionErrorCallback can be implemented in the user file.
   */
}

#if defined(USE_HAL_TIM_REGISTER_CALLBACKS) && (USE_HAL_TIM_REGISTER_CALLBACKS == 1)

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the DMA Error.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterErrorCallback(hal_tim_handle_t *htim,
                                           hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->error_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the DMA stop callback.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterStopCallback(hal_tim_handle_t *htim,
                                          hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->stop_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the DMA channel stop callback.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterChannelStopCallback(hal_tim_handle_t *htim,
                                                 hal_tim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->channel_stop_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Update event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterUpdateCallback(hal_tim_handle_t *htim,
                                            hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->update_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the DMA Half Complete transfer
  *         triggered on Update event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterUpdateHalfCpltCallback(hal_tim_handle_t *htim,
                                                    hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->update_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Trigger event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterTriggerCallback(hal_tim_handle_t *htim,
                                             hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->trigger_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the DMA Half Complete transfer
  *         triggered by a Trigger event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterTriggerHalfCpltCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

