MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  htim->trigger_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Input Capture event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterInputCaptureCallback(hal_tim_handle_t *htim,
                                                  hal_tim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->input_capture_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the DMA Half Complete transfer
  *         triggered by an Input Capture event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterInputCaptureHalfCpltCallback(hal_tim_handle_t *htim,
                                                          hal_tim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->input_capture_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Compare Match event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterCompareMatchCallback(hal_tim_handle_t *htim,
                                                  hal_tim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->compare_match_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the Half Complete DMA transfer
  *         triggered by a Compare Match event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterCompareMatchHalfCpltCallback(hal_tim_handle_t *htim,
                                                          hal_tim_channel_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->compare_match_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Commutation event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterCommutationCallback(hal_tim_handle_t *htim,
                                                 hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->commutation_callback = fct;

  return HAL_OK;
}

#if defined(USE_HAL_TIM_DMA) && (USE_HAL_TIM_DMA == 1)
/**
  * @brief  Callback registration for the DMA Half Complete transfer
  *         triggered by a Commutation event.
  *         for the timer.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterCommutationHalfCpltCallback(hal_tim_handle_t *htim,
                                                         hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->commutation_half_cplt_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_DMA */

/**
  * @brief  Callback registration for the Break event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterBreakCallback(hal_tim_handle_t *htim,
                                           hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->break_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Break 2 event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterBreak2Callback(hal_tim_handle_t *htim,
                                            hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->break2_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the System Break event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterSystemBreakCallback(hal_tim_handle_t *htim,
                                                 hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->system_break_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Software Break event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterSoftwareBreakCallback(hal_tim_handle_t *htim,
                                                   hal_tim_break_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->software_break_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Encoder Index event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterEncoderIndexCallback(hal_tim_handle_t *htim,
                                                  hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->encoder_index_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Encoder Direction Change event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterDirectionChangeCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

