MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tim.c
  htim->direction_change_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Encoder Index Error event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterIndexErrorCallback(hal_tim_handle_t *htim,
                                                hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->index_error_callback = fct;

  return HAL_OK;
}

/**
  * @brief  Callback registration for the Encoder Transition Error event.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @param  fct   Function to register as callback.
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM fct is NULL (only if USE_HAL_CHECK_PARAM == 1)
  */
hal_status_t HAL_TIM_RegisterTransitionErrorCallback(hal_tim_handle_t *htim,
                                                     hal_tim_cb_t fct)
{
  ASSERT_DBG_PARAM((htim != NULL));
  ASSERT_DBG_PARAM((fct != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM ==1)
  if (fct == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  htim->transition_error_callback = fct;

  return HAL_OK;
}
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

/**
  *  @}
  */

/** @addtogroup TIM_Exported_Functions_Group18
  * @brief The user data pointer, *p_user_data, in the HAL TIM handle allows
  *        user to associate applicative user data to the HAL TIM handle.
  *        Thus, the two functions in this group give an application the
  *        possibility to store and retrieve user data pointer into and
  *        from the handle.
  *
  * @{
  */
#if defined (USE_HAL_TIM_USER_DATA) && (USE_HAL_TIM_USER_DATA == 1)
/**
  * @brief Store User Data pointer into the handle.
  * @param htim         Pointer to the handle of the TIM instance.
  * @param p_user_data  Pointer to the user data.
  */
void HAL_TIM_SetUserData(hal_tim_handle_t *htim, const void *p_user_data)
{
  ASSERT_DBG_PARAM((htim != NULL));

  htim->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve User Data pointer from the handle.
  * @param  htim  Pointer to the handle of the TIM instance.
  * @retval (void*) Pointer to the user data, when previously
  *         set by @ref HAL_TIM_SetUserData().
  * @retval NULL otherwise.
  */
const void *HAL_TIM_GetUserData(const hal_tim_handle_t *htim)
{
  ASSERT_DBG_PARAM((htim != NULL));

  return htim->p_user_data;
}
#endif /* USE_HAL_TIM_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_TIM_MODULE */
#endif /* TIM1 || TIM2 || TIM3 || TIM4 || TIM5 || TIM6 || TIM7 || TIM8 || TIM12 || TIM15 || TIM16 || TIM17 */
/**
  * @}
  */
